747lulu747/SAOZHAN_BRUASH/src/SDK-LIB/华芯第一版本硬件-非FPC/ROMAN-21DD - SDK - V0.1/out/SWM211.asm

========================================================================

** ELF Header Information

    File Name: C:\Users\90604\Desktop\SWM211_TC_LDS_21p_20230306_V1.0\out\SWM211.axf

    Machine class: ELFCLASS32 (32-bit)
    Data encoding: ELFDATA2LSB (Little endian)
    Header version: EV_CURRENT (Current version)
    Operating System ABI: none
    ABI Version: 0
    File Type: ET_EXEC (Executable) (2)
    Machine: EM_ARM (ARM)

    Image Entry point: 0x00000121
    Flags: EF_ARM_HASENTRY + EF_ARM_ABI_FLOAT_SOFT (0x05000202)

    ARM ELF revision: 5 (ABI version 2)

    Conforms to Soft float procedure-call standard

    Built with
    Component: ARM Compiler 5.06 update 6 (build 750) Tool: armasm [4d35ec]
    Component: ARM Compiler 5.06 update 6 (build 750) Tool: armlink [4d35ed]

    Header size: 52 bytes (0x34)
    Program header entry size: 32 bytes (0x20)
    Section header entry size: 40 bytes (0x28)

    Program header entries: 1
    Section header entries: 16

    Program header offset: 273932 (0x00042e0c)
    Section header offset: 273964 (0x00042e2c)

    Section header string table index: 15

========================================================================

** Program header #0 (PT_LOAD) [PF_X + PF_W + PF_R + PF_ARM_ENTRY]
    Size : 20920 bytes (15956 bytes in file)
    Virtual address: 0x00000000 (Alignment 8)


========================================================================

** Section #1 'ER_IROM1' (SHT_PROGBITS) [SHF_ALLOC + SHF_EXECINSTR]
    Size   : 15856 bytes (alignment 4)
    Address: 0x00000000

    $d
    RESET
    __Vectors
        0x00000000:    200013c8    ...     DCD    536875976
        0x00000004:    000000c1    ....    DCD    193
        0x00000008:    000000cb    ....    DCD    203
        0x0000000c:    000000cd    ....    DCD    205
        0x00000010:    00000000    ....    DCD    0
        0x00000014:    00000000    ....    DCD    0
        0x00000018:    00000000    ....    DCD    0
        0x0000001c:    00000000    ....    DCD    0
        0x00000020:    00000000    ....    DCD    0
        0x00000024:    00000000    ....    DCD    0
        0x00000028:    00000000    ....    DCD    0
        0x0000002c:    000000cf    ....    DCD    207
        0x00000030:    00000000    ....    DCD    0
        0x00000034:    00000000    ....    DCD    0
        0x00000038:    000000d1    ....    DCD    209
        0x0000003c:    00002ea5    ....    DCD    11941
        0x00000040:    000000d5    ....    DCD    213
        0x00000044:    00002ff9    ./..    DCD    12281
        0x00000048:    000000d9    ....    DCD    217
        0x0000004c:    000000db    ....    DCD    219
        0x00000050:    000000dd    ....    DCD    221
        0x00000054:    0000305d    ]0..    DCD    12381
        0x00000058:    000000e1    ....    DCD    225
        0x0000005c:    00000711    ....    DCD    1809
        0x00000060:    000000e5    ....    DCD    229
        0x00000064:    000000e7    ....    DCD    231
        0x00000068:    00000000    ....    DCD    0
        0x0000006c:    000000e9    ....    DCD    233
        0x00000070:    000000eb    ....    DCD    235
        0x00000074:    000000ed    ....    DCD    237
        0x00000078:    00000d4d    M...    DCD    3405
        0x0000007c:    00000d09    ....    DCD    3337
        0x00000080:    000000f3    ....    DCD    243
        0x00000084:    000000f5    ....    DCD    245
        0x00000088:    000000f7    ....    DCD    247
        0x0000008c:    000000f9    ....    DCD    249
        0x00000090:    000000fb    ....    DCD    251
        0x00000094:    000000fd    ....    DCD    253
        0x00000098:    000000ff    ....    DCD    255
        0x0000009c:    00000101    ....    DCD    257
        0x000000a0:    00000103    ....    DCD    259
        0x000000a4:    00000105    ....    DCD    261
        0x000000a8:    00000107    ....    DCD    263
        0x000000ac:    00000109    ....    DCD    265
        0x000000b0:    0000010b    ....    DCD    267
        0x000000b4:    0000010d    ....    DCD    269
        0x000000b8:    0000010f    ....    DCD    271
        0x000000bc:    00000111    ....    DCD    273
    $t
    Reset_Handler
    __Vectors_End
        0x000000c0:    4814        .H      LDR      r0,[pc,#80] ; [0x114] = 0x4004a00c
        0x000000c2:    4915        .I      LDR      r1,[pc,#84] ; [0x118] = 0x50000
        0x000000c4:    6001        .`      STR      r1,[r0,#0]
        0x000000c6:    4815        .H      LDR      r0,[pc,#84] ; [0x11c] = 0x121
        0x000000c8:    4700        .G      BX       r0
    NMI_Handler
        0x000000ca:    e7fe        ..      B        NMI_Handler ; 0xca
    HardFault_Handler
        0x000000cc:    e7fe        ..      B        HardFault_Handler ; 0xcc
    SVC_Handler
        0x000000ce:    e7fe        ..      B        SVC_Handler ; 0xce
    PendSV_Handler
        0x000000d0:    e7fe        ..      B        PendSV_Handler ; 0xd0
        0x000000d2:    e7fe        ..      B        0xd2 ; PendSV_Handler + 2
    UART0_Handler
        0x000000d4:    e7fe        ..      B        UART0_Handler ; 0xd4
        0x000000d6:    e7fe        ..      B        0xd6 ; UART0_Handler + 2
    CORDIC_Handler
        0x000000d8:    e7fe        ..      B        CORDIC_Handler ; 0xd8
    UART1_Handler
        0x000000da:    e7fe        ..      B        UART1_Handler ; 0xda
    PWM1_Handler
        0x000000dc:    e7fe        ..      B        PWM1_Handler ; 0xdc
        0x000000de:    e7fe        ..      B        0xde ; PWM1_Handler + 2
    HALL_Handler
        0x000000e0:    e7fe        ..      B        HALL_Handler ; 0xe0
        0x000000e2:    e7fe        ..      B        0xe2 ; HALL_Handler + 2
    BOD_Handler
        0x000000e4:    e7fe        ..      B        BOD_Handler ; 0xe4
    PWMBRK_Handler
        0x000000e6:    e7fe        ..      B        PWMBRK_Handler ; 0xe6
    WDT_Handler
        0x000000e8:    e7fe        ..      B        WDT_Handler ; 0xe8
    I2C0_Handler
        0x000000ea:    e7fe        ..      B        I2C0_Handler ; 0xea
    XTALSTOP_Handler
        0x000000ec:    e7fe        ..      B        XTALSTOP_Handler ; 0xec
        0x000000ee:    e7fe        ..      B        0xee ; XTALSTOP_Handler + 2
        0x000000f0:    e7fe        ..      B        0xf0 ; XTALSTOP_Handler + 4
    BTIMR0_Handler
        0x000000f2:    e7fe        ..      B        BTIMR0_Handler ; 0xf2
    BTIMR1_Handler
        0x000000f4:    e7fe        ..      B        BTIMR1_Handler ; 0xf4
    BTIMR2_Handler
        0x000000f6:    e7fe        ..      B        BTIMR2_Handler ; 0xf6
    BTIMR3_Handler
        0x000000f8:    e7fe        ..      B        BTIMR3_Handler ; 0xf8
    GPIOA_Handler
        0x000000fa:    e7fe        ..      B        GPIOA_Handler ; 0xfa
    GPIOB_Handler
        0x000000fc:    e7fe        ..      B        GPIOB_Handler ; 0xfc
    GPIOM_Handler
        0x000000fe:    e7fe        ..      B        GPIOM_Handler ; 0xfe
    GPIOA0_GPIOM0_SPI1_Handler
        0x00000100:    e7fe        ..      B        GPIOA0_GPIOM0_SPI1_Handler ; 0x100
    GPIOA1_GPIOM1_MPU_Handler
        0x00000102:    e7fe        ..      B        GPIOA1_GPIOM1_MPU_Handler ; 0x102
    GPIOA2_GPIOM2_Handler
        0x00000104:    e7fe        ..      B        GPIOA2_GPIOM2_Handler ; 0x104
    GPIOA3_GPIOM3_Handler
        0x00000106:    e7fe        ..      B        GPIOA3_GPIOM3_Handler ; 0x106
    GPIOB0_GPIOA8_TIMR2_Handler
        0x00000108:    e7fe        ..      B        GPIOB0_GPIOA8_TIMR2_Handler ; 0x108
    GPIOB1_GPIOA9_DMA_Handler
        0x0000010a:    e7fe        ..      B        GPIOB1_GPIOA9_DMA_Handler ; 0x10a
    GPIOB2_GPIOA10_CAN0_Handler
        0x0000010c:    e7fe        ..      B        GPIOB2_GPIOA10_CAN0_Handler ; 0x10c
    GPIOB3_GPIOA11_SPI0_Handler
        0x0000010e:    e7fe        ..      B        GPIOB3_GPIOA11_SPI0_Handler ; 0x10e
    GPIOB4_GPIOB10_QEI_Handler
        0x00000110:    e7fe        ..      B        GPIOB4_GPIOB10_QEI_Handler ; 0x110
    $d
        0x00000112:    0000        ..      DCW    0
        0x00000114:    4004a00c    ...@    DCD    1074044940
        0x00000118:    00050000    ....    DCD    327680
        0x0000011c:    00000121    !...    DCD    289
    $t
    .ARM.Collect$$$$00000000
    .ARM.Collect$$$$00000001
    __main
    _main_stk
        0x00000120:    4803        .H      LDR      r0,__lit__00000000 ; [0x130] = 0x200013c8
        0x00000122:    4685        .F      MOV      sp,r0
    .ARM.Collect$$$$00000004
    _main_scatterload
        0x00000124:    f000fae2    ....    BL       __scatterload ; 0x6ec
    .ARM.Collect$$$$00000008
    .ARM.Collect$$$$0000000A
    .ARM.Collect$$$$0000000B
    __main_after_scatterload
    _main_clock
    _main_cpp_init
    _main_init
        0x00000128:    4800        .H      LDR      r0,[pc,#0] ; [0x12c] = 0x36bd
        0x0000012a:    4700        .G      BX       r0
    $d
        0x0000012c:    000036bd    .6..    DCD    14013
    .ARM.Collect$$$$00002712
    __lit__00000000
    .ARM.Collect$$$$0000000D
    .ARM.Collect$$$$0000000F
    __rt_final_cpp
    __rt_final_exit
        0x00000130:    200013c8    ...     DCD    536875976
    $t
    .text
    __aeabi_uidiv
    __aeabi_uidivmod
        0x00000134:    b530        0.      PUSH     {r4,r5,lr}
        0x00000136:    460b        .F      MOV      r3,r1
        0x00000138:    4601        .F      MOV      r1,r0
        0x0000013a:    2000        .       MOVS     r0,#0
        0x0000013c:    2220         "      MOVS     r2,#0x20
        0x0000013e:    2401        .$      MOVS     r4,#1
        0x00000140:    e009        ..      B        0x156 ; __aeabi_uidiv + 34
        0x00000142:    460d        .F      MOV      r5,r1
        0x00000144:    40d5        .@      LSRS     r5,r5,r2
        0x00000146:    429d        .B      CMP      r5,r3
        0x00000148:    d305        ..      BCC      0x156 ; __aeabi_uidiv + 34
        0x0000014a:    461d        .F      MOV      r5,r3
        0x0000014c:    4095        .@      LSLS     r5,r5,r2
        0x0000014e:    1b49        I.      SUBS     r1,r1,r5
        0x00000150:    4625        %F      MOV      r5,r4
        0x00000152:    4095        .@      LSLS     r5,r5,r2
        0x00000154:    1940        @.      ADDS     r0,r0,r5
        0x00000156:    4615        .F      MOV      r5,r2
        0x00000158:    1e52        R.      SUBS     r2,r2,#1
        0x0000015a:    2d00        .-      CMP      r5,#0
        0x0000015c:    dcf1        ..      BGT      0x142 ; __aeabi_uidiv + 14
        0x0000015e:    bd30        0.      POP      {r4,r5,pc}
    .text
    __aeabi_idiv
    __aeabi_idivmod
        0x00000160:    b570        p.      PUSH     {r4-r6,lr}
        0x00000162:    2400        .$      MOVS     r4,#0
        0x00000164:    4625        %F      MOV      r5,r4
        0x00000166:    2800        .(      CMP      r0,#0
        0x00000168:    da01        ..      BGE      0x16e ; __aeabi_idiv + 14
        0x0000016a:    2401        .$      MOVS     r4,#1
        0x0000016c:    4240        @B      RSBS     r0,r0,#0
        0x0000016e:    2900        .)      CMP      r1,#0
        0x00000170:    da01        ..      BGE      0x176 ; __aeabi_idiv + 22
        0x00000172:    2501        .%      MOVS     r5,#1
        0x00000174:    4249        IB      RSBS     r1,r1,#0
        0x00000176:    f7ffffdd    ....    BL       __aeabi_uidiv ; 0x134
        0x0000017a:    42ac        .B      CMP      r4,r5
        0x0000017c:    d000        ..      BEQ      0x180 ; __aeabi_idiv + 32
        0x0000017e:    4240        @B      RSBS     r0,r0,#0
        0x00000180:    2c00        .,      CMP      r4,#0
        0x00000182:    d000        ..      BEQ      0x186 ; __aeabi_idiv + 38
        0x00000184:    4249        IB      RSBS     r1,r1,#0
        0x00000186:    bd70        p.      POP      {r4-r6,pc}
    .text
    __aeabi_memset
    __aeabi_memset4
    __aeabi_memset8
        0x00000188:    b2d2        ..      UXTB     r2,r2
        0x0000018a:    e001        ..      B        0x190 ; __aeabi_memset + 8
        0x0000018c:    7002        .p      STRB     r2,[r0,#0]
        0x0000018e:    1c40        @.      ADDS     r0,r0,#1
        0x00000190:    1e49        I.      SUBS     r1,r1,#1
        0x00000192:    d2fb        ..      BCS      0x18c ; __aeabi_memset + 4
        0x00000194:    4770        pG      BX       lr
    __aeabi_memclr
    __aeabi_memclr4
    __aeabi_memclr8
        0x00000196:    2200        ."      MOVS     r2,#0
        0x00000198:    e7f6        ..      B        __aeabi_memset ; 0x188
    _memset$wrapper
        0x0000019a:    b510        ..      PUSH     {r4,lr}
        0x0000019c:    4613        .F      MOV      r3,r2
        0x0000019e:    460a        .F      MOV      r2,r1
        0x000001a0:    4604        .F      MOV      r4,r0
        0x000001a2:    4619        .F      MOV      r1,r3
        0x000001a4:    f7fffff0    ....    BL       __aeabi_memset ; 0x188
        0x000001a8:    4620         F      MOV      r0,r4
        0x000001aa:    bd10        ..      POP      {r4,pc}
    .text
    __aeabi_dadd
        0x000001ac:    b5f0        ..      PUSH     {r4-r7,lr}
        0x000001ae:    4607        .F      MOV      r7,r0
        0x000001b0:    4608        .F      MOV      r0,r1
        0x000001b2:    4058        X@      EORS     r0,r0,r3
        0x000001b4:    b087        ..      SUB      sp,sp,#0x1c
        0x000001b6:    0fc0        ..      LSRS     r0,r0,#31
        0x000001b8:    9004        ..      STR      r0,[sp,#0x10]
        0x000001ba:    0048        H.      LSLS     r0,r1,#1
        0x000001bc:    460e        .F      MOV      r6,r1
        0x000001be:    0059        Y.      LSLS     r1,r3,#1
        0x000001c0:    0840        @.      LSRS     r0,r0,#1
        0x000001c2:    0849        I.      LSRS     r1,r1,#1
        0x000001c4:    1abc        ..      SUBS     r4,r7,r2
        0x000001c6:    4188        .A      SBCS     r0,r0,r1
        0x000001c8:    d205        ..      BCS      0x1d6 ; __aeabi_dadd + 42
        0x000001ca:    4638        8F      MOV      r0,r7
        0x000001cc:    4631        1F      MOV      r1,r6
        0x000001ce:    461e        .F      MOV      r6,r3
        0x000001d0:    4617        .F      MOV      r7,r2
        0x000001d2:    460b        .F      MOV      r3,r1
        0x000001d4:    4602        .F      MOV      r2,r0
        0x000001d6:    0058        X.      LSLS     r0,r3,#1
        0x000001d8:    0840        @.      LSRS     r0,r0,#1
        0x000001da:    4310        .C      ORRS     r0,r0,r2
        0x000001dc:    d04c        L.      BEQ      0x278 ; __aeabi_dadd + 204
        0x000001de:    0d30        0.      LSRS     r0,r6,#20
        0x000001e0:    9003        ..      STR      r0,[sp,#0xc]
        0x000001e2:    0540        @.      LSLS     r0,r0,#21
        0x000001e4:    0059        Y.      LSLS     r1,r3,#1
        0x000001e6:    0d40        @.      LSRS     r0,r0,#21
        0x000001e8:    0d49        I.      LSRS     r1,r1,#21
        0x000001ea:    9005        ..      STR      r0,[sp,#0x14]
        0x000001ec:    1a40        @.      SUBS     r0,r0,r1
        0x000001ee:    9002        ..      STR      r0,[sp,#8]
        0x000001f0:    2840        @(      CMP      r0,#0x40
        0x000001f2:    da72        r.      BGE      0x2da ; __aeabi_dadd + 302
        0x000001f4:    0318        ..      LSLS     r0,r3,#12
        0x000001f6:    2101        .!      MOVS     r1,#1
        0x000001f8:    0b00        ..      LSRS     r0,r0,#12
        0x000001fa:    0509        ..      LSLS     r1,r1,#20
        0x000001fc:    4308        .C      ORRS     r0,r0,r1
        0x000001fe:    9001        ..      STR      r0,[sp,#4]
        0x00000200:    9804        ..      LDR      r0,[sp,#0x10]
        0x00000202:    9200        ..      STR      r2,[sp,#0]
        0x00000204:    2800        .(      CMP      r0,#0
        0x00000206:    d005        ..      BEQ      0x214 ; __aeabi_dadd + 104
        0x00000208:    9901        ..      LDR      r1,[sp,#4]
        0x0000020a:    4252        RB      RSBS     r2,r2,#0
        0x0000020c:    2000        .       MOVS     r0,#0
        0x0000020e:    4188        .A      SBCS     r0,r0,r1
        0x00000210:    9200        ..      STR      r2,[sp,#0]
        0x00000212:    9001        ..      STR      r0,[sp,#4]
        0x00000214:    9802        ..      LDR      r0,[sp,#8]
        0x00000216:    2140        @!      MOVS     r1,#0x40
        0x00000218:    1a0a        ..      SUBS     r2,r1,r0
        0x0000021a:    9901        ..      LDR      r1,[sp,#4]
        0x0000021c:    9800        ..      LDR      r0,[sp,#0]
        0x0000021e:    f000f9d1    ....    BL       __aeabi_llsl ; 0x5c4
        0x00000222:    4605        .F      MOV      r5,r0
        0x00000224:    460c        .F      MOV      r4,r1
        0x00000226:    466b        kF      MOV      r3,sp
        0x00000228:    cb07        ..      LDM      r3!,{r0-r2}
        0x0000022a:    f000f9ec    ....    BL       __aeabi_lasr ; 0x606
        0x0000022e:    19c0        ..      ADDS     r0,r0,r7
        0x00000230:    4171        qA      ADCS     r1,r1,r6
        0x00000232:    9a03        ..      LDR      r2,[sp,#0xc]
        0x00000234:    0d0e        ..      LSRS     r6,r1,#20
        0x00000236:    2300        .#      MOVS     r3,#0
        0x00000238:    17d7        ..      ASRS     r7,r2,#31
        0x0000023a:    4056        V@      EORS     r6,r6,r2
        0x0000023c:    461a        .F      MOV      r2,r3
        0x0000023e:    407a        z@      EORS     r2,r2,r7
        0x00000240:    4316        .C      ORRS     r6,r6,r2
        0x00000242:    d044        D.      BEQ      0x2ce ; __aeabi_dadd + 290
        0x00000244:    9a04        ..      LDR      r2,[sp,#0x10]
        0x00000246:    2a00        .*      CMP      r2,#0
        0x00000248:    d02d        -.      BEQ      0x2a6 ; __aeabi_dadd + 250
        0x0000024a:    9a02        ..      LDR      r2,[sp,#8]
        0x0000024c:    2a01        .*      CMP      r2,#1
        0x0000024e:    9a03        ..      LDR      r2,[sp,#0xc]
        0x00000250:    dc15        ..      BGT      0x27e ; __aeabi_dadd + 210
        0x00000252:    0512        ..      LSLS     r2,r2,#20
        0x00000254:    1ac0        ..      SUBS     r0,r0,r3
        0x00000256:    4191        .A      SBCS     r1,r1,r2
        0x00000258:    2601        .&      MOVS     r6,#1
        0x0000025a:    0536        6.      LSLS     r6,r6,#20
        0x0000025c:    1c00        ..      ADDS     r0,r0,#0
        0x0000025e:    4171        qA      ADCS     r1,r1,r6
        0x00000260:    0fd2        ..      LSRS     r2,r2,#31
        0x00000262:    9e05        ..      LDR      r6,[sp,#0x14]
        0x00000264:    07d2        ..      LSLS     r2,r2,#31
        0x00000266:    9300        ..      STR      r3,[sp,#0]
        0x00000268:    9201        ..      STR      r2,[sp,#4]
        0x0000026a:    9602        ..      STR      r6,[sp,#8]
        0x0000026c:    462a        *F      MOV      r2,r5
        0x0000026e:    4623        #F      MOV      r3,r4
        0x00000270:    f000f9e9    ....    BL       _double_epilogue ; 0x646
        0x00000274:    b007        ..      ADD      sp,sp,#0x1c
        0x00000276:    bdf0        ..      POP      {r4-r7,pc}
        0x00000278:    4638        8F      MOV      r0,r7
        0x0000027a:    4631        1F      MOV      r1,r6
        0x0000027c:    e7fa        ..      B        0x274 ; __aeabi_dadd + 200
        0x0000027e:    0516        ..      LSLS     r6,r2,#20
        0x00000280:    4a22        "J      LDR      r2,[pc,#136] ; [0x30c] = 0xffe00000
        0x00000282:    460f        .F      MOV      r7,r1
        0x00000284:    18b2        ..      ADDS     r2,r6,r2
        0x00000286:    1ac0        ..      SUBS     r0,r0,r3
        0x00000288:    41b7        .A      SBCS     r7,r7,r6
        0x0000028a:    2101        .!      MOVS     r1,#1
        0x0000028c:    0509        ..      LSLS     r1,r1,#20
        0x0000028e:    1c00        ..      ADDS     r0,r0,#0
        0x00000290:    414f        OA      ADCS     r7,r7,r1
        0x00000292:    1800        ..      ADDS     r0,r0,r0
        0x00000294:    417f        .A      ADCS     r7,r7,r7
        0x00000296:    4611        .F      MOV      r1,r2
        0x00000298:    1818        ..      ADDS     r0,r3,r0
        0x0000029a:    4179        yA      ADCS     r1,r1,r7
        0x0000029c:    0fe2        ..      LSRS     r2,r4,#31
        0x0000029e:    4310        .C      ORRS     r0,r0,r2
        0x000002a0:    196d        m.      ADDS     r5,r5,r5
        0x000002a2:    4164        dA      ADCS     r4,r4,r4
        0x000002a4:    e013        ..      B        0x2ce ; __aeabi_dadd + 290
        0x000002a6:    07e2        ..      LSLS     r2,r4,#31
        0x000002a8:    086d        m.      LSRS     r5,r5,#1
        0x000002aa:    4315        .C      ORRS     r5,r5,r2
        0x000002ac:    0864        d.      LSRS     r4,r4,#1
        0x000002ae:    07c2        ..      LSLS     r2,r0,#31
        0x000002b0:    4314        .C      ORRS     r4,r4,r2
        0x000002b2:    9a03        ..      LDR      r2,[sp,#0xc]
        0x000002b4:    2601        .&      MOVS     r6,#1
        0x000002b6:    0512        ..      LSLS     r2,r2,#20
        0x000002b8:    1ac0        ..      SUBS     r0,r0,r3
        0x000002ba:    4191        .A      SBCS     r1,r1,r2
        0x000002bc:    0536        6.      LSLS     r6,r6,#20
        0x000002be:    1c00        ..      ADDS     r0,r0,#0
        0x000002c0:    4171        qA      ADCS     r1,r1,r6
        0x000002c2:    07ce        ..      LSLS     r6,r1,#31
        0x000002c4:    0840        @.      LSRS     r0,r0,#1
        0x000002c6:    4330        0C      ORRS     r0,r0,r6
        0x000002c8:    0849        I.      LSRS     r1,r1,#1
        0x000002ca:    18c0        ..      ADDS     r0,r0,r3
        0x000002cc:    4151        QA      ADCS     r1,r1,r2
        0x000002ce:    462a        *F      MOV      r2,r5
        0x000002d0:    4623        #F      MOV      r3,r4
        0x000002d2:    f000f9ab    ....    BL       __I$use$fp ; 0x62c
        0x000002d6:    e7cd        ..      B        0x274 ; __aeabi_dadd + 200
        0x000002d8:    e7ff        ..      B        0x2da ; __aeabi_dadd + 302
        0x000002da:    9804        ..      LDR      r0,[sp,#0x10]
        0x000002dc:    2201        ."      MOVS     r2,#1
        0x000002de:    0040        @.      LSLS     r0,r0,#1
        0x000002e0:    17c1        ..      ASRS     r1,r0,#31
        0x000002e2:    1a12        ..      SUBS     r2,r2,r0
        0x000002e4:    2300        .#      MOVS     r3,#0
        0x000002e6:    418b        .A      SBCS     r3,r3,r1
        0x000002e8:    9804        ..      LDR      r0,[sp,#0x10]
        0x000002ea:    4631        1F      MOV      r1,r6
        0x000002ec:    17c4        ..      ASRS     r4,r0,#31
        0x000002ee:    1a38        8.      SUBS     r0,r7,r0
        0x000002f0:    41a1        .A      SBCS     r1,r1,r4
        0x000002f2:    e7ee        ..      B        0x2d2 ; __aeabi_dadd + 294
    __aeabi_dsub
        0x000002f4:    b430        0.      PUSH     {r4,r5}
        0x000002f6:    2401        .$      MOVS     r4,#1
        0x000002f8:    07e4        ..      LSLS     r4,r4,#31
        0x000002fa:    4063        c@      EORS     r3,r3,r4
        0x000002fc:    bc30        0.      POP      {r4,r5}
        0x000002fe:    e755        U.      B        __aeabi_dadd ; 0x1ac
    __aeabi_drsub
        0x00000300:    b430        0.      PUSH     {r4,r5}
        0x00000302:    2401        .$      MOVS     r4,#1
        0x00000304:    07e4        ..      LSLS     r4,r4,#31
        0x00000306:    4061        a@      EORS     r1,r1,r4
        0x00000308:    bc30        0.      POP      {r4,r5}
        0x0000030a:    e74f        O.      B        __aeabi_dadd ; 0x1ac
    $d
