747lulu747/SAOZHAN_BRUASH/src/SDK-LIB/华芯第一版本硬件-非FPC/ROMAN-21DD - SDK - V0.1/out/SWM211.asm
        0x00000612:    4110        .A      ASRS     r0,r0,r2
        0x00000614:    17c1        ..      ASRS     r1,r0,#31
        0x00000616:    430b        .C      ORRS     r3,r3,r1
        0x00000618:    e006        ..      B        0x628 ; __aeabi_lasr + 34
        0x0000061a:    460b        .F      MOV      r3,r1
        0x0000061c:    4113        .A      ASRS     r3,r3,r2
        0x0000061e:    40d0        .@      LSRS     r0,r0,r2
        0x00000620:    2420         $      MOVS     r4,#0x20
        0x00000622:    1aa2        ..      SUBS     r2,r4,r2
        0x00000624:    4091        .@      LSLS     r1,r1,r2
        0x00000626:    4308        .C      ORRS     r0,r0,r1
        0x00000628:    4619        .F      MOV      r1,r3
        0x0000062a:    bd10        ..      POP      {r4,pc}
    .text
    .text
    __I$use$fp
    _double_round
        0x0000062c:    b510        ..      PUSH     {r4,lr}
        0x0000062e:    2b00        .+      CMP      r3,#0
        0x00000630:    da08        ..      BGE      0x644 ; __I$use$fp + 24
        0x00000632:    2400        .$      MOVS     r4,#0
        0x00000634:    1c40        @.      ADDS     r0,r0,#1
        0x00000636:    4161        aA      ADCS     r1,r1,r4
        0x00000638:    1892        ..      ADDS     r2,r2,r2
        0x0000063a:    415b        [A      ADCS     r3,r3,r3
        0x0000063c:    431a        .C      ORRS     r2,r2,r3
        0x0000063e:    d101        ..      BNE      0x644 ; __I$use$fp + 24
        0x00000640:    0840        @.      LSRS     r0,r0,#1
        0x00000642:    0040        @.      LSLS     r0,r0,#1
        0x00000644:    bd10        ..      POP      {r4,pc}
    _double_epilogue
        0x00000646:    b5f0        ..      PUSH     {r4-r7,lr}
        0x00000648:    b41f        ..      PUSH     {r0-r4}
        0x0000064a:    b082        ..      SUB      sp,sp,#8
        0x0000064c:    4605        .F      MOV      r5,r0
        0x0000064e:    000c        ..      MOVS     r4,r1
        0x00000650:    d003        ..      BEQ      0x65a ; _double_epilogue + 20
        0x00000652:    4608        .F      MOV      r0,r1
        0x00000654:    f002fff2    ....    BL       __ARM_clz ; 0x363c
        0x00000658:    e002        ..      B        0x660 ; _double_epilogue + 26
        0x0000065a:    f002ffef    ....    BL       __ARM_clz ; 0x363c
        0x0000065e:    3020         0      ADDS     r0,r0,#0x20
        0x00000660:    4602        .F      MOV      r2,r0
        0x00000662:    9000        ..      STR      r0,[sp,#0]
        0x00000664:    4621        !F      MOV      r1,r4
        0x00000666:    4628        (F      MOV      r0,r5
        0x00000668:    f7ffffac    ....    BL       __aeabi_llsl ; 0x5c4
        0x0000066c:    9b04        ..      LDR      r3,[sp,#0x10]
        0x0000066e:    9a05        ..      LDR      r2,[sp,#0x14]
        0x00000670:    4604        .F      MOV      r4,r0
        0x00000672:    460f        .F      MOV      r7,r1
        0x00000674:    4318        .C      ORRS     r0,r0,r3
        0x00000676:    4311        .C      ORRS     r1,r1,r2
        0x00000678:    4308        .C      ORRS     r0,r0,r1
        0x0000067a:    d014        ..      BEQ      0x6a6 ; _double_epilogue + 96
        0x0000067c:    4618        .F      MOV      r0,r3
        0x0000067e:    4310        .C      ORRS     r0,r0,r2
        0x00000680:    d01b        ..      BEQ      0x6ba ; _double_epilogue + 116
        0x00000682:    9800        ..      LDR      r0,[sp,#0]
        0x00000684:    2140        @!      MOVS     r1,#0x40
        0x00000686:    1a0a        ..      SUBS     r2,r1,r0
        0x00000688:    4618        .F      MOV      r0,r3
        0x0000068a:    9905        ..      LDR      r1,[sp,#0x14]
        0x0000068c:    f7ffffaa    ....    BL       __aeabi_llsr ; 0x5e4
        0x00000690:    4605        .F      MOV      r5,r0
        0x00000692:    460e        .F      MOV      r6,r1
        0x00000694:    9a00        ..      LDR      r2,[sp,#0]
        0x00000696:    9905        ..      LDR      r1,[sp,#0x14]
        0x00000698:    9804        ..      LDR      r0,[sp,#0x10]
        0x0000069a:    f7ffff93    ....    BL       __aeabi_llsl ; 0x5c4
        0x0000069e:    4308        .C      ORRS     r0,r0,r1
        0x000006a0:    d005        ..      BEQ      0x6ae ; _double_epilogue + 104
        0x000006a2:    2001        .       MOVS     r0,#1
        0x000006a4:    e004        ..      B        0x6b0 ; _double_epilogue + 106
        0x000006a6:    4620         F      MOV      r0,r4
        0x000006a8:    4639        9F      MOV      r1,r7
        0x000006aa:    b007        ..      ADD      sp,sp,#0x1c
        0x000006ac:    bdf0        ..      POP      {r4-r7,pc}
        0x000006ae:    2000        .       MOVS     r0,#0
        0x000006b0:    17c1        ..      ASRS     r1,r0,#31
        0x000006b2:    4305        .C      ORRS     r5,r5,r0
        0x000006b4:    430e        .C      ORRS     r6,r6,r1
        0x000006b6:    432c        ,C      ORRS     r4,r4,r5
        0x000006b8:    4337        7C      ORRS     r7,r7,r6
        0x000006ba:    9900        ..      LDR      r1,[sp,#0]
        0x000006bc:    980e        ..      LDR      r0,[sp,#0x38]
        0x000006be:    0563        c.      LSLS     r3,r4,#21
        0x000006c0:    1a40        @.      SUBS     r0,r0,r1
        0x000006c2:    0579        y.      LSLS     r1,r7,#21
        0x000006c4:    0ae4        ..      LSRS     r4,r4,#11
        0x000006c6:    2200        ."      MOVS     r2,#0
        0x000006c8:    430c        .C      ORRS     r4,r4,r1
        0x000006ca:    0afd        ..      LSRS     r5,r7,#11
        0x000006cc:    300a        .0      ADDS     r0,r0,#0xa
        0x000006ce:    d502        ..      BPL      0x6d6 ; _double_epilogue + 144
        0x000006d0:    2000        .       MOVS     r0,#0
        0x000006d2:    4601        .F      MOV      r1,r0
        0x000006d4:    e7e9        ..      B        0x6aa ; _double_epilogue + 100
        0x000006d6:    0501        ..      LSLS     r1,r0,#20
        0x000006d8:    1910        ..      ADDS     r0,r2,r4
        0x000006da:    4169        iA      ADCS     r1,r1,r5
        0x000006dc:    9c0c        ..      LDR      r4,[sp,#0x30]
        0x000006de:    9d0d        ..      LDR      r5,[sp,#0x34]
        0x000006e0:    1900        ..      ADDS     r0,r0,r4
        0x000006e2:    4169        iA      ADCS     r1,r1,r5
        0x000006e4:    f7ffffa2    ....    BL       __I$use$fp ; 0x62c
        0x000006e8:    e7df        ..      B        0x6aa ; _double_epilogue + 100
        0x000006ea:    0000        ..      MOVS     r0,r0
    .text
    __scatterload
    __scatterload_rt2
        0x000006ec:    4c06        .L      LDR      r4,[pc,#24] ; [0x708] = 0x3dd0
        0x000006ee:    2501        .%      MOVS     r5,#1
        0x000006f0:    4e06        .N      LDR      r6,[pc,#24] ; [0x70c] = 0x3df0
        0x000006f2:    e005        ..      B        0x700 ; __scatterload + 20
        0x000006f4:    68e3        .h      LDR      r3,[r4,#0xc]
        0x000006f6:    cc07        ..      LDM      r4!,{r0-r2}
        0x000006f8:    432b        +C      ORRS     r3,r3,r5
        0x000006fa:    3c0c        .<      SUBS     r4,r4,#0xc
        0x000006fc:    4798        .G      BLX      r3
        0x000006fe:    3410        .4      ADDS     r4,r4,#0x10
        0x00000700:    42b4        .B      CMP      r4,r6
        0x00000702:    d3f7        ..      BCC      0x6f4 ; __scatterload + 8
        0x00000704:    f7fffd10    ....    BL       __main_after_scatterload ; 0x128
    $d
        0x00000708:    00003dd0    .=..    DCD    15824
        0x0000070c:    00003df0    .=..    DCD    15856
    $t
    PlaceInRAM
    PWM0_Handler
        0x00000710:    b510        ..      PUSH     {r4,lr}
        0x00000712:    f000f80b    ....    BL       Get_CurrentABC ; 0x72c
        0x00000716:    f001fce9    ....    BL       MC_Control ; 0x20ec
        0x0000071a:    f000fe1d    ....    BL       Fault_Overcurrent ; 0x1358
        0x0000071e:    2101        .!      MOVS     r1,#1
        0x00000720:    4801        .H      LDR      r0,[pc,#4] ; [0x728] = 0x40046000
        0x00000722:    f002f8a7    ....    BL       PWM_IntClr ; 0x2874
        0x00000726:    bd10        ..      POP      {r4,pc}
    $d
        0x00000728:    40046000    .`.@    DCD    1074028544
    $t
    PlaceInRAM
    Get_CurrentABC
        0x0000072c:    b510        ..      PUSH     {r4,lr}
        0x0000072e:    f002fac1    ....    BL       SingleR_Get_PhaseCurrent ; 0x2cb4
        0x00000732:    bd10        ..      POP      {r4,pc}
    PlaceInRAM
    mc_phasevoltcalc
        0x00000734:    b470        p.      PUSH     {r4-r6}
        0x00000736:    8a03        ..      LDRH     r3,[r0,#0x10]
        0x00000738:    2401        .$      MOVS     r4,#1
        0x0000073a:    03a4        ..      LSLS     r4,r4,#14
        0x0000073c:    1ae3        ..      SUBS     r3,r4,r3
        0x0000073e:    005b        [.      LSLS     r3,r3,#1
        0x00000740:    b21b        ..      SXTH     r3,r3
        0x00000742:    8a45        E.      LDRH     r5,[r0,#0x12]
        0x00000744:    1b65        e.      SUBS     r5,r4,r5
        0x00000746:    006d        m.      LSLS     r5,r5,#1
        0x00000748:    b22e        ..      SXTH     r6,r5
        0x0000074a:    8a80        ..      LDRH     r0,[r0,#0x14]
        0x0000074c:    1a20         .      SUBS     r0,r4,r0
        0x0000074e:    0040        @.      LSLS     r0,r0,#1
        0x00000750:    b205        ..      SXTH     r5,r0
        0x00000752:    4353        SC      MULS     r3,r2,r3
        0x00000754:    17d8        ..      ASRS     r0,r3,#31
        0x00000756:    0c40        @.      LSRS     r0,r0,#17
        0x00000758:    18c0        ..      ADDS     r0,r0,r3
        0x0000075a:    13c0        ..      ASRS     r0,r0,#15
        0x0000075c:    b200        ..      SXTH     r0,r0
        0x0000075e:    4356        VC      MULS     r6,r2,r6
        0x00000760:    17f3        ..      ASRS     r3,r6,#31
        0x00000762:    0c5b        [.      LSRS     r3,r3,#17
        0x00000764:    199b        ..      ADDS     r3,r3,r6
        0x00000766:    13db        ..      ASRS     r3,r3,#15
        0x00000768:    b21b        ..      SXTH     r3,r3
        0x0000076a:    4355        UC      MULS     r5,r2,r5
        0x0000076c:    17ea        ..      ASRS     r2,r5,#31
        0x0000076e:    0c52        R.      LSRS     r2,r2,#17
        0x00000770:    1952        R.      ADDS     r2,r2,r5
        0x00000772:    13d2        ..      ASRS     r2,r2,#15
        0x00000774:    b212        ..      SXTH     r2,r2
        0x00000776:    4cfe        .L      LDR      r4,[pc,#1016] ; [0xb70] = 0x5555
        0x00000778:    4344        DC      MULS     r4,r0,r4
        0x0000077a:    17e5        ..      ASRS     r5,r4,#31
        0x0000077c:    0c6d        m.      LSRS     r5,r5,#17
        0x0000077e:    192c        ,.      ADDS     r4,r5,r4
        0x00000780:    13e5        ..      ASRS     r5,r4,#15
        0x00000782:    4cfc        .L      LDR      r4,[pc,#1008] ; [0xb74] = 0x2aab
        0x00000784:    435c        \C      MULS     r4,r3,r4
        0x00000786:    17e6        ..      ASRS     r6,r4,#31
        0x00000788:    0c76        v.      LSRS     r6,r6,#17
        0x0000078a:    1934        4.      ADDS     r4,r6,r4
        0x0000078c:    13e4        ..      ASRS     r4,r4,#15
        0x0000078e:    1b2c        ,.      SUBS     r4,r5,r4
        0x00000790:    4df8        .M      LDR      r5,[pc,#992] ; [0xb74] = 0x2aab
        0x00000792:    436a        jC      MULS     r2,r5,r2
        0x00000794:    17d5        ..      ASRS     r5,r2,#31
        0x00000796:    0c6d        m.      LSRS     r5,r5,#17
        0x00000798:    18aa        ..      ADDS     r2,r5,r2
        0x0000079a:    13d5        ..      ASRS     r5,r2,#15
        0x0000079c:    1b62        b.      SUBS     r2,r4,r5
        0x0000079e:    b212        ..      SXTH     r2,r2
        0x000007a0:    4cf3        .L      LDR      r4,[pc,#972] ; [0xb70] = 0x5555
        0x000007a2:    4363        cC      MULS     r3,r4,r3
        0x000007a4:    17dc        ..      ASRS     r4,r3,#31
        0x000007a6:    0c64        d.      LSRS     r4,r4,#17
        0x000007a8:    18e3        ..      ADDS     r3,r4,r3
        0x000007aa:    13db        ..      ASRS     r3,r3,#15
        0x000007ac:    4cf1        .L      LDR      r4,[pc,#964] ; [0xb74] = 0x2aab
        0x000007ae:    4360        `C      MULS     r0,r4,r0
        0x000007b0:    17c4        ..      ASRS     r4,r0,#31
        0x000007b2:    0c64        d.      LSRS     r4,r4,#17
        0x000007b4:    1820         .      ADDS     r0,r4,r0
        0x000007b6:    13c0        ..      ASRS     r0,r0,#15
        0x000007b8:    1a18        ..      SUBS     r0,r3,r0
        0x000007ba:    1b40        @.      SUBS     r0,r0,r5
        0x000007bc:    b200        ..      SXTH     r0,r0
        0x000007be:    820a        ..      STRH     r2,[r1,#0x10]
        0x000007c0:    4bed        .K      LDR      r3,[pc,#948] ; [0xb78] = 0x24f3
        0x000007c2:    435a        ZC      MULS     r2,r3,r2
        0x000007c4:    005b        [.      LSLS     r3,r3,#1
        0x000007c6:    4358        XC      MULS     r0,r3,r0
        0x000007c8:    1810        ..      ADDS     r0,r2,r0
        0x000007ca:    17c2        ..      ASRS     r2,r0,#31
        0x000007cc:    0c92        ..      LSRS     r2,r2,#18
        0x000007ce:    1810        ..      ADDS     r0,r2,r0
        0x000007d0:    1380        ..      ASRS     r0,r0,#14
        0x000007d2:    8248        H.      STRH     r0,[r1,#0x12]
        0x000007d4:    bc70        p.      POP      {r4-r6}
        0x000007d6:    4770        pG      BX       lr
    mc_svpwmtrfm
        0x000007d8:    b5f0        ..      PUSH     {r4-r7,lr}
        0x000007da:    b085        ..      SUB      sp,sp,#0x14
        0x000007dc:    4603        .F      MOV      r3,r0
        0x000007de:    460c        .F      MOV      r4,r1
        0x000007e0:    2000        .       MOVS     r0,#0
        0x000007e2:    2500        .%      MOVS     r5,#0
        0x000007e4:    2200        ."      MOVS     r2,#0
        0x000007e6:    2102        .!      MOVS     r1,#2
        0x000007e8:    5e59        Y^      LDRSH    r1,[r3,r1]
        0x000007ea:    5e1e        .^      LDRSH    r6,[r3,r0]
        0x000007ec:    4be3        .K      LDR      r3,[pc,#908] ; [0xb7c] = 0x6ed9
        0x000007ee:    038f        ..      LSLS     r7,r1,#14
        0x000007f0:    435e        ^C      MULS     r6,r3,r6
        0x000007f2:    46bc        .F      MOV      r12,r7
        0x000007f4:    1bf3        ..      SUBS     r3,r6,r7
        0x000007f6:    17df        ..      ASRS     r7,r3,#31
        0x000007f8:    0c7f        ..      LSRS     r7,r7,#17
        0x000007fa:    18fb        ..      ADDS     r3,r7,r3
        0x000007fc:    13db        ..      ASRS     r3,r3,#15
        0x000007fe:    b21b        ..      SXTH     r3,r3
        0x00000800:    4466        fD      ADD      r6,r6,r12
        0x00000802:    4276        vB      RSBS     r6,r6,#0
        0x00000804:    17f7        ..      ASRS     r7,r6,#31
        0x00000806:    0c7f        ..      LSRS     r7,r7,#17
        0x00000808:    19be        ..      ADDS     r6,r7,r6
        0x0000080a:    13f6        ..      ASRS     r6,r6,#15
        0x0000080c:    b236        6.      SXTH     r6,r6
        0x0000080e:    2900        .)      CMP      r1,#0
        0x00000810:    dd00        ..      BLE      0x814 ; mc_svpwmtrfm + 60
        0x00000812:    2001        .       MOVS     r0,#1
        0x00000814:    2b00        .+      CMP      r3,#0
        0x00000816:    dd01        ..      BLE      0x81c ; mc_svpwmtrfm + 68
        0x00000818:    1c80        ..      ADDS     r0,r0,#2
        0x0000081a:    b280        ..      UXTH     r0,r0
        0x0000081c:    2e00        ..      CMP      r6,#0
        0x0000081e:    dd01        ..      BLE      0x824 ; mc_svpwmtrfm + 76
        0x00000820:    1d00        ..      ADDS     r0,r0,#4
        0x00000822:    b280        ..      UXTH     r0,r0
        0x00000824:    b200        ..      SXTH     r0,r0
        0x00000826:    84a0        ..      STRH     r0,[r4,#0x24]
        0x00000828:    9004        ..      STR      r0,[sp,#0x10]
        0x0000082a:    4276        vB      RSBS     r6,r6,#0
        0x0000082c:    425b        [B      RSBS     r3,r3,#0
        0x0000082e:    2807        .(      CMP      r0,#7
        0x00000830:    d219        ..      BCS      0x866 ; mc_svpwmtrfm + 142
        0x00000832:    0007        ..      MOVS     r7,r0
        0x00000834:    447f        .D      ADD      r7,r7,pc
        0x00000836:    793f        ?y      LDRB     r7,[r7,#4]
        0x00000838:    19ff        ..      ADDS     r7,r7,r7
        0x0000083a:    44bf        .D      ADD      pc,pc,r7
    $d
        0x0000083c:    09060314    ....    DCD    151388948
        0x00000840:    00120f0c    ....    DCD    1183500
    $t
        0x00000844:    461d        .F      MOV      r5,r3
        0x00000846:    4632        2F      MOV      r2,r6
        0x00000848:    e00d        ..      B        0x866 ; mc_svpwmtrfm + 142
        0x0000084a:    4635        5F      MOV      r5,r6
        0x0000084c:    424a        JB      RSBS     r2,r1,#0
        0x0000084e:    e00a        ..      B        0x866 ; mc_svpwmtrfm + 142
        0x00000850:    425d        ]B      RSBS     r5,r3,#0
        0x00000852:    460a        .F      MOV      r2,r1
        0x00000854:    e007        ..      B        0x866 ; mc_svpwmtrfm + 142
        0x00000856:    424d        MB      RSBS     r5,r1,#0
        0x00000858:    461a        .F      MOV      r2,r3
        0x0000085a:    e004        ..      B        0x866 ; mc_svpwmtrfm + 142
        0x0000085c:    460d        .F      MOV      r5,r1
        0x0000085e:    4272        rB      RSBS     r2,r6,#0
        0x00000860:    e001        ..      B        0x866 ; mc_svpwmtrfm + 142
        0x00000862:    4275        uB      RSBS     r5,r6,#0
        0x00000864:    425a        ZB      RSBS     r2,r3,#0
        0x00000866:    4617        .F      MOV      r7,r2
        0x00000868:    48c5        .H      LDR      r0,[pc,#788] ; [0xb80] = 0x7fff
        0x0000086a:    19ee        ..      ADDS     r6,r5,r7
        0x0000086c:    4286        .B      CMP      r6,r0
        0x0000086e:    dd0b        ..      BLE      0x888 ; mc_svpwmtrfm + 176
        0x00000870:    03e8        ..      LSLS     r0,r5,#15
        0x00000872:    1b40        @.      SUBS     r0,r0,r5
        0x00000874:    4631        1F      MOV      r1,r6
        0x00000876:    f7fffc73    ..s.    BL       __aeabi_idiv ; 0x160
        0x0000087a:    4605        .F      MOV      r5,r0
        0x0000087c:    03f8        ..      LSLS     r0,r7,#15
        0x0000087e:    1bc0        ..      SUBS     r0,r0,r7
        0x00000880:    4631        1F      MOV      r1,r6
        0x00000882:    f7fffc6d    ..m.    BL       __aeabi_idiv ; 0x160
        0x00000886:    4602        .F      MOV      r2,r0
        0x00000888:    2330        0#      MOVS     r3,#0x30
        0x0000088a:    5ee3        .^      LDRSH    r3,[r4,r3]
        0x0000088c:    429d        .B      CMP      r5,r3
        0x0000088e:    da04        ..      BGE      0x89a ; mc_svpwmtrfm + 194
        0x00000890:    429a        .B      CMP      r2,r3
        0x00000892:    db02        ..      BLT      0x89a ; mc_svpwmtrfm + 194
        0x00000894:    4618        .F      MOV      r0,r3
        0x00000896:    4613        .F      MOV      r3,r2
        0x00000898:    e00d        ..      B        0x8b6 ; mc_svpwmtrfm + 222
        0x0000089a:    429a        .B      CMP      r2,r3
        0x0000089c:    da03        ..      BGE      0x8a6 ; mc_svpwmtrfm + 206
        0x0000089e:    429d        .B      CMP      r5,r3
        0x000008a0:    db01        ..      BLT      0x8a6 ; mc_svpwmtrfm + 206
        0x000008a2:    4628        (F      MOV      r0,r5
        0x000008a4:    e007        ..      B        0x8b6 ; mc_svpwmtrfm + 222
        0x000008a6:    429a        .B      CMP      r2,r3
        0x000008a8:    da03        ..      BGE      0x8b2 ; mc_svpwmtrfm + 218
        0x000008aa:    429d        .B      CMP      r5,r3
        0x000008ac:    da01        ..      BGE      0x8b2 ; mc_svpwmtrfm + 218
        0x000008ae:    4618        .F      MOV      r0,r3
        0x000008b0:    e001        ..      B        0x8b6 ; mc_svpwmtrfm + 222
        0x000008b2:    4628        (F      MOV      r0,r5
        0x000008b4:    4613        .F      MOV      r3,r2
        0x000008b6:    0069        i.      LSLS     r1,r5,#1
        0x000008b8:    1a09        ..      SUBS     r1,r1,r0
        0x000008ba:    0052        R.      LSLS     r2,r2,#1
        0x000008bc:    1ad6        ..      SUBS     r6,r2,r3
        0x000008be:    2222        ""      MOVS     r2,#0x22
        0x000008c0:    5d12        .]      LDRB     r2,[r2,r4]
        0x000008c2:    2a01        .*      CMP      r2,#1
        0x000008c4:    d021        !.      BEQ      0x90a ; mc_svpwmtrfm + 306
        0x000008c6:    4dae        .M      LDR      r5,[pc,#696] ; [0xb80] = 0x7fff
        0x000008c8:    1a2a        *.      SUBS     r2,r5,r0
        0x000008ca:    1ad2        ..      SUBS     r2,r2,r3
        0x000008cc:    1052        R.      ASRS     r2,r2,#1
        0x000008ce:    1810        ..      ADDS     r0,r2,r0
        0x000008d0:    18c3        ..      ADDS     r3,r0,r3
        0x000008d2:    1a6d        m.      SUBS     r5,r5,r1
        0x000008d4:    1bad        ..      SUBS     r5,r5,r6
        0x000008d6:    106d        m.      ASRS     r5,r5,#1
        0x000008d8:    1869        i.      ADDS     r1,r5,r1
        0x000008da:    198e        ..      ADDS     r6,r1,r6
        0x000008dc:    46b4        .F      MOV      r12,r6
        0x000008de:    1816        ..      ADDS     r6,r2,r0
        0x000008e0:    1076        v.      ASRS     r6,r6,#1
        0x000008e2:    b236        6.      SXTH     r6,r6
        0x000008e4:    8026        &.      STRH     r6,[r4,#0]
        0x000008e6:    46b6        .F      MOV      lr,r6
        0x000008e8:    18c6        ..      ADDS     r6,r0,r3
        0x000008ea:    1076        v.      ASRS     r6,r6,#1
        0x000008ec:    b236        6.      SXTH     r6,r6
        0x000008ee:    8066        f.      STRH     r6,[r4,#2]
        0x000008f0:    9603        ..      STR      r6,[sp,#0xc]
        0x000008f2:    9e04        ..      LDR      r6,[sp,#0x10]
        0x000008f4:    2e07        ..      CMP      r6,#7
        0x000008f6:    d23e        >.      BCS      0x976 ; mc_svpwmtrfm + 414
        0x000008f8:    0037        7.      MOVS     r7,r6
        0x000008fa:    447f        .D      ADD      r7,r7,pc
        0x000008fc:    793f        ?y      LDRB     r7,[r7,#4]
        0x000008fe:    19ff        ..      ADDS     r7,r7,r7
        0x00000900:    44bf        .D      ADD      pc,pc,r7
    $d
        0x00000902:    0939        9.      DCW    2361
        0x00000904:    29211911    ..!)    DCD    690034961
        0x00000908:    0031        1.      DCW    49
    $t
        0x0000090a:    2201        ."      MOVS     r2,#1
        0x0000090c:    18c3        ..      ADDS     r3,r0,r3
        0x0000090e:    2501        .%      MOVS     r5,#1
        0x00000910:    198e        ..      ADDS     r6,r1,r6
        0x00000912:    46b4        .F      MOV      r12,r6
        0x00000914:    e7e3        ..      B        0x8de ; mc_svpwmtrfm + 262
        0x00000916:    8122        ".      STRH     r2,[r4,#8]
        0x00000918:    8165        e.      STRH     r5,[r4,#0xa]
        0x0000091a:    80a0        ..      STRH     r0,[r4,#4]
        0x0000091c:    80e1        ..      STRH     r1,[r4,#6]
        0x0000091e:    81a3        ..      STRH     r3,[r4,#0xc]
