747lulu747/SAOZHAN_BRUASH/src/SDK-LIB/华芯第一版本硬件-非FPC/ROMAN-21DD - SDK - V0.1/out/SWM211.asm
        0x00000920:    4660        `F      MOV      r0,r12
        0x00000922:    81e0        ..      STRH     r0,[r4,#0xe]
        0x00000924:    e02e        ..      B        0x984 ; mc_svpwmtrfm + 428
        0x00000926:    80a2        ..      STRH     r2,[r4,#4]
        0x00000928:    80e5        ..      STRH     r5,[r4,#6]
        0x0000092a:    81a0        ..      STRH     r0,[r4,#0xc]
        0x0000092c:    81e1        ..      STRH     r1,[r4,#0xe]
        0x0000092e:    8123        #.      STRH     r3,[r4,#8]
        0x00000930:    4660        `F      MOV      r0,r12
        0x00000932:    8160        `.      STRH     r0,[r4,#0xa]
        0x00000934:    e026        &.      B        0x984 ; mc_svpwmtrfm + 428
        0x00000936:    80a2        ..      STRH     r2,[r4,#4]
        0x00000938:    80e5        ..      STRH     r5,[r4,#6]
        0x0000093a:    8120         .      STRH     r0,[r4,#8]
        0x0000093c:    8161        a.      STRH     r1,[r4,#0xa]
        0x0000093e:    81a3        ..      STRH     r3,[r4,#0xc]
        0x00000940:    4660        `F      MOV      r0,r12
        0x00000942:    81e0        ..      STRH     r0,[r4,#0xe]
        0x00000944:    e01e        ..      B        0x984 ; mc_svpwmtrfm + 428
        0x00000946:    81a2        ..      STRH     r2,[r4,#0xc]
        0x00000948:    81e5        ..      STRH     r5,[r4,#0xe]
        0x0000094a:    8120         .      STRH     r0,[r4,#8]
        0x0000094c:    8161        a.      STRH     r1,[r4,#0xa]
        0x0000094e:    80a3        ..      STRH     r3,[r4,#4]
        0x00000950:    4660        `F      MOV      r0,r12
        0x00000952:    80e0        ..      STRH     r0,[r4,#6]
        0x00000954:    e016        ..      B        0x984 ; mc_svpwmtrfm + 428
        0x00000956:    8122        ".      STRH     r2,[r4,#8]
        0x00000958:    8165        e.      STRH     r5,[r4,#0xa]
        0x0000095a:    81a0        ..      STRH     r0,[r4,#0xc]
        0x0000095c:    81e1        ..      STRH     r1,[r4,#0xe]
        0x0000095e:    80a3        ..      STRH     r3,[r4,#4]
        0x00000960:    4660        `F      MOV      r0,r12
        0x00000962:    80e0        ..      STRH     r0,[r4,#6]
        0x00000964:    e00e        ..      B        0x984 ; mc_svpwmtrfm + 428
        0x00000966:    81a2        ..      STRH     r2,[r4,#0xc]
        0x00000968:    81e5        ..      STRH     r5,[r4,#0xe]
        0x0000096a:    80a0        ..      STRH     r0,[r4,#4]
        0x0000096c:    80e1        ..      STRH     r1,[r4,#6]
        0x0000096e:    8123        #.      STRH     r3,[r4,#8]
        0x00000970:    4660        `F      MOV      r0,r12
        0x00000972:    8160        `.      STRH     r0,[r4,#0xa]
        0x00000974:    e006        ..      B        0x984 ; mc_svpwmtrfm + 428
        0x00000976:    4883        .H      LDR      r0,[pc,#524] ; [0xb84] = 0x3fff
        0x00000978:    80a0        ..      STRH     r0,[r4,#4]
        0x0000097a:    80e0        ..      STRH     r0,[r4,#6]
        0x0000097c:    8120         .      STRH     r0,[r4,#8]
        0x0000097e:    8160        `.      STRH     r0,[r4,#0xa]
        0x00000980:    81a0        ..      STRH     r0,[r4,#0xc]
        0x00000982:    81e0        ..      STRH     r0,[r4,#0xe]
        0x00000984:    2704        .'      MOVS     r7,#4
        0x00000986:    2106        .!      MOVS     r1,#6
        0x00000988:    5fe7        ._      LDRSH    r7,[r4,r7]
        0x0000098a:    5e61        a^      LDRSH    r1,[r4,r1]
        0x0000098c:    1878        x.      ADDS     r0,r7,r1
        0x0000098e:    1040        @.      ASRS     r0,r0,#1
        0x00000990:    8220         .      STRH     r0,[r4,#0x10]
        0x00000992:    2208        ."      MOVS     r2,#8
        0x00000994:    230a        .#      MOVS     r3,#0xa
        0x00000996:    5ea2        .^      LDRSH    r2,[r4,r2]
        0x00000998:    5ee3        .^      LDRSH    r3,[r4,r3]
        0x0000099a:    18d0        ..      ADDS     r0,r2,r3
        0x0000099c:    1040        @.      ASRS     r0,r0,#1
        0x0000099e:    8260        `.      STRH     r0,[r4,#0x12]
        0x000009a0:    250c        .%      MOVS     r5,#0xc
        0x000009a2:    260e        .&      MOVS     r6,#0xe
        0x000009a4:    5f65        e_      LDRSH    r5,[r4,r5]
        0x000009a6:    5fa6        ._      LDRSH    r6,[r4,r6]
        0x000009a8:    19a8        ..      ADDS     r0,r5,r6
        0x000009aa:    1040        @.      ASRS     r0,r0,#1
        0x000009ac:    82a0        ..      STRH     r0,[r4,#0x14]
        0x000009ae:    202c        ,       MOVS     r0,#0x2c
        0x000009b0:    5e20         ^      LDRSH    r0,[r4,r0]
        0x000009b2:    4347        GC      MULS     r7,r0,r7
        0x000009b4:    13ff        ..      ASRS     r7,r7,#15
        0x000009b6:    b23f        ?.      SXTH     r7,r7
        0x000009b8:    82e7        ..      STRH     r7,[r4,#0x16]
        0x000009ba:    4341        AC      MULS     r1,r0,r1
        0x000009bc:    13c9        ..      ASRS     r1,r1,#15
        0x000009be:    8321        !.      STRH     r1,[r4,#0x18]
        0x000009c0:    4342        BC      MULS     r2,r0,r2
        0x000009c2:    13d1        ..      ASRS     r1,r2,#15
        0x000009c4:    b209        ..      SXTH     r1,r1
        0x000009c6:    8361        a.      STRH     r1,[r4,#0x1a]
        0x000009c8:    4343        CC      MULS     r3,r0,r3
        0x000009ca:    13da        ..      ASRS     r2,r3,#15
        0x000009cc:    83a2        ..      STRH     r2,[r4,#0x1c]
        0x000009ce:    4345        EC      MULS     r5,r0,r5
        0x000009d0:    13ea        ..      ASRS     r2,r5,#15
        0x000009d2:    83e2        ..      STRH     r2,[r4,#0x1e]
        0x000009d4:    4346        FC      MULS     r6,r0,r6
        0x000009d6:    13f2        ..      ASRS     r2,r6,#15
        0x000009d8:    8422        ".      STRH     r2,[r4,#0x20]
        0x000009da:    4672        rF      MOV      r2,lr
        0x000009dc:    4342        BC      MULS     r2,r0,r2
        0x000009de:    0052        R.      LSLS     r2,r2,#1
        0x000009e0:    0c13        ..      LSRS     r3,r2,#16
        0x000009e2:    8de2        ..      LDRH     r2,[r4,#0x2e]
        0x000009e4:    8e65        e.      LDRH     r5,[r4,#0x32]
        0x000009e6:    1955        U.      ADDS     r5,r2,r5
        0x000009e8:    195b        [.      ADDS     r3,r3,r5
        0x000009ea:    84e3        ..      STRH     r3,[r4,#0x26]
        0x000009ec:    9b03        ..      LDR      r3,[sp,#0xc]
        0x000009ee:    4343        CC      MULS     r3,r0,r3
        0x000009f0:    0058        X.      LSLS     r0,r3,#1
        0x000009f2:    8ea3        ..      LDRH     r3,[r4,#0x34]
        0x000009f4:    0c00        ..      LSRS     r0,r0,#16
        0x000009f6:    18d2        ..      ADDS     r2,r2,r3
        0x000009f8:    1880        ..      ADDS     r0,r0,r2
        0x000009fa:    8520         .      STRH     r0,[r4,#0x28]
        0x000009fc:    4862        bH      LDR      r0,[pc,#392] ; [0xb88] = 0x20000004
        0x000009fe:    4d63        cM      LDR      r5,[pc,#396] ; [0xb8c] = 0x40046080
        0x00000a00:    7800        .x      LDRB     r0,[r0,#0]
        0x00000a02:    2800        .(      CMP      r0,#0
        0x00000a04:    d024        $.      BEQ      0xa50 ; mc_svpwmtrfm + 632
        0x00000a06:    6269        ib      STR      r1,[r5,#0x24]
        0x00000a08:    201c        .       MOVS     r0,#0x1c
        0x00000a0a:    5e20         ^      LDRSH    r0,[r4,r0]
        0x00000a0c:    6368        hc      STR      r0,[r5,#0x34]
        0x00000a0e:    2016        .       MOVS     r0,#0x16
        0x00000a10:    5e20         ^      LDRSH    r0,[r4,r0]
        0x00000a12:    62a8        .b      STR      r0,[r5,#0x28]
        0x00000a14:    2018        .       MOVS     r0,#0x18
        0x00000a16:    5e20         ^      LDRSH    r0,[r4,r0]
        0x00000a18:    63a8        .c      STR      r0,[r5,#0x38]
        0x00000a1a:    211e        .!      MOVS     r1,#0x1e
        0x00000a1c:    485c        \H      LDR      r0,[pc,#368] ; [0xb90] = 0x40046000
        0x00000a1e:    5e61        a^      LDRSH    r1,[r4,r1]
        0x00000a20:    6241        Ab      STR      r1,[r0,#0x24]
        0x00000a22:    2120         !      MOVS     r1,#0x20
        0x00000a24:    5e61        a^      LDRSH    r1,[r4,r1]
        0x00000a26:    6341        Ac      STR      r1,[r0,#0x34]
        0x00000a28:    495a        ZI      LDR      r1,[pc,#360] ; [0xb94] = 0x200000f4
        0x00000a2a:    2600        .&      MOVS     r6,#0
        0x00000a2c:    818e        ..      STRH     r6,[r1,#0xc]
        0x00000a2e:    9600        ..      STR      r6,[sp,#0]
        0x00000a30:    9601        ..      STR      r6,[sp,#4]
        0x00000a32:    2300        .#      MOVS     r3,#0
        0x00000a34:    8ce1        ..      LDRH     r1,[r4,#0x26]
        0x00000a36:    461a        .F      MOV      r2,r3
        0x00000a38:    f001fe54    ..T.    BL       PWM_CmpTrigger ; 0x26e4
        0x00000a3c:    9600        ..      STR      r6,[sp,#0]
        0x00000a3e:    9601        ..      STR      r6,[sp,#4]
        0x00000a40:    2300        .#      MOVS     r3,#0
        0x00000a42:    8d21        !.      LDRH     r1,[r4,#0x28]
        0x00000a44:    461a        .F      MOV      r2,r3
        0x00000a46:    4628        (F      MOV      r0,r5
        0x00000a48:    f001fe4c    ..L.    BL       PWM_CmpTrigger ; 0x26e4
        0x00000a4c:    b005        ..      ADD      sp,sp,#0x14
        0x00000a4e:    bdf0        ..      POP      {r4-r7,pc}
        0x00000a50:    626f        ob      STR      r7,[r5,#0x24]
        0x00000a52:    2018        .       MOVS     r0,#0x18
        0x00000a54:    5e20         ^      LDRSH    r0,[r4,r0]
        0x00000a56:    6368        hc      STR      r0,[r5,#0x34]
        0x00000a58:    201a        .       MOVS     r0,#0x1a
        0x00000a5a:    5e20         ^      LDRSH    r0,[r4,r0]
        0x00000a5c:    62a8        .b      STR      r0,[r5,#0x28]
        0x00000a5e:    201c        .       MOVS     r0,#0x1c
        0x00000a60:    5e20         ^      LDRSH    r0,[r4,r0]
        0x00000a62:    63a8        .c      STR      r0,[r5,#0x38]
        0x00000a64:    e7d9        ..      B        0xa1a ; mc_svpwmtrfm + 578
    InvPark_Cale
        0x00000a66:    211c        .!      MOVS     r1,#0x1c
        0x00000a68:    5e41        A^      LDRSH    r1,[r0,r1]
        0x00000a6a:    2222        ""      MOVS     r2,#0x22
        0x00000a6c:    5e82        .^      LDRSH    r2,[r0,r2]
        0x00000a6e:    4351        QC      MULS     r1,r2,r1
        0x00000a70:    221e        ."      MOVS     r2,#0x1e
        0x00000a72:    5e82        .^      LDRSH    r2,[r0,r2]
        0x00000a74:    2320         #      MOVS     r3,#0x20
        0x00000a76:    5ec3        .^      LDRSH    r3,[r0,r3]
        0x00000a78:    435a        ZC      MULS     r2,r3,r2
        0x00000a7a:    1a89        ..      SUBS     r1,r1,r2
        0x00000a7c:    17ca        ..      ASRS     r2,r1,#31
        0x00000a7e:    0c52        R.      LSRS     r2,r2,#17
        0x00000a80:    1851        Q.      ADDS     r1,r2,r1
        0x00000a82:    13c9        ..      ASRS     r1,r1,#15
        0x00000a84:    8181        ..      STRH     r1,[r0,#0xc]
        0x00000a86:    211e        .!      MOVS     r1,#0x1e
        0x00000a88:    5e41        A^      LDRSH    r1,[r0,r1]
        0x00000a8a:    2222        ""      MOVS     r2,#0x22
        0x00000a8c:    5e82        .^      LDRSH    r2,[r0,r2]
        0x00000a8e:    4351        QC      MULS     r1,r2,r1
        0x00000a90:    221c        ."      MOVS     r2,#0x1c
        0x00000a92:    5e82        .^      LDRSH    r2,[r0,r2]
        0x00000a94:    2320         #      MOVS     r3,#0x20
        0x00000a96:    5ec3        .^      LDRSH    r3,[r0,r3]
        0x00000a98:    435a        ZC      MULS     r2,r3,r2
        0x00000a9a:    1889        ..      ADDS     r1,r1,r2
        0x00000a9c:    17ca        ..      ASRS     r2,r1,#31
        0x00000a9e:    0c52        R.      LSRS     r2,r2,#17
        0x00000aa0:    1851        Q.      ADDS     r1,r2,r1
        0x00000aa2:    13c9        ..      ASRS     r1,r1,#15
        0x00000aa4:    81c1        ..      STRH     r1,[r0,#0xe]
        0x00000aa6:    4770        pG      BX       lr
    CurrentLoop
        0x00000aa8:    b510        ..      PUSH     {r4,lr}
        0x00000aaa:    4c3b        ;L      LDR      r4,[pc,#236] ; [0xb98] = 0x2000023a
        0x00000aac:    8b20         .      LDRH     r0,[r4,#0x18]
        0x00000aae:    8aa1        ..      LDRH     r1,[r4,#0x14]
        0x00000ab0:    1a40        @.      SUBS     r0,r0,r1
        0x00000ab2:    b200        ..      SXTH     r0,r0
        0x00000ab4:    4939        9I      LDR      r1,[pc,#228] ; [0xb9c] = 0x200002dc
        0x00000ab6:    f002fe1d    ....    BL       mcPI_CurrentLoop ; 0x36f4
        0x00000aba:    4838        8H      LDR      r0,[pc,#224] ; [0xb9c] = 0x200002dc
        0x00000abc:    8c80        ..      LDRH     r0,[r0,#0x24]
        0x00000abe:    83a0        ..      STRH     r0,[r4,#0x1c]
        0x00000ac0:    8b60        `.      LDRH     r0,[r4,#0x1a]
        0x00000ac2:    8ae1        ..      LDRH     r1,[r4,#0x16]
        0x00000ac4:    1a40        @.      SUBS     r0,r0,r1
        0x00000ac6:    b200        ..      SXTH     r0,r0
        0x00000ac8:    4935        5I      LDR      r1,[pc,#212] ; [0xba0] = 0x20000304
        0x00000aca:    f002fe13    ....    BL       mcPI_CurrentLoop ; 0x36f4
        0x00000ace:    4834        4H      LDR      r0,[pc,#208] ; [0xba0] = 0x20000304
        0x00000ad0:    8c80        ..      LDRH     r0,[r0,#0x24]
        0x00000ad2:    83e0        ..      STRH     r0,[r4,#0x1e]
        0x00000ad4:    bd10        ..      POP      {r4,pc}
    Park_Cale
        0x00000ad6:    2108        .!      MOVS     r1,#8
        0x00000ad8:    5e41        A^      LDRSH    r1,[r0,r1]
        0x00000ada:    2222        ""      MOVS     r2,#0x22
        0x00000adc:    5e82        .^      LDRSH    r2,[r0,r2]
        0x00000ade:    4351        QC      MULS     r1,r2,r1
        0x00000ae0:    220a        ."      MOVS     r2,#0xa
        0x00000ae2:    5e82        .^      LDRSH    r2,[r0,r2]
        0x00000ae4:    2320         #      MOVS     r3,#0x20
        0x00000ae6:    5ec3        .^      LDRSH    r3,[r0,r3]
        0x00000ae8:    435a        ZC      MULS     r2,r3,r2
        0x00000aea:    1889        ..      ADDS     r1,r1,r2
        0x00000aec:    17ca        ..      ASRS     r2,r1,#31
        0x00000aee:    0c52        R.      LSRS     r2,r2,#17
        0x00000af0:    1851        Q.      ADDS     r1,r2,r1
        0x00000af2:    13c9        ..      ASRS     r1,r1,#15
        0x00000af4:    8281        ..      STRH     r1,[r0,#0x14]
        0x00000af6:    210a        .!      MOVS     r1,#0xa
        0x00000af8:    5e41        A^      LDRSH    r1,[r0,r1]
        0x00000afa:    2222        ""      MOVS     r2,#0x22
        0x00000afc:    5e82        .^      LDRSH    r2,[r0,r2]
        0x00000afe:    4351        QC      MULS     r1,r2,r1
        0x00000b00:    2208        ."      MOVS     r2,#8
        0x00000b02:    5e82        .^      LDRSH    r2,[r0,r2]
        0x00000b04:    2320         #      MOVS     r3,#0x20
        0x00000b06:    5ec3        .^      LDRSH    r3,[r0,r3]
        0x00000b08:    435a        ZC      MULS     r2,r3,r2
        0x00000b0a:    1a89        ..      SUBS     r1,r1,r2
        0x00000b0c:    17ca        ..      ASRS     r2,r1,#31
        0x00000b0e:    0c52        R.      LSRS     r2,r2,#17
        0x00000b10:    1851        Q.      ADDS     r1,r2,r1
        0x00000b12:    13c9        ..      ASRS     r1,r1,#15
        0x00000b14:    82c1        ..      STRH     r1,[r0,#0x16]
        0x00000b16:    4770        pG      BX       lr
    Clake_Cale
        0x00000b18:    8841        A.      LDRH     r1,[r0,#2]
        0x00000b1a:    8101        ..      STRH     r1,[r0,#8]
        0x00000b1c:    2102        .!      MOVS     r1,#2
        0x00000b1e:    5e41        A^      LDRSH    r1,[r0,r1]
        0x00000b20:    2204        ."      MOVS     r2,#4
        0x00000b22:    5e82        .^      LDRSH    r2,[r0,r2]
        0x00000b24:    1889        ..      ADDS     r1,r1,r2
        0x00000b26:    2204        ."      MOVS     r2,#4
        0x00000b28:    5e82        .^      LDRSH    r2,[r0,r2]
        0x00000b2a:    1889        ..      ADDS     r1,r1,r2
        0x00000b2c:    4a1d        .J      LDR      r2,[pc,#116] ; [0xba4] = 0x49e7
        0x00000b2e:    4351        QC      MULS     r1,r2,r1
        0x00000b30:    17ca        ..      ASRS     r2,r1,#31
        0x00000b32:    0c52        R.      LSRS     r2,r2,#17
        0x00000b34:    1851        Q.      ADDS     r1,r2,r1
        0x00000b36:    13c9        ..      ASRS     r1,r1,#15
        0x00000b38:    8141        A.      STRH     r1,[r0,#0xa]
        0x00000b3a:    4770        pG      BX       lr
    FOC_Algorithm
        0x00000b3c:    b510        ..      PUSH     {r4,lr}
        0x00000b3e:    4c16        .L      LDR      r4,[pc,#88] ; [0xb98] = 0x2000023a
        0x00000b40:    2000        .       MOVS     r0,#0
        0x00000b42:    8320         .      STRH     r0,[r4,#0x18]
        0x00000b44:    4620         F      MOV      r0,r4
        0x00000b46:    f7ffffe7    ....    BL       Clake_Cale ; 0xb18
        0x00000b4a:    4917        .I      LDR      r1,[pc,#92] ; [0xba8] = 0x20000020
        0x00000b4c:    8808        ..      LDRH     r0,[r1,#0]
        0x00000b4e:    888a        ..      LDRH     r2,[r1,#4]
        0x00000b50:    1880        ..      ADDS     r0,r0,r2
        0x00000b52:    b280        ..      UXTH     r0,r0
        0x00000b54:    8008        ..      STRH     r0,[r1,#0]
        0x00000b56:    6889        .h      LDR      r1,[r1,#8]
        0x00000b58:    2900        .)      CMP      r1,#0
        0x00000b5a:    d03f        ?.      BEQ      0xbdc ; FOC_Algorithm + 160
        0x00000b5c:    4813        .H      LDR      r0,[pc,#76] ; [0xbac] = 0x200002a8
        0x00000b5e:    8980        ..      LDRH     r0,[r0,#0xc]
        0x00000b60:    84a0        ..      STRH     r0,[r4,#0x24]
        0x00000b62:    480d        .H      LDR      r0,[pc,#52] ; [0xb98] = 0x2000023a
        0x00000b64:    f002f812    ....    BL       Sin_Cos_Cale ; 0x2b8c
        0x00000b68:    480b        .H      LDR      r0,[pc,#44] ; [0xb98] = 0x2000023a
        0x00000b6a:    f7ffffb4    ....    BL       Park_Cale ; 0xad6
        0x00000b6e:    e01f        ..      B        0xbb0 ; FOC_Algorithm + 116
    $d
        0x00000b70:    00005555    UU..    DCD    21845
        0x00000b74:    00002aab    .*..    DCD    10923
        0x00000b78:    000024f3    .$..    DCD    9459
        0x00000b7c:    00006ed9    .n..    DCD    28377
        0x00000b80:    00007fff    ....    DCD    32767
        0x00000b84:    00003fff    .?..    DCD    16383
        0x00000b88:    20000004    ...     DCD    536870916
        0x00000b8c:    40046080    .`.@    DCD    1074028672
        0x00000b90:    40046000    .`.@    DCD    1074028544
        0x00000b94:    200000f4    ...     DCD    536871156
        0x00000b98:    2000023a    :..     DCD    536871482
        0x00000b9c:    200002dc    ...     DCD    536871644
        0x00000ba0:    20000304    ...     DCD    536871684
        0x00000ba4:    000049e7    .I..    DCD    18919
        0x00000ba8:    20000020     ..     DCD    536870944
        0x00000bac:    200002a8    ...     DCD    536871592
    $t
        0x00000bb0:    f7ffff7a    ..z.    BL       CurrentLoop ; 0xaa8
        0x00000bb4:    4836        6H      LDR      r0,[pc,#216] ; [0xc90] = 0x2000023a
        0x00000bb6:    f7ffff56    ..V.    BL       InvPark_Cale ; 0xa66
        0x00000bba:    89a1        ..      LDRH     r1,[r4,#0xc]
        0x00000bbc:    4835        5H      LDR      r0,[pc,#212] ; [0xc94] = 0x2000002c
        0x00000bbe:    8001        ..      STRH     r1,[r0,#0]
        0x00000bc0:    89e1        ..      LDRH     r1,[r4,#0xe]
        0x00000bc2:    8041        A.      STRH     r1,[r0,#2]
        0x00000bc4:    4934        4I      LDR      r1,[pc,#208] ; [0xc98] = 0x20000204
        0x00000bc6:    f7fffe07    ....    BL       mc_svpwmtrfm ; 0x7d8
        0x00000bca:    4834        4H      LDR      r0,[pc,#208] ; [0xc9c] = 0x20000064
        0x00000bcc:    4930        0I      LDR      r1,[pc,#192] ; [0xc90] = 0x2000023a
        0x00000bce:    8882        ..      LDRH     r2,[r0,#4]
        0x00000bd0:    4831        1H      LDR      r0,[pc,#196] ; [0xc98] = 0x20000204
        0x00000bd2:    f7fffdaf    ....    BL       mc_phasevoltcalc ; 0x734
        0x00000bd6:    f000f867    ..g.    BL       SMO_Observer ; 0xca8
        0x00000bda:    bd10        ..      POP      {r4,pc}
        0x00000bdc:    84a0        ..      STRH     r0,[r4,#0x24]
        0x00000bde:    e7c0        ..      B        0xb62 ; FOC_Algorithm + 38
    mcTailWind_Handle
        0x00000be0:    b510        ..      PUSH     {r4,lr}
        0x00000be2:    4c2b        +L      LDR      r4,[pc,#172] ; [0xc90] = 0x2000023a
        0x00000be4:    2000        .       MOVS     r0,#0
        0x00000be6:    8320         .      STRH     r0,[r4,#0x18]
        0x00000be8:    200d        .       MOVS     r0,#0xd
        0x00000bea:    8360        `.      STRH     r0,[r4,#0x1a]
        0x00000bec:    4620         F      MOV      r0,r4
        0x00000bee:    f7ffff93    ....    BL       Clake_Cale ; 0xb18
        0x00000bf2:    482b        +H      LDR      r0,[pc,#172] ; [0xca0] = 0x200002a8
        0x00000bf4:    8980        ..      LDRH     r0,[r0,#0xc]
        0x00000bf6:    84a0        ..      STRH     r0,[r4,#0x24]
        0x00000bf8:    4620         F      MOV      r0,r4
        0x00000bfa:    f001ffc7    ....    BL       Sin_Cos_Cale ; 0x2b8c
        0x00000bfe:    4620         F      MOV      r0,r4
        0x00000c00:    f7ffff69    ..i.    BL       Park_Cale ; 0xad6
        0x00000c04:    f7ffff50    ..P.    BL       CurrentLoop ; 0xaa8
        0x00000c08:    4620         F      MOV      r0,r4
        0x00000c0a:    f7ffff2c    ..,.    BL       InvPark_Cale ; 0xa66
        0x00000c0e:    89a1        ..      LDRH     r1,[r4,#0xc]
        0x00000c10:    4820         H      LDR      r0,[pc,#128] ; [0xc94] = 0x2000002c
        0x00000c12:    8001        ..      STRH     r1,[r0,#0]
        0x00000c14:    89e1        ..      LDRH     r1,[r4,#0xe]
        0x00000c16:    8041        A.      STRH     r1,[r0,#2]
        0x00000c18:    491f        .I      LDR      r1,[pc,#124] ; [0xc98] = 0x20000204
        0x00000c1a:    f7fffddd    ....    BL       mc_svpwmtrfm ; 0x7d8
        0x00000c1e:    481f        .H      LDR      r0,[pc,#124] ; [0xc9c] = 0x20000064
        0x00000c20:    4621        !F      MOV      r1,r4
        0x00000c22:    8882        ..      LDRH     r2,[r0,#4]
        0x00000c24:    481c        .H      LDR      r0,[pc,#112] ; [0xc98] = 0x20000204
        0x00000c26:    f7fffd85    ....    BL       mc_phasevoltcalc ; 0x734
        0x00000c2a:    f000f83d    ..=.    BL       SMO_Observer ; 0xca8
        0x00000c2e:    bd10        ..      POP      {r4,pc}
    RevPark_Circle_Limit
        0x00000c30:    211c        .!      MOVS     r1,#0x1c
        0x00000c32:    5e41        A^      LDRSH    r1,[r0,r1]
        0x00000c34:    221c        ."      MOVS     r2,#0x1c
        0x00000c36:    5e82        .^      LDRSH    r2,[r0,r2]
        0x00000c38:    4351        QC      MULS     r1,r2,r1
        0x00000c3a:    221e        ."      MOVS     r2,#0x1e
        0x00000c3c:    5e82        .^      LDRSH    r2,[r0,r2]
        0x00000c3e:    231e        .#      MOVS     r3,#0x1e
        0x00000c40:    5ec3        .^      LDRSH    r3,[r0,r3]
        0x00000c42:    435a        ZC      MULS     r2,r3,r2
