747lulu747/SAOZHAN_BRUASH/src/SDK-LIB/华芯第一版本硬件-非FPC/ROMAN-21DD - SDK - V0.1/out/SWM211.asm
        0x00000c44:    1889        ..      ADDS     r1,r1,r2
        0x00000c46:    4a17        .J      LDR      r2,[pc,#92] ; [0xca4] = 0x3c35cdf1
        0x00000c48:    4291        .B      CMP      r1,r2
        0x00000c4a:    d91f        ..      BLS      0xc8c ; RevPark_Circle_Limit + 92
        0x00000c4c:    211e        .!      MOVS     r1,#0x1e
        0x00000c4e:    5e41        A^      LDRSH    r1,[r0,r1]
        0x00000c50:    211e        .!      MOVS     r1,#0x1e
        0x00000c52:    5e41        A^      LDRSH    r1,[r0,r1]
        0x00000c54:    2900        .)      CMP      r1,#0
        0x00000c56:    db03        ..      BLT      0xc60 ; RevPark_Circle_Limit + 48
        0x00000c58:    211e        .!      MOVS     r1,#0x1e
        0x00000c5a:    5e41        A^      LDRSH    r1,[r0,r1]
        0x00000c5c:    13c9        ..      ASRS     r1,r1,#15
        0x00000c5e:    e004        ..      B        0xc6a ; RevPark_Circle_Limit + 58
        0x00000c60:    211e        .!      MOVS     r1,#0x1e
        0x00000c62:    5e41        A^      LDRSH    r1,[r0,r1]
        0x00000c64:    4249        IB      RSBS     r1,r1,#0
        0x00000c66:    13c9        ..      ASRS     r1,r1,#15
        0x00000c68:    4249        IB      RSBS     r1,r1,#0
        0x00000c6a:    83c1        ..      STRH     r1,[r0,#0x1e]
        0x00000c6c:    211c        .!      MOVS     r1,#0x1c
        0x00000c6e:    5e41        A^      LDRSH    r1,[r0,r1]
        0x00000c70:    211c        .!      MOVS     r1,#0x1c
        0x00000c72:    5e41        A^      LDRSH    r1,[r0,r1]
        0x00000c74:    2900        .)      CMP      r1,#0
        0x00000c76:    db03        ..      BLT      0xc80 ; RevPark_Circle_Limit + 80
        0x00000c78:    211c        .!      MOVS     r1,#0x1c
        0x00000c7a:    5e41        A^      LDRSH    r1,[r0,r1]
        0x00000c7c:    13c9        ..      ASRS     r1,r1,#15
        0x00000c7e:    e004        ..      B        0xc8a ; RevPark_Circle_Limit + 90
        0x00000c80:    211c        .!      MOVS     r1,#0x1c
        0x00000c82:    5e41        A^      LDRSH    r1,[r0,r1]
        0x00000c84:    4249        IB      RSBS     r1,r1,#0
        0x00000c86:    13c9        ..      ASRS     r1,r1,#15
        0x00000c88:    4249        IB      RSBS     r1,r1,#0
        0x00000c8a:    8381        ..      STRH     r1,[r0,#0x1c]
        0x00000c8c:    4770        pG      BX       lr
    $d
        0x00000c8e:    0000        ..      DCW    0
        0x00000c90:    2000023a    :..     DCD    536871482
        0x00000c94:    2000002c    ,..     DCD    536870956
        0x00000c98:    20000204    ...     DCD    536871428
        0x00000c9c:    20000064    d..     DCD    536871012
        0x00000ca0:    200002a8    ...     DCD    536871592
        0x00000ca4:    3c35cdf1    ..5<    DCD    1010159089
    $t
    PlaceInRAM
    SMO_Observer
        0x00000ca8:    b510        ..      PUSH     {r4,lr}
        0x00000caa:    480f        .H      LDR      r0,[pc,#60] ; [0xce8] = 0x2000023a
        0x00000cac:    8902        ..      LDRH     r2,[r0,#8]
        0x00000cae:    490f        .I      LDR      r1,[pc,#60] ; [0xcec] = 0x20000030
        0x00000cb0:    800a        ..      STRH     r2,[r1,#0]
        0x00000cb2:    8942        B.      LDRH     r2,[r0,#0xa]
        0x00000cb4:    804a        J.      STRH     r2,[r1,#2]
        0x00000cb6:    8a02        ..      LDRH     r2,[r0,#0x10]
        0x00000cb8:    490d        .I      LDR      r1,[pc,#52] ; [0xcf0] = 0x20000034
        0x00000cba:    800a        ..      STRH     r2,[r1,#0]
        0x00000cbc:    8a40        @.      LDRH     r0,[r0,#0x12]
        0x00000cbe:    8048        H.      STRH     r0,[r1,#2]
        0x00000cc0:    4a0c        .J      LDR      r2,[pc,#48] ; [0xcf4] = 0x20000268
        0x00000cc2:    480a        .H      LDR      r0,[pc,#40] ; [0xcec] = 0x20000030
        0x00000cc4:    f002fd70    ..p.    BL       mc_bemfobserv_PLL ; 0x37a8
        0x00000cc8:    480b        .H      LDR      r0,[pc,#44] ; [0xcf8] = 0x200002a8
        0x00000cca:    490c        .I      LDR      r1,[pc,#48] ; [0xcfc] = 0x20000064
        0x00000ccc:    8940        @.      LDRH     r0,[r0,#0xa]
        0x00000cce:    8188        ..      STRH     r0,[r1,#0xc]
        0x00000cd0:    480b        .H      LDR      r0,[pc,#44] ; [0xd00] = 0x20000010
        0x00000cd2:    7801        .x      LDRB     r1,[r0,#0]
        0x00000cd4:    480b        .H      LDR      r0,[pc,#44] ; [0xd04] = 0x200002c8
        0x00000cd6:    2903        .)      CMP      r1,#3
        0x00000cd8:    d002        ..      BEQ      0xce0 ; SMO_Observer + 56
        0x00000cda:    2100        .!      MOVS     r1,#0
        0x00000cdc:    7481        .t      STRB     r1,[r0,#0x12]
        0x00000cde:    bd10        ..      POP      {r4,pc}
        0x00000ce0:    2101        .!      MOVS     r1,#1
        0x00000ce2:    7481        .t      STRB     r1,[r0,#0x12]
        0x00000ce4:    bd10        ..      POP      {r4,pc}
    $d
        0x00000ce6:    0000        ..      DCW    0
        0x00000ce8:    2000023a    :..     DCD    536871482
        0x00000cec:    20000030    0..     DCD    536870960
        0x00000cf0:    20000034    4..     DCD    536870964
        0x00000cf4:    20000268    h..     DCD    536871528
        0x00000cf8:    200002a8    ...     DCD    536871592
        0x00000cfc:    20000064    d..     DCD    536871012
        0x00000d00:    20000010    ...     DCD    536870928
        0x00000d04:    200002c8    ...     DCD    536871624
    $t
    i.ACMP_Handler
    ACMP_Handler
        0x00000d08:    480b        .H      LDR      r0,[pc,#44] ; [0xd38] = 0x400aa080
        0x00000d0a:    6841        Ah      LDR      r1,[r0,#4]
        0x00000d0c:    0509        ..      LSLS     r1,r1,#20
        0x00000d0e:    d512        ..      BPL      0xd36 ; ACMP_Handler + 46
        0x00000d10:    2101        .!      MOVS     r1,#1
        0x00000d12:    02c9        ..      LSLS     r1,r1,#11
        0x00000d14:    6041        A`      STR      r1,[r0,#4]
        0x00000d16:    4909        .I      LDR      r1,[pc,#36] ; [0xd3c] = 0x20000010
        0x00000d18:    7808        .x      LDRB     r0,[r1,#0]
        0x00000d1a:    2800        .(      CMP      r0,#0
        0x00000d1c:    d00b        ..      BEQ      0xd36 ; ACMP_Handler + 46
        0x00000d1e:    2801        .(      CMP      r0,#1
        0x00000d20:    d009        ..      BEQ      0xd36 ; ACMP_Handler + 46
        0x00000d22:    280b        .(      CMP      r0,#0xb
        0x00000d24:    d007        ..      BEQ      0xd36 ; ACMP_Handler + 46
        0x00000d26:    4a07        .J      LDR      r2,[pc,#28] ; [0xd44] = 0x40046400
        0x00000d28:    4805        .H      LDR      r0,[pc,#20] ; [0xd40] = 0xffff
        0x00000d2a:    6050        P`      STR      r0,[r2,#4]
        0x00000d2c:    200b        .       MOVS     r0,#0xb
        0x00000d2e:    7008        .p      STRB     r0,[r1,#0]
        0x00000d30:    4905        .I      LDR      r1,[pc,#20] ; [0xd48] = 0x20000018
        0x00000d32:    2001        .       MOVS     r0,#1
        0x00000d34:    7008        .p      STRB     r0,[r1,#0]
        0x00000d36:    4770        pG      BX       lr
    $d
        0x00000d38:    400aa080    ...@    DCD    1074438272
        0x00000d3c:    20000010    ...     DCD    536870928
        0x00000d40:    0000ffff    ....    DCD    65535
        0x00000d44:    40046400    .d.@    DCD    1074029568
        0x00000d48:    20000018    ...     DCD    536870936
    $t
    i.ADC0_Handler
    ADC0_Handler
        0x00000d4c:    b510        ..      PUSH     {r4,lr}
        0x00000d4e:    480c        .H      LDR      r0,[pc,#48] ; [0xd80] = 0x20000010
        0x00000d50:    4c0c        .L      LDR      r4,[pc,#48] ; [0xd84] = 0x40049000
        0x00000d52:    7800        .x      LDRB     r0,[r0,#0]
        0x00000d54:    2804        .(      CMP      r0,#4
        0x00000d56:    d004        ..      BEQ      0xd62 ; ADC0_Handler + 22
        0x00000d58:    f001ff5a    ..Z.    BL       SingleR_ADCInject_Deal ; 0x2c10
        0x00000d5c:    2010        .       MOVS     r0,#0x10
        0x00000d5e:    60e0        .`      STR      r0,[r4,#0xc]
        0x00000d60:    bd10        ..      POP      {r4,pc}
        0x00000d62:    6b60        `k      LDR      r0,[r4,#0x34]
        0x00000d64:    2105        .!      MOVS     r1,#5
        0x00000d66:    0500        ..      LSLS     r0,r0,#20
        0x00000d68:    0d00        ..      LSRS     r0,r0,#20
        0x00000d6a:    f7fff9e3    ....    BL       __aeabi_uidiv ; 0x134
        0x00000d6e:    2128        (!      MOVS     r1,#0x28
        0x00000d70:    4348        HC      MULS     r0,r1,r0
        0x00000d72:    4905        .I      LDR      r1,[pc,#20] ; [0xd88] = 0x20000160
        0x00000d74:    8b09        ..      LDRH     r1,[r1,#0x18]
        0x00000d76:    1a40        @.      SUBS     r0,r0,r1
        0x00000d78:    4904        .I      LDR      r1,[pc,#16] ; [0xd8c] = 0x20000f8c
        0x00000d7a:    8208        ..      STRH     r0,[r1,#0x10]
        0x00000d7c:    e7ee        ..      B        0xd5c ; ADC0_Handler + 16
    $d
        0x00000d7e:    0000        ..      DCW    0
        0x00000d80:    20000010    ...     DCD    536870928
        0x00000d84:    40049000    ...@    DCD    1074040832
        0x00000d88:    20000160    `..     DCD    536871264
        0x00000d8c:    20000f8c    ...     DCD    536874892
    $t
    i.ADC_Close
    ADC_Close
        0x00000d90:    6801        .h      LDR      r1,[r0,#0]
        0x00000d92:    2201        ."      MOVS     r2,#1
        0x00000d94:    0312        ..      LSLS     r2,r2,#12
        0x00000d96:    4391        .C      BICS     r1,r1,r2
        0x00000d98:    6001        .`      STR      r1,[r0,#0]
        0x00000d9a:    4770        pG      BX       lr
    i.ADC_Init
    ADC_Init
        0x00000d9c:    b5f0        ..      PUSH     {r4-r7,lr}
        0x00000d9e:    4605        .F      MOV      r5,r0
        0x00000da0:    460c        .F      MOV      r4,r1
        0x00000da2:    4889        .H      LDR      r0,[pc,#548] ; [0xfc8] = 0xbffb7000
        0x00000da4:    4b89        .K      LDR      r3,[pc,#548] ; [0xfcc] = 0x40000000
        0x00000da6:    182e        ..      ADDS     r6,r5,r0
        0x00000da8:    d103        ..      BNE      0xdb2 ; ADC_Init + 22
        0x00000daa:    6898        .h      LDR      r0,[r3,#8]
        0x00000dac:    1119        ..      ASRS     r1,r3,#4
        0x00000dae:    4308        .C      ORRS     r0,r0,r1
        0x00000db0:    6098        .`      STR      r0,[r3,#8]
        0x00000db2:    4628        (F      MOV      r0,r5
        0x00000db4:    f7ffffec    ....    BL       ADC_Close ; 0xd90
        0x00000db8:    6819        .h      LDR      r1,[r3,#0]
        0x00000dba:    200f        .       MOVS     r0,#0xf
        0x00000dbc:    0400        ..      LSLS     r0,r0,#16
        0x00000dbe:    4381        .C      BICS     r1,r1,r0
        0x00000dc0:    6019        .`      STR      r1,[r3,#0]
        0x00000dc2:    6818        .h      LDR      r0,[r3,#0]
        0x00000dc4:    7821        !x      LDRB     r1,[r4,#0]
        0x00000dc6:    0709        ..      LSLS     r1,r1,#28
        0x00000dc8:    0b09        ..      LSRS     r1,r1,#12
        0x00000dca:    4308        .C      ORRS     r0,r0,r1
        0x00000dcc:    6018        .`      STR      r0,[r3,#0]
        0x00000dce:    462b        +F      MOV      r3,r5
        0x00000dd0:    33ff        .3      ADDS     r3,r3,#0xff
        0x00000dd2:    3381        .3      ADDS     r3,r3,#0x81
        0x00000dd4:    6a98        .j      LDR      r0,[r3,#0x28]
        0x00000dd6:    2118        .!      MOVS     r1,#0x18
        0x00000dd8:    4388        .C      BICS     r0,r0,r1
        0x00000dda:    6298        .b      STR      r0,[r3,#0x28]
        0x00000ddc:    6a98        .j      LDR      r0,[r3,#0x28]
        0x00000dde:    7821        !x      LDRB     r1,[r4,#0]
        0x00000de0:    0689        ..      LSLS     r1,r1,#26
        0x00000de2:    0f89        ..      LSRS     r1,r1,#30
        0x00000de4:    00c9        ..      LSLS     r1,r1,#3
        0x00000de6:    4308        .C      ORRS     r0,r0,r1
        0x00000de8:    6298        .b      STR      r0,[r3,#0x28]
        0x00000dea:    6a58        Xj      LDR      r0,[r3,#0x24]
        0x00000dec:    217f        .!      MOVS     r1,#0x7f
        0x00000dee:    0609        ..      LSLS     r1,r1,#24
        0x00000df0:    4388        .C      BICS     r0,r0,r1
        0x00000df2:    6258        Xb      STR      r0,[r3,#0x24]
        0x00000df4:    7820         x      LDRB     r0,[r4,#0]
        0x00000df6:    7861        ax      LDRB     r1,[r4,#1]
        0x00000df8:    0980        ..      LSRS     r0,r0,#6
        0x00000dfa:    0740        @.      LSLS     r0,r0,#29
        0x00000dfc:    0609        ..      LSLS     r1,r1,#24
        0x00000dfe:    4308        .C      ORRS     r0,r0,r1
        0x00000e00:    6a59        Yj      LDR      r1,[r3,#0x24]
        0x00000e02:    4308        .C      ORRS     r0,r0,r1
        0x00000e04:    6258        Xb      STR      r0,[r3,#0x24]
        0x00000e06:    6a58        Xj      LDR      r0,[r3,#0x24]
        0x00000e08:    4971        qI      LDR      r1,[pc,#452] ; [0xfd0] = 0xfffff8f9
        0x00000e0a:    4008        .@      ANDS     r0,r0,r1
        0x00000e0c:    6258        Xb      STR      r0,[r3,#0x24]
        0x00000e0e:    6a58        Xj      LDR      r0,[r3,#0x24]
        0x00000e10:    78a1        .x      LDRB     r1,[r4,#2]
        0x00000e12:    0909        ..      LSRS     r1,r1,#4
        0x00000e14:    0049        I.      LSLS     r1,r1,#1
        0x00000e16:    4308        .C      ORRS     r0,r0,r1
        0x00000e18:    6258        Xb      STR      r0,[r3,#0x24]
        0x00000e1a:    78a0        .x      LDRB     r0,[r4,#2]
        0x00000e1c:    4a6d        mJ      LDR      r2,[pc,#436] ; [0xfd4] = 0x40000080
        0x00000e1e:    0901        ..      LSRS     r1,r0,#4
        0x00000e20:    2703        .'      MOVS     r7,#3
        0x00000e22:    2001        .       MOVS     r0,#1
        0x00000e24:    2900        .)      CMP      r1,#0
        0x00000e26:    d028        (.      BEQ      0xe7a ; ADC_Init + 222
        0x00000e28:    6950        Pi      LDR      r0,[r2,#0x14]
        0x00000e2a:    6758        Xg      STR      r0,[r3,#0x74]
        0x00000e2c:    679f        .g      STR      r7,[r3,#0x78]
        0x00000e2e:    6a18        .j      LDR      r0,[r3,#0x20]
        0x00000e30:    0551        Q.      LSLS     r1,r2,#21
        0x00000e32:    4388        .C      BICS     r0,r0,r1
        0x00000e34:    6218        .b      STR      r0,[r3,#0x20]
        0x00000e36:    6a18        .j      LDR      r0,[r3,#0x20]
        0x00000e38:    78a1        .x      LDRB     r1,[r4,#2]
        0x00000e3a:    0709        ..      LSLS     r1,r1,#28
        0x00000e3c:    4308        .C      ORRS     r0,r0,r1
        0x00000e3e:    6218        .b      STR      r0,[r3,#0x20]
        0x00000e40:    8921        !.      LDRH     r1,[r4,#8]
        0x00000e42:    4628        (F      MOV      r0,r5
        0x00000e44:    04ca        ..      LSLS     r2,r1,#19
        0x00000e46:    3080        .0      ADDS     r0,r0,#0x80
        0x00000e48:    2a00        .*      CMP      r2,#0
        0x00000e4a:    da2a        *.      BGE      0xea2 ; ADC_Init + 262
        0x00000e4c:    0b0a        ..      LSRS     r2,r1,#12
        0x00000e4e:    0509        ..      LSLS     r1,r1,#20
        0x00000e50:    0d09        ..      LSRS     r1,r1,#20
        0x00000e52:    43c9        .C      MVNS     r1,r1
        0x00000e54:    6319        .c      STR      r1,[r3,#0x30]
        0x00000e56:    6d01        .m      LDR      r1,[r0,#0x50]
        0x00000e58:    4f5f        _O      LDR      r7,[pc,#380] ; [0xfd8] = 0xf000ffff
        0x00000e5a:    4039        9@      ANDS     r1,r1,r7
        0x00000e5c:    6501        .e      STR      r1,[r0,#0x50]
        0x00000e5e:    6d01        .m      LDR      r1,[r0,#0x50]
        0x00000e60:    88a7        ..      LDRH     r7,[r4,#4]
        0x00000e62:    043f        ?.      LSLS     r7,r7,#16
        0x00000e64:    4339        9C      ORRS     r1,r1,r7
        0x00000e66:    6501        .e      STR      r1,[r0,#0x50]
        0x00000e68:    6d01        .m      LDR      r1,[r0,#0x50]
        0x00000e6a:    0b09        ..      LSRS     r1,r1,#12
        0x00000e6c:    0309        ..      LSLS     r1,r1,#12
        0x00000e6e:    6501        .e      STR      r1,[r0,#0x50]
        0x00000e70:    6d01        .m      LDR      r1,[r0,#0x50]
        0x00000e72:    88a7        ..      LDRH     r7,[r4,#4]
        0x00000e74:    4339        9C      ORRS     r1,r1,r7
        0x00000e76:    6501        .e      STR      r1,[r0,#0x50]
        0x00000e78:    e01c        ..      B        0xeb4 ; ADC_Init + 280
        0x00000e7a:    4958        XI      LDR      r1,[pc,#352] ; [0xfdc] = 0x20000044
        0x00000e7c:    6008        .`      STR      r0,[r1,#0]
        0x00000e7e:    6990        .i      LDR      r0,[r2,#0x18]
        0x00000e80:    0300        ..      LSLS     r0,r0,#12
        0x00000e82:    0c00        ..      LSRS     r0,r0,#16
        0x00000e84:    6088        .`      STR      r0,[r1,#8]
        0x00000e86:    6992        .i      LDR      r2,[r2,#0x18]
        0x00000e88:    0d12        ..      LSRS     r2,r2,#20
        0x00000e8a:    604a        J`      STR      r2,[r1,#4]
        0x00000e8c:    0411        ..      LSLS     r1,r2,#16
        0x00000e8e:    4301        .C      ORRS     r1,r1,r0
        0x00000e90:    6759        Yg      STR      r1,[r3,#0x74]
        0x00000e92:    679f        .g      STR      r7,[r3,#0x78]
        0x00000e94:    6a58        Xj      LDR      r0,[r3,#0x24]
        0x00000e96:    78a1        .x      LDRB     r1,[r4,#2]
        0x00000e98:    0709        ..      LSLS     r1,r1,#28
        0x00000e9a:    0d09        ..      LSRS     r1,r1,#20
        0x00000e9c:    4308        .C      ORRS     r0,r0,r1
        0x00000e9e:    6258        Xb      STR      r0,[r3,#0x24]
        0x00000ea0:    e7ce        ..      B        0xe40 ; ADC_Init + 164
        0x00000ea2:    b2ca        ..      UXTB     r2,r1
        0x00000ea4:    6d01        .m      LDR      r1,[r0,#0x50]
        0x00000ea6:    0b09        ..      LSRS     r1,r1,#12
        0x00000ea8:    0309        ..      LSLS     r1,r1,#12
        0x00000eaa:    6501        .e      STR      r1,[r0,#0x50]
        0x00000eac:    6d01        .m      LDR      r1,[r0,#0x50]
        0x00000eae:    88a7        ..      LDRH     r7,[r4,#4]
        0x00000eb0:    4339        9C      ORRS     r1,r1,r7
        0x00000eb2:    6501        .e      STR      r1,[r0,#0x50]
        0x00000eb4:    6828        (h      LDR      r0,[r5,#0]
        0x00000eb6:    494a        JI      LDR      r1,[pc,#296] ; [0xfe0] = 0xfe1e1fff
        0x00000eb8:    4008        .@      ANDS     r0,r0,r1
        0x00000eba:    6028        (`      STR      r0,[r5,#0]
        0x00000ebc:    6828        (h      LDR      r0,[r5,#0]
        0x00000ebe:    79a1        .y      LDRB     r1,[r4,#6]
        0x00000ec0:    0549        I.      LSLS     r1,r1,#21
        0x00000ec2:    4308        .C      ORRS     r0,r0,r1
        0x00000ec4:    0391        ..      LSLS     r1,r2,#14
        0x00000ec6:    7aa2        .z      LDRB     r2,[r4,#0xa]
        0x00000ec8:    0352        R.      LSLS     r2,r2,#13
        0x00000eca:    4311        .C      ORRS     r1,r1,r2
        0x00000ecc:    4308        .C      ORRS     r0,r0,r1
        0x00000ece:    6028        (`      STR      r0,[r5,#0]
        0x00000ed0:    6a18        .j      LDR      r0,[r3,#0x20]
        0x00000ed2:    4944        DI      LDR      r1,[pc,#272] ; [0xfe4] = 0xfff000ff
        0x00000ed4:    4008        .@      ANDS     r0,r0,r1
        0x00000ed6:    6218        .b      STR      r0,[r3,#0x20]
        0x00000ed8:    6a18        .j      LDR      r0,[r3,#0x20]
        0x00000eda:    210f        .!      MOVS     r1,#0xf
        0x00000edc:    0409        ..      LSLS     r1,r1,#16
        0x00000ede:    4308        .C      ORRS     r0,r0,r1
        0x00000ee0:    6218        .b      STR      r0,[r3,#0x20]
        0x00000ee2:    2000        .       MOVS     r0,#0
        0x00000ee4:    60a8        .`      STR      r0,[r5,#8]
        0x00000ee6:    4840        @H      LDR      r0,[pc,#256] ; [0xfe8] = 0x7ffff
        0x00000ee8:    60e8        .`      STR      r0,[r5,#0xc]
        0x00000eea:    89a0        ..      LDRH     r0,[r4,#0xc]
        0x00000eec:    0782        ..      LSLS     r2,r0,#30
        0x00000eee:    07c1        ..      LSLS     r1,r0,#31
        0x00000ef0:    0fd2        ..      LSRS     r2,r2,#31
        0x00000ef2:    0fc9        ..      LSRS     r1,r1,#31
        0x00000ef4:    0092        ..      LSLS     r2,r2,#2
        0x00000ef6:    4311        .C      ORRS     r1,r1,r2
        0x00000ef8:    0742        B.      LSLS     r2,r0,#29
        0x00000efa:    0fd2        ..      LSRS     r2,r2,#31
        0x00000efc:    0112        ..      LSLS     r2,r2,#4
        0x00000efe:    4311        .C      ORRS     r1,r1,r2
        0x00000f00:    0702        ..      LSLS     r2,r0,#28
        0x00000f02:    0fd2        ..      LSRS     r2,r2,#31
        0x00000f04:    0192        ..      LSLS     r2,r2,#6
        0x00000f06:    4311        .C      ORRS     r1,r1,r2
        0x00000f08:    06c2        ..      LSLS     r2,r0,#27
        0x00000f0a:    0fd2        ..      LSRS     r2,r2,#31
        0x00000f0c:    0212        ..      LSLS     r2,r2,#8
        0x00000f0e:    4311        .C      ORRS     r1,r1,r2
        0x00000f10:    0682        ..      LSLS     r2,r0,#26
        0x00000f12:    0fd2        ..      LSRS     r2,r2,#31
        0x00000f14:    0292        ..      LSLS     r2,r2,#10
        0x00000f16:    4311        .C      ORRS     r1,r1,r2
        0x00000f18:    0642        B.      LSLS     r2,r0,#25
        0x00000f1a:    0fd2        ..      LSRS     r2,r2,#31
        0x00000f1c:    0312        ..      LSLS     r2,r2,#12
        0x00000f1e:    4311        .C      ORRS     r1,r1,r2
        0x00000f20:    0602        ..      LSLS     r2,r0,#24
        0x00000f22:    0fd2        ..      LSRS     r2,r2,#31
        0x00000f24:    0392        ..      LSLS     r2,r2,#14
        0x00000f26:    4311        .C      ORRS     r1,r1,r2
        0x00000f28:    05c2        ..      LSLS     r2,r0,#23
        0x00000f2a:    0fd2        ..      LSRS     r2,r2,#31
        0x00000f2c:    0412        ..      LSLS     r2,r2,#16
        0x00000f2e:    4311        .C      ORRS     r1,r1,r2
        0x00000f30:    0582        ..      LSLS     r2,r0,#22
        0x00000f32:    0fd2        ..      LSRS     r2,r2,#31
        0x00000f34:    0492        ..      LSLS     r2,r2,#18
        0x00000f36:    4311        .C      ORRS     r1,r1,r2
        0x00000f38:    0542        B.      LSLS     r2,r0,#21
        0x00000f3a:    0fd2        ..      LSRS     r2,r2,#31
        0x00000f3c:    0512        ..      LSLS     r2,r2,#20
        0x00000f3e:    0500        ..      LSLS     r0,r0,#20
        0x00000f40:    0fc0        ..      LSRS     r0,r0,#31
        0x00000f42:    4311        .C      ORRS     r1,r1,r2
        0x00000f44:    0580        ..      LSLS     r0,r0,#22
        0x00000f46:    4301        .C      ORRS     r1,r1,r0
        0x00000f48:    68a8        .h      LDR      r0,[r5,#8]
        0x00000f4a:    4301        .C      ORRS     r1,r1,r0
        0x00000f4c:    60a9        .`      STR      r1,[r5,#8]
        0x00000f4e:    89e0        ..      LDRH     r0,[r4,#0xe]
        0x00000f50:    0782        ..      LSLS     r2,r0,#30
        0x00000f52:    07c1        ..      LSLS     r1,r0,#31
        0x00000f54:    0fd2        ..      LSRS     r2,r2,#31
