747lulu747/SAOZHAN_BRUASH/src/SDK-LIB/华芯第一版本硬件-非FPC/ROMAN-21DD - SDK - V0.1/out/SWM211.asm
        0x00000f56:    0f89        ..      LSRS     r1,r1,#30
        0x00000f58:    00d2        ..      LSLS     r2,r2,#3
        0x00000f5a:    4311        .C      ORRS     r1,r1,r2
        0x00000f5c:    0742        B.      LSLS     r2,r0,#29
        0x00000f5e:    0fd2        ..      LSRS     r2,r2,#31
        0x00000f60:    0152        R.      LSLS     r2,r2,#5
        0x00000f62:    4311        .C      ORRS     r1,r1,r2
        0x00000f64:    0702        ..      LSLS     r2,r0,#28
        0x00000f66:    0fd2        ..      LSRS     r2,r2,#31
        0x00000f68:    01d2        ..      LSLS     r2,r2,#7
        0x00000f6a:    4311        .C      ORRS     r1,r1,r2
        0x00000f6c:    06c2        ..      LSLS     r2,r0,#27
        0x00000f6e:    0fd2        ..      LSRS     r2,r2,#31
        0x00000f70:    0252        R.      LSLS     r2,r2,#9
        0x00000f72:    4311        .C      ORRS     r1,r1,r2
        0x00000f74:    0682        ..      LSLS     r2,r0,#26
        0x00000f76:    0fd2        ..      LSRS     r2,r2,#31
        0x00000f78:    02d2        ..      LSLS     r2,r2,#11
        0x00000f7a:    4311        .C      ORRS     r1,r1,r2
        0x00000f7c:    0642        B.      LSLS     r2,r0,#25
        0x00000f7e:    0fd2        ..      LSRS     r2,r2,#31
        0x00000f80:    0352        R.      LSLS     r2,r2,#13
        0x00000f82:    4311        .C      ORRS     r1,r1,r2
        0x00000f84:    0602        ..      LSLS     r2,r0,#24
        0x00000f86:    0fd2        ..      LSRS     r2,r2,#31
        0x00000f88:    03d2        ..      LSLS     r2,r2,#15
        0x00000f8a:    4311        .C      ORRS     r1,r1,r2
        0x00000f8c:    05c2        ..      LSLS     r2,r0,#23
        0x00000f8e:    0fd2        ..      LSRS     r2,r2,#31
        0x00000f90:    0452        R.      LSLS     r2,r2,#17
        0x00000f92:    4311        .C      ORRS     r1,r1,r2
        0x00000f94:    0582        ..      LSLS     r2,r0,#22
        0x00000f96:    0fd2        ..      LSRS     r2,r2,#31
        0x00000f98:    04d2        ..      LSLS     r2,r2,#19
        0x00000f9a:    4311        .C      ORRS     r1,r1,r2
        0x00000f9c:    0542        B.      LSLS     r2,r0,#21
        0x00000f9e:    0fd2        ..      LSRS     r2,r2,#31
        0x00000fa0:    0552        R.      LSLS     r2,r2,#21
        0x00000fa2:    0500        ..      LSLS     r0,r0,#20
        0x00000fa4:    0fc0        ..      LSRS     r0,r0,#31
        0x00000fa6:    4311        .C      ORRS     r1,r1,r2
        0x00000fa8:    05c0        ..      LSLS     r0,r0,#23
        0x00000faa:    4301        .C      ORRS     r1,r1,r0
        0x00000fac:    68a8        .h      LDR      r0,[r5,#8]
        0x00000fae:    4301        .C      ORRS     r1,r1,r0
        0x00000fb0:    60a9        .`      STR      r1,[r5,#8]
        0x00000fb2:    2e00        ..      CMP      r6,#0
        0x00000fb4:    d107        ..      BNE      0xfc6 ; ADC_Init + 554
        0x00000fb6:    89a0        ..      LDRH     r0,[r4,#0xc]
        0x00000fb8:    89e1        ..      LDRH     r1,[r4,#0xe]
        0x00000fba:    4308        .C      ORRS     r0,r0,r1
        0x00000fbc:    d003        ..      BEQ      0xfc6 ; ADC_Init + 554
        0x00000fbe:    2001        .       MOVS     r0,#1
        0x00000fc0:    490a        .I      LDR      r1,[pc,#40] ; [0xfec] = 0xe000e100
        0x00000fc2:    0380        ..      LSLS     r0,r0,#14
        0x00000fc4:    6008        .`      STR      r0,[r1,#0]
        0x00000fc6:    bdf0        ..      POP      {r4-r7,pc}
    $d
        0x00000fc8:    bffb7000    .p..    DCD    3220926464
        0x00000fcc:    40000000    ...@    DCD    1073741824
        0x00000fd0:    fffff8f9    ....    DCD    4294965497
        0x00000fd4:    40000080    ...@    DCD    1073741952
        0x00000fd8:    f000ffff    ....    DCD    4026597375
        0x00000fdc:    20000044    D..     DCD    536870980
        0x00000fe0:    fe1e1fff    ....    DCD    4263387135
        0x00000fe4:    fff000ff    ....    DCD    4293918975
        0x00000fe8:    0007ffff    ....    DCD    524287
        0x00000fec:    e000e100    ....    DCD    3758153984
    $t
    i.ADC_Open
    ADC_Open
        0x00000ff0:    6801        .h      LDR      r1,[r0,#0]
        0x00000ff2:    2201        ."      MOVS     r2,#1
        0x00000ff4:    0312        ..      LSLS     r2,r2,#12
        0x00000ff6:    4311        .C      ORRS     r1,r1,r2
        0x00000ff8:    6001        .`      STR      r1,[r0,#0]
        0x00000ffa:    4770        pG      BX       lr
    i.ADC_Start
    ADC_Start
        0x00000ffc:    2101        .!      MOVS     r1,#1
        0x00000ffe:    6041        A`      STR      r1,[r0,#4]
        0x00001000:    4770        pG      BX       lr
    i.Abs_F15
    Abs_F15
        0x00001002:    2800        .(      CMP      r0,#0
        0x00001004:    da02        ..      BGE      0x100c ; Abs_F15 + 10
        0x00001006:    4240        @B      RSBS     r0,r0,#0
        0x00001008:    b280        ..      UXTH     r0,r0
        0x0000100a:    4770        pG      BX       lr
        0x0000100c:    b280        ..      UXTH     r0,r0
        0x0000100e:    4770        pG      BX       lr
    i.Base_1ms_TIM
    Base_1ms_TIM
        0x00001010:    b570        p.      PUSH     {r4-r6,lr}
        0x00001012:    4c19        .L      LDR      r4,[pc,#100] ; [0x1078] = 0x20000064
        0x00001014:    6ce0        .l      LDR      r0,[r4,#0x4c]
        0x00001016:    2800        .(      CMP      r0,#0
        0x00001018:    dd01        ..      BLE      0x101e ; Base_1ms_TIM + 14
        0x0000101a:    1e40        @.      SUBS     r0,r0,#1
        0x0000101c:    64e0        .d      STR      r0,[r4,#0x4c]
        0x0000101e:    6d60        `m      LDR      r0,[r4,#0x54]
        0x00001020:    2800        .(      CMP      r0,#0
        0x00001022:    d001        ..      BEQ      0x1028 ; Base_1ms_TIM + 24
        0x00001024:    1e40        @.      SUBS     r0,r0,#1
        0x00001026:    6560        `e      STR      r0,[r4,#0x54]
        0x00001028:    4d14        .M      LDR      r5,[pc,#80] ; [0x107c] = 0x20000010
        0x0000102a:    7828        (x      LDRB     r0,[r5,#0]
        0x0000102c:    2805        .(      CMP      r0,#5
        0x0000102e:    d10b        ..      BNE      0x1048 ; Base_1ms_TIM + 56
        0x00001030:    8ea0        ..      LDRH     r0,[r4,#0x34]
        0x00001032:    b200        ..      SXTH     r0,r0
        0x00001034:    f7ffffe5    ....    BL       Abs_F15 ; 0x1002
        0x00001038:    2851        Q(      CMP      r0,#0x51
        0x0000103a:    d902        ..      BLS      0x1042 ; Base_1ms_TIM + 50
        0x0000103c:    6ce0        .l      LDR      r0,[r4,#0x4c]
        0x0000103e:    2800        .(      CMP      r0,#0
        0x00001040:    dc02        ..      BGT      0x1048 ; Base_1ms_TIM + 56
        0x00001042:    6ba0        .k      LDR      r0,[r4,#0x38]
        0x00001044:    1c40        @.      ADDS     r0,r0,#1
        0x00001046:    63a0        .c      STR      r0,[r4,#0x38]
        0x00001048:    490d        .I      LDR      r1,[pc,#52] ; [0x1080] = 0x200000a4
        0x0000104a:    22ff        ."      MOVS     r2,#0xff
        0x0000104c:    8a08        ..      LDRH     r0,[r1,#0x10]
        0x0000104e:    32f5        .2      ADDS     r2,r2,#0xf5
        0x00001050:    4290        .B      CMP      r0,r2
        0x00001052:    d201        ..      BCS      0x1058 ; Base_1ms_TIM + 72
        0x00001054:    1c40        @.      ADDS     r0,r0,#1
        0x00001056:    8208        ..      STRH     r0,[r1,#0x10]
        0x00001058:    7828        (x      LDRB     r0,[r5,#0]
        0x0000105a:    2807        .(      CMP      r0,#7
        0x0000105c:    d10b        ..      BNE      0x1076 ; Base_1ms_TIM + 102
        0x0000105e:    8820         .      LDRH     r0,[r4,#0]
        0x00001060:    2800        .(      CMP      r0,#0
        0x00001062:    d108        ..      BNE      0x1076 ; Base_1ms_TIM + 102
        0x00001064:    4807        .H      LDR      r0,[pc,#28] ; [0x1084] = 0x2000023a
        0x00001066:    211a        .!      MOVS     r1,#0x1a
        0x00001068:    5e41        A^      LDRSH    r1,[r0,r1]
        0x0000106a:    4a07        .J      LDR      r2,[pc,#28] ; [0x1088] = 0xaaa
        0x0000106c:    4291        .B      CMP      r1,r2
        0x0000106e:    da02        ..      BGE      0x1076 ; Base_1ms_TIM + 102
        0x00001070:    8b41        A.      LDRH     r1,[r0,#0x1a]
        0x00001072:    1c49        I.      ADDS     r1,r1,#1
        0x00001074:    8341        A.      STRH     r1,[r0,#0x1a]
        0x00001076:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x00001078:    20000064    d..     DCD    536871012
        0x0000107c:    20000010    ...     DCD    536870928
        0x00001080:    200000a4    ...     DCD    536871076
        0x00001084:    2000023a    :..     DCD    536871482
        0x00001088:    00000aaa    ....    DCD    2730
    $t
    i.CORDIC_Init
    CORDIC_Init
        0x0000108c:    4904        .I      LDR      r1,[pc,#16] ; [0x10a0] = 0xbfffd000
        0x0000108e:    42c8        .B      CMN      r0,r1
        0x00001090:    d104        ..      BNE      0x109c ; CORDIC_Init + 16
        0x00001092:    0488        ..      LSLS     r0,r1,#18
        0x00001094:    6881        .h      LDR      r1,[r0,#8]
        0x00001096:    1282        ..      ASRS     r2,r0,#10
        0x00001098:    4311        .C      ORRS     r1,r1,r2
        0x0000109a:    6081        .`      STR      r1,[r0,#8]
        0x0000109c:    4770        pG      BX       lr
    $d
        0x0000109e:    0000        ..      DCW    0
        0x000010a0:    bfffd000    ....    DCD    3221213184
    $t
    i.Cancel_FGTimer
    Cancel_FGTimer
        0x000010a4:    b510        ..      PUSH     {r4,lr}
        0x000010a6:    2300        .#      MOVS     r3,#0
        0x000010a8:    461a        .F      MOV      r2,r3
        0x000010aa:    2106        .!      MOVS     r1,#6
        0x000010ac:    4803        .H      LDR      r0,[pc,#12] ; [0x10bc] = 0x400a0010
        0x000010ae:    f001fa8d    ....    BL       PORT_Init ; 0x25cc
        0x000010b2:    4803        .H      LDR      r0,[pc,#12] ; [0x10c0] = 0x40046800
        0x000010b4:    f002f930    ..0.    BL       TIMR_Stop ; 0x3318
        0x000010b8:    bd10        ..      POP      {r4,pc}
    $d
        0x000010ba:    0000        ..      DCW    0
        0x000010bc:    400a0010    ...@    DCD    1074397200
        0x000010c0:    40046800    .h.@    DCD    1074030592
    $t
    i.DIV_Init
    DIV_Init
        0x000010c4:    4904        .I      LDR      r1,[pc,#16] ; [0x10d8] = 0xbfffc800
        0x000010c6:    42c8        .B      CMN      r0,r1
        0x000010c8:    d104        ..      BNE      0x10d4 ; DIV_Init + 16
        0x000010ca:    04c8        ..      LSLS     r0,r1,#19
        0x000010cc:    6881        .h      LDR      r1,[r0,#8]
        0x000010ce:    1242        B.      ASRS     r2,r0,#9
        0x000010d0:    4311        .C      ORRS     r1,r1,r2
        0x000010d2:    6081        .`      STR      r1,[r0,#8]
        0x000010d4:    4770        pG      BX       lr
    $d
        0x000010d6:    0000        ..      DCW    0
        0x000010d8:    bfffc800    ....    DCD    3221211136
    $t
    i.FGOutput_Timer
    FGOutput_Timer
        0x000010dc:    b538        8.      PUSH     {r3-r5,lr}
        0x000010de:    2206        ."      MOVS     r2,#6
        0x000010e0:    2300        .#      MOVS     r3,#0
        0x000010e2:    4611        .F      MOV      r1,r2
        0x000010e4:    480b        .H      LDR      r0,[pc,#44] ; [0x1114] = 0x400a0010
        0x000010e6:    f001fa71    ..q.    BL       PORT_Init ; 0x25cc
        0x000010ea:    2000        .       MOVS     r0,#0
        0x000010ec:    9000        ..      STR      r0,[sp,#0]
        0x000010ee:    480b        .H      LDR      r0,[pc,#44] ; [0x111c] = 0x20000060
        0x000010f0:    4c0b        .L      LDR      r4,[pc,#44] ; [0x1120] = 0x40046800
        0x000010f2:    6802        .h      LDR      r2,[r0,#0]
        0x000010f4:    4b08        .K      LDR      r3,[pc,#32] ; [0x1118] = 0x4e20
        0x000010f6:    2108        .!      MOVS     r1,#8
        0x000010f8:    4620         F      MOV      r0,r4
        0x000010fa:    f001ffff    ....    BL       TIMR_Init ; 0x30fc
        0x000010fe:    2301        .#      MOVS     r3,#1
        0x00001100:    2200        ."      MOVS     r2,#0
        0x00001102:    4908        .I      LDR      r1,[pc,#32] ; [0x1124] = 0x2710
        0x00001104:    4620         F      MOV      r0,r4
        0x00001106:    f002f893    ....    BL       TIMR_OC_Init ; 0x3230
        0x0000110a:    4620         F      MOV      r0,r4
        0x0000110c:    f002f8c0    ....    BL       TIMR_Start ; 0x3290
        0x00001110:    bd38        8.      POP      {r3-r5,pc}
    $d
        0x00001112:    0000        ..      DCW    0
        0x00001114:    400a0010    ...@    DCD    1074397200
        0x00001118:    00004e20     N..    DCD    20000
        0x0000111c:    20000060    `..     DCD    536871008
        0x00001120:    40046800    .h.@    DCD    1074030592
        0x00001124:    00002710    .'..    DCD    10000
    $t
    i.FOCCloseLoopStart
    FOCCloseLoopStart
        0x00001128:    480c        .H      LDR      r0,[pc,#48] ; [0x115c] = 0x20000304
        0x0000112a:    4a0b        .J      LDR      r2,[pc,#44] ; [0x1158] = 0x7fff
        0x0000112c:    6102        .a      STR      r2,[r0,#0x10]
        0x0000112e:    21ff        .!      MOVS     r1,#0xff
        0x00001130:    318a        .1      ADDS     r1,r1,#0x8a
        0x00001132:    6141        Aa      STR      r1,[r0,#0x14]
        0x00001134:    480a        .H      LDR      r0,[pc,#40] ; [0x1160] = 0x200002dc
        0x00001136:    6102        .a      STR      r2,[r0,#0x10]
        0x00001138:    6141        Aa      STR      r1,[r0,#0x14]
        0x0000113a:    490b        .I      LDR      r1,[pc,#44] ; [0x1168] = 0x20000064
        0x0000113c:    4809        .H      LDR      r0,[pc,#36] ; [0x1164] = 0x888
        0x0000113e:    8408        ..      STRH     r0,[r1,#0x20]
        0x00001140:    4a0a        .J      LDR      r2,[pc,#40] ; [0x116c] = 0x2000023a
        0x00001142:    2000        .       MOVS     r0,#0
        0x00001144:    8310        ..      STRH     r0,[r2,#0x18]
        0x00001146:    4b0a        .K      LDR      r3,[pc,#40] ; [0x1170] = 0x333
        0x00001148:    8353        S.      STRH     r3,[r2,#0x1a]
        0x0000114a:    4a0a        .J      LDR      r2,[pc,#40] ; [0x1174] = 0x2000032c
        0x0000114c:    82d3        ..      STRH     r3,[r2,#0x16]
        0x0000114e:    4b0a        .K      LDR      r3,[pc,#40] ; [0x1178] = 0x20000010
        0x00001150:    2207        ."      MOVS     r2,#7
        0x00001152:    701a        .p      STRB     r2,[r3,#0]
        0x00001154:    8008        ..      STRH     r0,[r1,#0]
        0x00001156:    4770        pG      BX       lr
    $d
        0x00001158:    00007fff    ....    DCD    32767
        0x0000115c:    20000304    ...     DCD    536871684
        0x00001160:    200002dc    ...     DCD    536871644
        0x00001164:    00000888    ....    DCD    2184
        0x00001168:    20000064    d..     DCD    536871012
        0x0000116c:    2000023a    :..     DCD    536871482
        0x00001170:    00000333    3...    DCD    819
        0x00001174:    2000032c    ,..     DCD    536871724
        0x00001178:    20000010    ...     DCD    536870928
    $t
    i.FOCTailWindDealwith
    FOCTailWindDealwith
        0x0000117c:    b510        ..      PUSH     {r4,lr}
        0x0000117e:    f001fc9d    ....    BL       SMO_TailWindDealwith ; 0x2abc
        0x00001182:    bd10        ..      POP      {r4,pc}
    i.FOCTailWindTimeLimit
    FOCTailWindTimeLimit
        0x00001184:    490d        .I      LDR      r1,[pc,#52] ; [0x11bc] = 0x200001e4
        0x00001186:    2205        ."      MOVS     r2,#5
        0x00001188:    8908        ..      LDRH     r0,[r1,#8]
        0x0000118a:    0212        ..      LSLS     r2,r2,#8
        0x0000118c:    4290        .B      CMP      r0,r2
        0x0000118e:    d201        ..      BCS      0x1194 ; FOCTailWindTimeLimit + 16
        0x00001190:    1c40        @.      ADDS     r0,r0,#1
        0x00001192:    8108        ..      STRH     r0,[r1,#8]
        0x00001194:    8bc8        ..      LDRH     r0,[r1,#0x1e]
        0x00001196:    230f        .#      MOVS     r3,#0xf
        0x00001198:    021b        ..      LSLS     r3,r3,#8
        0x0000119a:    4298        .B      CMP      r0,r3
        0x0000119c:    d201        ..      BCS      0x11a2 ; FOCTailWindTimeLimit + 30
        0x0000119e:    1c40        @.      ADDS     r0,r0,#1
        0x000011a0:    83c8        ..      STRH     r0,[r1,#0x1e]
        0x000011a2:    8bc8        ..      LDRH     r0,[r1,#0x1e]
        0x000011a4:    4298        .B      CMP      r0,r3
        0x000011a6:    d002        ..      BEQ      0x11ae ; FOCTailWindTimeLimit + 42
        0x000011a8:    8908        ..      LDRH     r0,[r1,#8]
        0x000011aa:    4290        .B      CMP      r0,r2
        0x000011ac:    d104        ..      BNE      0x11b8 ; FOCTailWindTimeLimit + 52
        0x000011ae:    2000        .       MOVS     r0,#0
        0x000011b0:    8048        H.      STRH     r0,[r1,#2]
        0x000011b2:    8108        ..      STRH     r0,[r1,#8]
        0x000011b4:    2001        .       MOVS     r0,#1
        0x000011b6:    7408        .t      STRB     r0,[r1,#0x10]
        0x000011b8:    4770        pG      BX       lr
    $d
        0x000011ba:    0000        ..      DCW    0
        0x000011bc:    200001e4    ...     DCD    536871396
    $t
    i.FOC_Init
    FOC_Init
        0x000011c0:    b510        ..      PUSH     {r4,lr}
        0x000011c2:    f001f993    ....    BL       PI_Init ; 0x24ec
        0x000011c6:    2136        6!      MOVS     r1,#0x36
        0x000011c8:    480f        .H      LDR      r0,[pc,#60] ; [0x1208] = 0x20000204
        0x000011ca:    f7feffe4    ....    BL       __aeabi_memclr ; 0x196
        0x000011ce:    212c        ,!      MOVS     r1,#0x2c
        0x000011d0:    480e        .H      LDR      r0,[pc,#56] ; [0x120c] = 0x2000023a
        0x000011d2:    f7feffe0    ....    BL       __aeabi_memclr ; 0x196
        0x000011d6:    480c        .H      LDR      r0,[pc,#48] ; [0x1208] = 0x20000204
        0x000011d8:    490d        .I      LDR      r1,[pc,#52] ; [0x1210] = 0xafc
        0x000011da:    8581        ..      STRH     r1,[r0,#0x2c]
        0x000011dc:    2151        Q!      MOVS     r1,#0x51
        0x000011de:    85c1        ..      STRH     r1,[r0,#0x2e]
        0x000011e0:    490c        .I      LDR      r1,[pc,#48] ; [0x1214] = 0x9d4
        0x000011e2:    8601        ..      STRH     r1,[r0,#0x30]
        0x000011e4:    2136        6!      MOVS     r1,#0x36
        0x000011e6:    43c9        .C      MVNS     r1,r1
        0x000011e8:    8641        A.      STRH     r1,[r0,#0x32]
        0x000011ea:    8681        ..      STRH     r1,[r0,#0x34]
        0x000011ec:    490a        .I      LDR      r1,[pc,#40] ; [0x1218] = 0x707
        0x000011ee:    84c1        ..      STRH     r1,[r0,#0x26]
        0x000011f0:    214b        K!      MOVS     r1,#0x4b
        0x000011f2:    0109        ..      LSLS     r1,r1,#4
        0x000011f4:    8501        ..      STRH     r1,[r0,#0x28]
        0x000011f6:    2101        .!      MOVS     r1,#1
        0x000011f8:    8481        ..      STRH     r1,[r0,#0x24]
        0x000011fa:    f002fc47    ..G.    BL       mc_bemfobservinit_PLL ; 0x3a8c
        0x000011fe:    4903        .I      LDR      r1,[pc,#12] ; [0x120c] = 0x2000023a
        0x00001200:    2007        .       MOVS     r0,#7
        0x00001202:    7048        Hp      STRB     r0,[r1,#1]
        0x00001204:    bd10        ..      POP      {r4,pc}
    $d
        0x00001206:    0000        ..      DCW    0
        0x00001208:    20000204    ...     DCD    536871428
        0x0000120c:    2000023a    :..     DCD    536871482
        0x00001210:    00000afc    ....    DCD    2812
        0x00001214:    000009d4    ....    DCD    2516
        0x00001218:    00000707    ....    DCD    1799
    $t
    i.FaultProcess
    FaultProcess
        0x0000121c:    4902        .I      LDR      r1,[pc,#8] ; [0x1228] = 0x40046400
        0x0000121e:    4801        .H      LDR      r0,[pc,#4] ; [0x1224] = 0xffff
        0x00001220:    6048        H`      STR      r0,[r1,#4]
        0x00001222:    4770        pG      BX       lr
    $d
        0x00001224:    0000ffff    ....    DCD    65535
        0x00001228:    40046400    .d.@    DCD    1074029568
    $t
    i.Fault_Detection
    Fault_Detection
        0x0000122c:    b500        ..      PUSH     {lr}
        0x0000122e:    490e        .I      LDR      r1,[pc,#56] ; [0x1268] = 0x2000019c
        0x00001230:    8808        ..      LDRH     r0,[r1,#0]
        0x00001232:    1c40        @.      ADDS     r0,r0,#1
        0x00001234:    b280        ..      UXTH     r0,r0
        0x00001236:    8008        ..      STRH     r0,[r1,#0]
        0x00001238:    2805        .(      CMP      r0,#5
        0x0000123a:    d301        ..      BCC      0x1240 ; Fault_Detection + 20
        0x0000123c:    2000        .       MOVS     r0,#0
        0x0000123e:    8008        ..      STRH     r0,[r1,#0]
        0x00001240:    8808        ..      LDRH     r0,[r1,#0]
        0x00001242:    2800        .(      CMP      r0,#0
        0x00001244:    d009        ..      BEQ      0x125a ; Fault_Detection + 46
        0x00001246:    2801        .(      CMP      r0,#1
        0x00001248:    d008        ..      BEQ      0x125c ; Fault_Detection + 48
        0x0000124a:    2802        .(      CMP      r0,#2
        0x0000124c:    d005        ..      BEQ      0x125a ; Fault_Detection + 46
        0x0000124e:    2803        .(      CMP      r0,#3
        0x00001250:    d007        ..      BEQ      0x1262 ; Fault_Detection + 54
        0x00001252:    2804        .(      CMP      r0,#4
        0x00001254:    d101        ..      BNE      0x125a ; Fault_Detection + 46
        0x00001256:    f000f971    ..q.    BL       Fault_phaseloss ; 0x153c
        0x0000125a:    bd00        ..      POP      {pc}
        0x0000125c:    f000f806    ....    BL       Fault_OverUnderVoltage ; 0x126c
        0x00001260:    bd00        ..      POP      {pc}
        0x00001262:    f000f8ed    ....    BL       Fault_Stall ; 0x1440
        0x00001266:    bd00        ..      POP      {pc}
    $d
        0x00001268:    2000019c    ...     DCD    536871324
    $t
    i.Fault_OverUnderVoltage
    Fault_OverUnderVoltage
        0x0000126c:    b4f0        ..      PUSH     {r4-r7}
        0x0000126e:    4b30        0K      LDR      r3,[pc,#192] ; [0x1330] = 0x20000018
        0x00001270:    4f2e        .O      LDR      r7,[pc,#184] ; [0x132c] = 0x3554
        0x00001272:    805f        _.      STRH     r7,[r3,#2]
        0x00001274:    4d2f        /M      LDR      r5,[pc,#188] ; [0x1334] = 0x66da
        0x00001276:    809d        ..      STRH     r5,[r3,#4]
        0x00001278:    492f        /I      LDR      r1,[pc,#188] ; [0x1338] = 0x20000064
        0x0000127a:    7818        .x      LDRB     r0,[r3,#0]
        0x0000127c:    8889        ..      LDRH     r1,[r1,#4]
        0x0000127e:    2400        .$      MOVS     r4,#0
        0x00001280:    4e2e        .N      LDR      r6,[pc,#184] ; [0x133c] = 0x200001d8
        0x00001282:    4a2f        /J      LDR      r2,[pc,#188] ; [0x1340] = 0x2000019c
        0x00001284:    2800        .(      CMP      r0,#0
        0x00001286:    d133        3.      BNE      0x12f0 ; Fault_OverUnderVoltage + 132
        0x00001288:    4610        .F      MOV      r0,r2
        0x0000128a:    8840        @.      LDRH     r0,[r0,#2]
