747lulu747/SAOZHAN_BRUASH/src/SDK-LIB/华芯第一版本硬件-非FPC/ROMAN-21DD - SDK - V0.1/out/SWM211.asm
        0x0000128c:    42a9        .B      CMP      r1,r5
        0x0000128e:    d911        ..      BLS      0x12b4 ; Fault_OverUnderVoltage + 72
        0x00001290:    1c40        @.      ADDS     r0,r0,#1
        0x00001292:    b280        ..      UXTH     r0,r0
        0x00001294:    8050        P.      STRH     r0,[r2,#2]
        0x00001296:    2814        .(      CMP      r0,#0x14
        0x00001298:    d910        ..      BLS      0x12bc ; Fault_OverUnderVoltage + 80
        0x0000129a:    7ab0        .z      LDRB     r0,[r6,#0xa]
        0x0000129c:    1c40        @.      ADDS     r0,r0,#1
        0x0000129e:    72b0        .r      STRB     r0,[r6,#0xa]
        0x000012a0:    8054        T.      STRH     r4,[r2,#2]
        0x000012a2:    4d29        )M      LDR      r5,[pc,#164] ; [0x1348] = 0x40046400
        0x000012a4:    4827        'H      LDR      r0,[pc,#156] ; [0x1344] = 0xffff
        0x000012a6:    6068        h`      STR      r0,[r5,#4]
        0x000012a8:    4d28        (M      LDR      r5,[pc,#160] ; [0x134c] = 0x20000010
        0x000012aa:    200b        .       MOVS     r0,#0xb
        0x000012ac:    7028        (p      STRB     r0,[r5,#0]
        0x000012ae:    2004        .       MOVS     r0,#4
        0x000012b0:    7018        .p      STRB     r0,[r3,#0]
        0x000012b2:    e003        ..      B        0x12bc ; Fault_OverUnderVoltage + 80
        0x000012b4:    2800        .(      CMP      r0,#0
        0x000012b6:    d001        ..      BEQ      0x12bc ; Fault_OverUnderVoltage + 80
        0x000012b8:    1e40        @.      SUBS     r0,r0,#1
        0x000012ba:    8050        P.      STRH     r0,[r2,#2]
        0x000012bc:    4820         H      LDR      r0,[pc,#128] ; [0x1340] = 0x2000019c
        0x000012be:    42b9        .B      CMP      r1,r7
        0x000012c0:    8880        ..      LDRH     r0,[r0,#4]
        0x000012c2:    d211        ..      BCS      0x12e8 ; Fault_OverUnderVoltage + 124
        0x000012c4:    1c40        @.      ADDS     r0,r0,#1
        0x000012c6:    b280        ..      UXTH     r0,r0
        0x000012c8:    8090        ..      STRH     r0,[r2,#4]
        0x000012ca:    2832        2(      CMP      r0,#0x32
        0x000012cc:    d910        ..      BLS      0x12f0 ; Fault_OverUnderVoltage + 132
        0x000012ce:    7af0        .z      LDRB     r0,[r6,#0xb]
        0x000012d0:    1c40        @.      ADDS     r0,r0,#1
        0x000012d2:    72f0        .r      STRB     r0,[r6,#0xb]
        0x000012d4:    8094        ..      STRH     r4,[r2,#4]
        0x000012d6:    4d1c        .M      LDR      r5,[pc,#112] ; [0x1348] = 0x40046400
        0x000012d8:    481a        .H      LDR      r0,[pc,#104] ; [0x1344] = 0xffff
        0x000012da:    6068        h`      STR      r0,[r5,#4]
        0x000012dc:    4d1b        .M      LDR      r5,[pc,#108] ; [0x134c] = 0x20000010
        0x000012de:    200b        .       MOVS     r0,#0xb
        0x000012e0:    7028        (p      STRB     r0,[r5,#0]
        0x000012e2:    2003        .       MOVS     r0,#3
        0x000012e4:    7018        .p      STRB     r0,[r3,#0]
        0x000012e6:    e003        ..      B        0x12f0 ; Fault_OverUnderVoltage + 132
        0x000012e8:    2800        .(      CMP      r0,#0
        0x000012ea:    d001        ..      BEQ      0x12f0 ; Fault_OverUnderVoltage + 132
        0x000012ec:    1e40        @.      SUBS     r0,r0,#1
        0x000012ee:    8090        ..      STRH     r0,[r2,#4]
        0x000012f0:    4816        .H      LDR      r0,[pc,#88] ; [0x134c] = 0x20000010
        0x000012f2:    7800        .x      LDRB     r0,[r0,#0]
        0x000012f4:    280b        .(      CMP      r0,#0xb
        0x000012f6:    d114        ..      BNE      0x1322 ; Fault_OverUnderVoltage + 182
        0x000012f8:    7818        .x      LDRB     r0,[r3,#0]
        0x000012fa:    2804        .(      CMP      r0,#4
        0x000012fc:    d001        ..      BEQ      0x1302 ; Fault_OverUnderVoltage + 150
        0x000012fe:    2803        .(      CMP      r0,#3
        0x00001300:    d10f        ..      BNE      0x1322 ; Fault_OverUnderVoltage + 182
        0x00001302:    4813        .H      LDR      r0,[pc,#76] ; [0x1350] = 0xffffc6db
        0x00001304:    1808        ..      ADDS     r0,r1,r0
        0x00001306:    4913        .I      LDR      r1,[pc,#76] ; [0x1354] = 0x2248
        0x00001308:    4288        .B      CMP      r0,r1
        0x0000130a:    d20c        ..      BCS      0x1326 ; Fault_OverUnderVoltage + 186
        0x0000130c:    7af0        .z      LDRB     r0,[r6,#0xb]
        0x0000130e:    2805        .(      CMP      r0,#5
        0x00001310:    d809        ..      BHI      0x1326 ; Fault_OverUnderVoltage + 186
        0x00001312:    88d0        ..      LDRH     r0,[r2,#6]
        0x00001314:    1c40        @.      ADDS     r0,r0,#1
        0x00001316:    b280        ..      UXTH     r0,r0
        0x00001318:    80d0        ..      STRH     r0,[r2,#6]
        0x0000131a:    28c8        .(      CMP      r0,#0xc8
        0x0000131c:    d901        ..      BLS      0x1322 ; Fault_OverUnderVoltage + 182
        0x0000131e:    701c        .p      STRB     r4,[r3,#0]
        0x00001320:    80d4        ..      STRH     r4,[r2,#6]
        0x00001322:    bcf0        ..      POP      {r4-r7}
        0x00001324:    4770        pG      BX       lr
        0x00001326:    80d4        ..      STRH     r4,[r2,#6]
        0x00001328:    bcf0        ..      POP      {r4-r7}
        0x0000132a:    4770        pG      BX       lr
    $d
        0x0000132c:    00003554    T5..    DCD    13652
        0x00001330:    20000018    ...     DCD    536870936
        0x00001334:    000066da    .f..    DCD    26330
        0x00001338:    20000064    d..     DCD    536871012
        0x0000133c:    200001d8    ...     DCD    536871384
        0x00001340:    2000019c    ...     DCD    536871324
        0x00001344:    0000ffff    ....    DCD    65535
        0x00001348:    40046400    .d.@    DCD    1074029568
        0x0000134c:    20000010    ...     DCD    536870928
        0x00001350:    ffffc6db    ....    DCD    4294952667
        0x00001354:    00002248    H"..    DCD    8776
    $t
    i.Fault_Overcurrent
    Fault_Overcurrent
        0x00001358:    b410        ..      PUSH     {r4}
        0x0000135a:    4a32        2J      LDR      r2,[pc,#200] ; [0x1424] = 0x20000010
        0x0000135c:    7810        .x      LDRB     r0,[r2,#0]
        0x0000135e:    2807        .(      CMP      r0,#7
        0x00001360:    d001        ..      BEQ      0x1366 ; Fault_Overcurrent + 14
        0x00001362:    2806        .(      CMP      r0,#6
        0x00001364:    d155        U.      BNE      0x1412 ; Fault_Overcurrent + 186
        0x00001366:    4b30        0K      LDR      r3,[pc,#192] ; [0x1428] = 0x2000023a
        0x00001368:    2002        .       MOVS     r0,#2
        0x0000136a:    5e18        .^      LDRSH    r0,[r3,r0]
        0x0000136c:    2800        .(      CMP      r0,#0
        0x0000136e:    db02        ..      BLT      0x1376 ; Fault_Overcurrent + 30
        0x00001370:    2002        .       MOVS     r0,#2
        0x00001372:    5e18        .^      LDRSH    r0,[r3,r0]
        0x00001374:    e002        ..      B        0x137c ; Fault_Overcurrent + 36
        0x00001376:    2002        .       MOVS     r0,#2
        0x00001378:    5e18        .^      LDRSH    r0,[r3,r0]
        0x0000137a:    4240        @B      RSBS     r0,r0,#0
        0x0000137c:    84d8        ..      STRH     r0,[r3,#0x26]
        0x0000137e:    2004        .       MOVS     r0,#4
        0x00001380:    5e18        .^      LDRSH    r0,[r3,r0]
        0x00001382:    2800        .(      CMP      r0,#0
        0x00001384:    db02        ..      BLT      0x138c ; Fault_Overcurrent + 52
        0x00001386:    2004        .       MOVS     r0,#4
        0x00001388:    5e18        .^      LDRSH    r0,[r3,r0]
        0x0000138a:    e002        ..      B        0x1392 ; Fault_Overcurrent + 58
        0x0000138c:    2004        .       MOVS     r0,#4
        0x0000138e:    5e18        .^      LDRSH    r0,[r3,r0]
        0x00001390:    4240        @B      RSBS     r0,r0,#0
        0x00001392:    8518        ..      STRH     r0,[r3,#0x28]
        0x00001394:    2006        .       MOVS     r0,#6
        0x00001396:    5e18        .^      LDRSH    r0,[r3,r0]
        0x00001398:    2800        .(      CMP      r0,#0
        0x0000139a:    db02        ..      BLT      0x13a2 ; Fault_Overcurrent + 74
        0x0000139c:    2006        .       MOVS     r0,#6
        0x0000139e:    5e18        .^      LDRSH    r0,[r3,r0]
        0x000013a0:    e002        ..      B        0x13a8 ; Fault_Overcurrent + 80
        0x000013a2:    2006        .       MOVS     r0,#6
        0x000013a4:    5e18        .^      LDRSH    r0,[r3,r0]
        0x000013a6:    4240        @B      RSBS     r0,r0,#0
        0x000013a8:    8558        X.      STRH     r0,[r3,#0x2a]
        0x000013aa:    2026        &       MOVS     r0,#0x26
        0x000013ac:    5e18        .^      LDRSH    r0,[r3,r0]
        0x000013ae:    491f        .I      LDR      r1,[pc,#124] ; [0x142c] = 0x200001ca
        0x000013b0:    890c        ..      LDRH     r4,[r1,#8]
        0x000013b2:    42a0        .B      CMP      r0,r4
        0x000013b4:    dd01        ..      BLE      0x13ba ; Fault_Overcurrent + 98
        0x000013b6:    8cd8        ..      LDRH     r0,[r3,#0x26]
        0x000013b8:    8108        ..      STRH     r0,[r1,#8]
        0x000013ba:    2028        (       MOVS     r0,#0x28
        0x000013bc:    5e18        .^      LDRSH    r0,[r3,r0]
        0x000013be:    894c        L.      LDRH     r4,[r1,#0xa]
        0x000013c0:    42a0        .B      CMP      r0,r4
        0x000013c2:    dd01        ..      BLE      0x13c8 ; Fault_Overcurrent + 112
        0x000013c4:    8d18        ..      LDRH     r0,[r3,#0x28]
        0x000013c6:    8148        H.      STRH     r0,[r1,#0xa]
        0x000013c8:    202a        *       MOVS     r0,#0x2a
        0x000013ca:    5e18        .^      LDRSH    r0,[r3,r0]
        0x000013cc:    898c        ..      LDRH     r4,[r1,#0xc]
        0x000013ce:    42a0        .B      CMP      r0,r4
        0x000013d0:    dd01        ..      BLE      0x13d6 ; Fault_Overcurrent + 126
        0x000013d2:    8d58        X.      LDRH     r0,[r3,#0x2a]
        0x000013d4:    8188        ..      STRH     r0,[r1,#0xc]
        0x000013d6:    4815        .H      LDR      r0,[pc,#84] ; [0x142c] = 0x200001ca
        0x000013d8:    890c        ..      LDRH     r4,[r1,#8]
        0x000013da:    4b15        .K      LDR      r3,[pc,#84] ; [0x1430] = 0x5554
        0x000013dc:    7800        .x      LDRB     r0,[r0,#0]
        0x000013de:    429c        .B      CMP      r4,r3
        0x000013e0:    d205        ..      BCS      0x13ee ; Fault_Overcurrent + 150
        0x000013e2:    894c        L.      LDRH     r4,[r1,#0xa]
        0x000013e4:    429c        .B      CMP      r4,r3
        0x000013e6:    d202        ..      BCS      0x13ee ; Fault_Overcurrent + 150
        0x000013e8:    898c        ..      LDRH     r4,[r1,#0xc]
        0x000013ea:    429c        .B      CMP      r4,r3
        0x000013ec:    d313        ..      BCC      0x1416 ; Fault_Overcurrent + 190
        0x000013ee:    1c40        @.      ADDS     r0,r0,#1
        0x000013f0:    b2c0        ..      UXTB     r0,r0
        0x000013f2:    7008        .p      STRB     r0,[r1,#0]
        0x000013f4:    2803        .(      CMP      r0,#3
        0x000013f6:    d30c        ..      BCC      0x1412 ; Fault_Overcurrent + 186
        0x000013f8:    4b0f        .K      LDR      r3,[pc,#60] ; [0x1438] = 0x40046400
        0x000013fa:    480e        .H      LDR      r0,[pc,#56] ; [0x1434] = 0xffff
        0x000013fc:    6058        X`      STR      r0,[r3,#4]
        0x000013fe:    200b        .       MOVS     r0,#0xb
        0x00001400:    7010        .p      STRB     r0,[r2,#0]
        0x00001402:    4a0e        .J      LDR      r2,[pc,#56] ; [0x143c] = 0x20000018
        0x00001404:    2002        .       MOVS     r0,#2
        0x00001406:    7010        .p      STRB     r0,[r2,#0]
        0x00001408:    2000        .       MOVS     r0,#0
        0x0000140a:    8108        ..      STRH     r0,[r1,#8]
        0x0000140c:    8148        H.      STRH     r0,[r1,#0xa]
        0x0000140e:    8188        ..      STRH     r0,[r1,#0xc]
        0x00001410:    7008        .p      STRB     r0,[r1,#0]
        0x00001412:    bc10        ..      POP      {r4}
        0x00001414:    4770        pG      BX       lr
        0x00001416:    2800        .(      CMP      r0,#0
        0x00001418:    d0fb        ..      BEQ      0x1412 ; Fault_Overcurrent + 186
        0x0000141a:    1e40        @.      SUBS     r0,r0,#1
        0x0000141c:    7008        .p      STRB     r0,[r1,#0]
        0x0000141e:    bc10        ..      POP      {r4}
        0x00001420:    4770        pG      BX       lr
    $d
        0x00001422:    0000        ..      DCW    0
        0x00001424:    20000010    ...     DCD    536870928
        0x00001428:    2000023a    :..     DCD    536871482
        0x0000142c:    200001ca    ...     DCD    536871370
        0x00001430:    00005554    TU..    DCD    21844
        0x00001434:    0000ffff    ....    DCD    65535
        0x00001438:    40046400    .d.@    DCD    1074029568
        0x0000143c:    20000018    ...     DCD    536870936
    $t
    i.Fault_Stall
    Fault_Stall
        0x00001440:    b4f0        ..      PUSH     {r4-r7}
        0x00001442:    4a34        4J      LDR      r2,[pc,#208] ; [0x1514] = 0x20000010
        0x00001444:    2300        .#      MOVS     r3,#0
        0x00001446:    7810        .x      LDRB     r0,[r2,#0]
        0x00001448:    4e33        3N      LDR      r6,[pc,#204] ; [0x1518] = 0x200001d8
        0x0000144a:    4f34        4O      LDR      r7,[pc,#208] ; [0x151c] = 0x20000018
        0x0000144c:    4934        4I      LDR      r1,[pc,#208] ; [0x1520] = 0x2000019c
        0x0000144e:    2807        .(      CMP      r0,#7
        0x00001450:    d147        G.      BNE      0x14e2 ; Fault_Stall + 162
        0x00001452:    8948        H.      LDRH     r0,[r1,#0xa]
        0x00001454:    2419        .$      MOVS     r4,#0x19
        0x00001456:    0164        d.      LSLS     r4,r4,#5
        0x00001458:    42a0        .B      CMP      r0,r4
        0x0000145a:    d802        ..      BHI      0x1462 ; Fault_Stall + 34
        0x0000145c:    1c40        @.      ADDS     r0,r0,#1
        0x0000145e:    8148        H.      STRH     r0,[r1,#0xa]
        0x00001460:    e03f        ?.      B        0x14e2 ; Fault_Stall + 162
        0x00001462:    4830        0H      LDR      r0,[pc,#192] ; [0x1524] = 0x20000064
        0x00001464:    4d30        0M      LDR      r5,[pc,#192] ; [0x1528] = 0x74cd
        0x00001466:    8ac4        ..      LDRH     r4,[r0,#0x16]
        0x00001468:    482d        -H      LDR      r0,[pc,#180] ; [0x1520] = 0x2000019c
        0x0000146a:    3c64        d<      SUBS     r4,r4,#0x64
        0x0000146c:    8980        ..      LDRH     r0,[r0,#0xc]
        0x0000146e:    42ac        .B      CMP      r4,r5
        0x00001470:    d312        ..      BCC      0x1498 ; Fault_Stall + 88
        0x00001472:    1c40        @.      ADDS     r0,r0,#1
        0x00001474:    b280        ..      UXTH     r0,r0
        0x00001476:    8188        ..      STRH     r0,[r1,#0xc]
        0x00001478:    2805        .(      CMP      r0,#5
        0x0000147a:    d311        ..      BCC      0x14a0 ; Fault_Stall + 96
        0x0000147c:    818b        ..      STRH     r3,[r1,#0xc]
        0x0000147e:    4c2c        ,L      LDR      r4,[pc,#176] ; [0x1530] = 0x40046400
        0x00001480:    482a        *H      LDR      r0,[pc,#168] ; [0x152c] = 0xffff
        0x00001482:    6060        ``      STR      r0,[r4,#4]
        0x00001484:    200b        .       MOVS     r0,#0xb
        0x00001486:    7010        .p      STRB     r0,[r2,#0]
        0x00001488:    2006        .       MOVS     r0,#6
        0x0000148a:    7038        8p      STRB     r0,[r7,#0]
        0x0000148c:    8870        p.      LDRH     r0,[r6,#2]
        0x0000148e:    1c40        @.      ADDS     r0,r0,#1
        0x00001490:    8070        p.      STRH     r0,[r6,#2]
        0x00001492:    2001        .       MOVS     r0,#1
        0x00001494:    7270        pr      STRB     r0,[r6,#9]
        0x00001496:    e003        ..      B        0x14a0 ; Fault_Stall + 96
        0x00001498:    2800        .(      CMP      r0,#0
        0x0000149a:    d001        ..      BEQ      0x14a0 ; Fault_Stall + 96
        0x0000149c:    1e40        @.      SUBS     r0,r0,#1
        0x0000149e:    8188        ..      STRH     r0,[r1,#0xc]
        0x000014a0:    4820         H      LDR      r0,[pc,#128] ; [0x1524] = 0x20000064
        0x000014a2:    240c        .$      MOVS     r4,#0xc
        0x000014a4:    5f04        ._      LDRSH    r4,[r0,r4]
        0x000014a6:    4823        #H      LDR      r0,[pc,#140] ; [0x1534] = 0xfffffdde
        0x000014a8:    4d23        #M      LDR      r5,[pc,#140] ; [0x1538] = 0x2445
        0x000014aa:    1824        $.      ADDS     r4,r4,r0
        0x000014ac:    481c        .H      LDR      r0,[pc,#112] ; [0x1520] = 0x2000019c
        0x000014ae:    42ac        .B      CMP      r4,r5
        0x000014b0:    89c0        ..      LDRH     r0,[r0,#0xe]
        0x000014b2:    d312        ..      BCC      0x14da ; Fault_Stall + 154
        0x000014b4:    1c40        @.      ADDS     r0,r0,#1
        0x000014b6:    b280        ..      UXTH     r0,r0
        0x000014b8:    81c8        ..      STRH     r0,[r1,#0xe]
        0x000014ba:    2805        .(      CMP      r0,#5
        0x000014bc:    d311        ..      BCC      0x14e2 ; Fault_Stall + 162
        0x000014be:    81cb        ..      STRH     r3,[r1,#0xe]
        0x000014c0:    4c1b        .L      LDR      r4,[pc,#108] ; [0x1530] = 0x40046400
        0x000014c2:    481a        .H      LDR      r0,[pc,#104] ; [0x152c] = 0xffff
        0x000014c4:    6060        ``      STR      r0,[r4,#4]
        0x000014c6:    200b        .       MOVS     r0,#0xb
        0x000014c8:    7010        .p      STRB     r0,[r2,#0]
        0x000014ca:    2006        .       MOVS     r0,#6
        0x000014cc:    7038        8p      STRB     r0,[r7,#0]
        0x000014ce:    8870        p.      LDRH     r0,[r6,#2]
        0x000014d0:    1c40        @.      ADDS     r0,r0,#1
        0x000014d2:    8070        p.      STRH     r0,[r6,#2]
        0x000014d4:    2002        .       MOVS     r0,#2
        0x000014d6:    7270        pr      STRB     r0,[r6,#9]
        0x000014d8:    e003        ..      B        0x14e2 ; Fault_Stall + 162
        0x000014da:    2800        .(      CMP      r0,#0
        0x000014dc:    d001        ..      BEQ      0x14e2 ; Fault_Stall + 162
        0x000014de:    1e40        @.      SUBS     r0,r0,#1
        0x000014e0:    81c8        ..      STRH     r0,[r1,#0xe]
        0x000014e2:    7838        8x      LDRB     r0,[r7,#0]
        0x000014e4:    2806        .(      CMP      r0,#6
        0x000014e6:    d112        ..      BNE      0x150e ; Fault_Stall + 206
        0x000014e8:    7810        .x      LDRB     r0,[r2,#0]
        0x000014ea:    280b        .(      CMP      r0,#0xb
        0x000014ec:    d10f        ..      BNE      0x150e ; Fault_Stall + 206
        0x000014ee:    8870        p.      LDRH     r0,[r6,#2]
        0x000014f0:    2805        .(      CMP      r0,#5
        0x000014f2:    d80c        ..      BHI      0x150e ; Fault_Stall + 206
        0x000014f4:    8a48        H.      LDRH     r0,[r1,#0x12]
        0x000014f6:    1c40        @.      ADDS     r0,r0,#1
        0x000014f8:    b280        ..      UXTH     r0,r0
        0x000014fa:    8248        H.      STRH     r0,[r1,#0x12]
        0x000014fc:    227d        }"      MOVS     r2,#0x7d
        0x000014fe:    00d2        ..      LSLS     r2,r2,#3
        0x00001500:    4290        .B      CMP      r0,r2
        0x00001502:    d302        ..      BCC      0x150a ; Fault_Stall + 202
        0x00001504:    0110        ..      LSLS     r0,r2,#4
        0x00001506:    8248        H.      STRH     r0,[r1,#0x12]
        0x00001508:    703b        ;p      STRB     r3,[r7,#0]
        0x0000150a:    bcf0        ..      POP      {r4-r7}
        0x0000150c:    4770        pG      BX       lr
        0x0000150e:    824b        K.      STRH     r3,[r1,#0x12]
        0x00001510:    bcf0        ..      POP      {r4-r7}
        0x00001512:    4770        pG      BX       lr
    $d
        0x00001514:    20000010    ...     DCD    536870928
        0x00001518:    200001d8    ...     DCD    536871384
        0x0000151c:    20000018    ...     DCD    536870936
        0x00001520:    2000019c    ...     DCD    536871324
        0x00001524:    20000064    d..     DCD    536871012
        0x00001528:    000074cd    .t..    DCD    29901
        0x0000152c:    0000ffff    ....    DCD    65535
        0x00001530:    40046400    .d.@    DCD    1074029568
        0x00001534:    fffffdde    ....    DCD    4294966750
        0x00001538:    00002445    E$..    DCD    9285
    $t
    i.Fault_phaseloss
    Fault_phaseloss
        0x0000153c:    b4f0        ..      PUSH     {r4-r7}
        0x0000153e:    4852        RH      LDR      r0,[pc,#328] ; [0x1688] = 0x20000010
        0x00001540:    4b52        RK      LDR      r3,[pc,#328] ; [0x168c] = 0x2000019c
        0x00001542:    7800        .x      LDRB     r0,[r0,#0]
        0x00001544:    2807        .(      CMP      r0,#7
        0x00001546:    d17d        }.      BNE      0x1644 ; Fault_phaseloss + 264
        0x00001548:    8ad8        ..      LDRH     r0,[r3,#0x16]
        0x0000154a:    1c40        @.      ADDS     r0,r0,#1
        0x0000154c:    b280        ..      UXTH     r0,r0
        0x0000154e:    82d8        ..      STRH     r0,[r3,#0x16]
        0x00001550:    2814        .(      CMP      r0,#0x14
        0x00001552:    d97a        z.      BLS      0x164a ; Fault_phaseloss + 270
        0x00001554:    2000        .       MOVS     r0,#0
        0x00001556:    82d8        ..      STRH     r0,[r3,#0x16]
        0x00001558:    494d        MI      LDR      r1,[pc,#308] ; [0x1690] = 0x200001ca
        0x0000155a:    4a4d        MJ      LDR      r2,[pc,#308] ; [0x1690] = 0x200001ca
        0x0000155c:    8908        ..      LDRH     r0,[r1,#8]
        0x0000155e:    8949        I.      LDRH     r1,[r1,#0xa]
        0x00001560:    8992        ..      LDRH     r2,[r2,#0xc]
        0x00001562:    461c        .F      MOV      r4,r3
        0x00001564:    004f        O.      LSLS     r7,r1,#1
        0x00001566:    0055        U.      LSLS     r5,r2,#1
        0x00001568:    8b24        $.      LDRH     r4,[r4,#0x18]
        0x0000156a:    42b8        .B      CMP      r0,r7
        0x0000156c:    d801        ..      BHI      0x1572 ; Fault_phaseloss + 54
        0x0000156e:    42a8        .B      CMP      r0,r5
        0x00001570:    d906        ..      BLS      0x1580 ; Fault_phaseloss + 68
        0x00001572:    26ff        .&      MOVS     r6,#0xff
        0x00001574:    3612        .6      ADDS     r6,r6,#0x12
        0x00001576:    42b0        .B      CMP      r0,r6
        0x00001578:    d902        ..      BLS      0x1580 ; Fault_phaseloss + 68
        0x0000157a:    1c64        d.      ADDS     r4,r4,#1
        0x0000157c:    831c        ..      STRH     r4,[r3,#0x18]
        0x0000157e:    e003        ..      B        0x1588 ; Fault_phaseloss + 76
        0x00001580:    2c00        .,      CMP      r4,#0
        0x00001582:    d001        ..      BEQ      0x1588 ; Fault_phaseloss + 76
        0x00001584:    1e64        d.      SUBS     r4,r4,#1
        0x00001586:    831c        ..      STRH     r4,[r3,#0x18]
