747lulu747/SAOZHAN_BRUASH/src/SDK-LIB/华芯第一版本硬件-非FPC/ROMAN-21DD - SDK - V0.1/out/SWM211.asm
        0x00001588:    4c40        @L      LDR      r4,[pc,#256] ; [0x168c] = 0x2000019c
        0x0000158a:    0046        F.      LSLS     r6,r0,#1
        0x0000158c:    8b64        d.      LDRH     r4,[r4,#0x1a]
        0x0000158e:    42b1        .B      CMP      r1,r6
        0x00001590:    d801        ..      BHI      0x1596 ; Fault_phaseloss + 90
        0x00001592:    42a9        .B      CMP      r1,r5
        0x00001594:    d906        ..      BLS      0x15a4 ; Fault_phaseloss + 104
        0x00001596:    25ff        .%      MOVS     r5,#0xff
        0x00001598:    3512        .5      ADDS     r5,r5,#0x12
        0x0000159a:    42a9        .B      CMP      r1,r5
        0x0000159c:    d902        ..      BLS      0x15a4 ; Fault_phaseloss + 104
        0x0000159e:    1c64        d.      ADDS     r4,r4,#1
        0x000015a0:    835c        \.      STRH     r4,[r3,#0x1a]
        0x000015a2:    e003        ..      B        0x15ac ; Fault_phaseloss + 112
        0x000015a4:    2c00        .,      CMP      r4,#0
        0x000015a6:    d001        ..      BEQ      0x15ac ; Fault_phaseloss + 112
        0x000015a8:    1e64        d.      SUBS     r4,r4,#1
        0x000015aa:    835c        \.      STRH     r4,[r3,#0x1a]
        0x000015ac:    4c37        7L      LDR      r4,[pc,#220] ; [0x168c] = 0x2000019c
        0x000015ae:    42b2        .B      CMP      r2,r6
        0x000015b0:    8ba4        ..      LDRH     r4,[r4,#0x1c]
        0x000015b2:    d801        ..      BHI      0x15b8 ; Fault_phaseloss + 124
        0x000015b4:    42ba        .B      CMP      r2,r7
        0x000015b6:    d906        ..      BLS      0x15c6 ; Fault_phaseloss + 138
        0x000015b8:    26ff        .&      MOVS     r6,#0xff
        0x000015ba:    3612        .6      ADDS     r6,r6,#0x12
        0x000015bc:    42b2        .B      CMP      r2,r6
        0x000015be:    d902        ..      BLS      0x15c6 ; Fault_phaseloss + 138
        0x000015c0:    1c64        d.      ADDS     r4,r4,#1
        0x000015c2:    839c        ..      STRH     r4,[r3,#0x1c]
        0x000015c4:    e003        ..      B        0x15ce ; Fault_phaseloss + 146
        0x000015c6:    2c00        .,      CMP      r4,#0
        0x000015c8:    d001        ..      BEQ      0x15ce ; Fault_phaseloss + 146
        0x000015ca:    1e64        d.      SUBS     r4,r4,#1
        0x000015cc:    839c        ..      STRH     r4,[r3,#0x1c]
        0x000015ce:    4c31        1L      LDR      r4,[pc,#196] ; [0x1694] = 0xffff
        0x000015d0:    4d31        1M      LDR      r5,[pc,#196] ; [0x1698] = 0x40046400
        0x000015d2:    260b        .&      MOVS     r6,#0xb
        0x000015d4:    2705        .'      MOVS     r7,#5
        0x000015d6:    28c8        .(      CMP      r0,#0xc8
        0x000015d8:    d21c        ..      BCS      0x1614 ; Fault_phaseloss + 216
        0x000015da:    29c8        .)      CMP      r1,#0xc8
        0x000015dc:    d21a        ..      BCS      0x1614 ; Fault_phaseloss + 216
        0x000015de:    2ac8        .*      CMP      r2,#0xc8
        0x000015e0:    d218        ..      BCS      0x1614 ; Fault_phaseloss + 216
        0x000015e2:    492e        .I      LDR      r1,[pc,#184] ; [0x169c] = 0x20000064
        0x000015e4:    201a        .       MOVS     r0,#0x1a
        0x000015e6:    5e08        .^      LDRSH    r0,[r1,r0]
        0x000015e8:    492d        -I      LDR      r1,[pc,#180] ; [0x16a0] = 0x73a1
        0x000015ea:    38ff        .8      SUBS     r0,r0,#0xff
        0x000015ec:    3891        .8      SUBS     r0,r0,#0x91
        0x000015ee:    4288        .B      CMP      r0,r1
        0x000015f0:    d310        ..      BCC      0x1614 ; Fault_phaseloss + 216
        0x000015f2:    8bd8        ..      LDRH     r0,[r3,#0x1e]
        0x000015f4:    1c41        A.      ADDS     r1,r0,#1
        0x000015f6:    83d9        ..      STRH     r1,[r3,#0x1e]
        0x000015f8:    2864        d(      CMP      r0,#0x64
        0x000015fa:    d90d        ..      BLS      0x1618 ; Fault_phaseloss + 220
        0x000015fc:    2000        .       MOVS     r0,#0
        0x000015fe:    83d8        ..      STRH     r0,[r3,#0x1e]
        0x00001600:    4928        (I      LDR      r1,[pc,#160] ; [0x16a4] = 0x200001d8
        0x00001602:    8888        ..      LDRH     r0,[r1,#4]
        0x00001604:    1c40        @.      ADDS     r0,r0,#1
        0x00001606:    8088        ..      STRH     r0,[r1,#4]
        0x00001608:    606c        l`      STR      r4,[r5,#4]
        0x0000160a:    481f        .H      LDR      r0,[pc,#124] ; [0x1688] = 0x20000010
        0x0000160c:    7006        .p      STRB     r6,[r0,#0]
        0x0000160e:    4826        &H      LDR      r0,[pc,#152] ; [0x16a8] = 0x20000018
        0x00001610:    7007        .p      STRB     r7,[r0,#0]
        0x00001612:    e001        ..      B        0x1618 ; Fault_phaseloss + 220
        0x00001614:    2000        .       MOVS     r0,#0
        0x00001616:    83d8        ..      STRH     r0,[r3,#0x1e]
        0x00001618:    491d        .I      LDR      r1,[pc,#116] ; [0x1690] = 0x200001ca
        0x0000161a:    2000        .       MOVS     r0,#0
        0x0000161c:    8108        ..      STRH     r0,[r1,#8]
        0x0000161e:    8148        H.      STRH     r0,[r1,#0xa]
        0x00001620:    8188        ..      STRH     r0,[r1,#0xc]
        0x00001622:    8b18        ..      LDRH     r0,[r3,#0x18]
        0x00001624:    2802        .(      CMP      r0,#2
        0x00001626:    d805        ..      BHI      0x1634 ; Fault_phaseloss + 248
        0x00001628:    8b58        X.      LDRH     r0,[r3,#0x1a]
        0x0000162a:    2802        .(      CMP      r0,#2
        0x0000162c:    d802        ..      BHI      0x1634 ; Fault_phaseloss + 248
        0x0000162e:    8b98        ..      LDRH     r0,[r3,#0x1c]
        0x00001630:    2802        .(      CMP      r0,#2
        0x00001632:    d90a        ..      BLS      0x164a ; Fault_phaseloss + 270
        0x00001634:    481b        .H      LDR      r0,[pc,#108] ; [0x16a4] = 0x200001d8
        0x00001636:    8881        ..      LDRH     r1,[r0,#4]
        0x00001638:    1c49        I.      ADDS     r1,r1,#1
        0x0000163a:    8081        ..      STRH     r1,[r0,#4]
        0x0000163c:    606c        l`      STR      r4,[r5,#4]
        0x0000163e:    4812        .H      LDR      r0,[pc,#72] ; [0x1688] = 0x20000010
        0x00001640:    7006        .p      STRB     r6,[r0,#0]
        0x00001642:    e000        ..      B        0x1646 ; Fault_phaseloss + 266
        0x00001644:    e001        ..      B        0x164a ; Fault_phaseloss + 270
        0x00001646:    4818        .H      LDR      r0,[pc,#96] ; [0x16a8] = 0x20000018
        0x00001648:    7007        .p      STRB     r7,[r0,#0]
        0x0000164a:    4917        .I      LDR      r1,[pc,#92] ; [0x16a8] = 0x20000018
        0x0000164c:    7808        .x      LDRB     r0,[r1,#0]
        0x0000164e:    2805        .(      CMP      r0,#5
        0x00001650:    d116        ..      BNE      0x1680 ; Fault_phaseloss + 324
        0x00001652:    480d        .H      LDR      r0,[pc,#52] ; [0x1688] = 0x20000010
        0x00001654:    7800        .x      LDRB     r0,[r0,#0]
        0x00001656:    280b        .(      CMP      r0,#0xb
        0x00001658:    d112        ..      BNE      0x1680 ; Fault_phaseloss + 324
        0x0000165a:    4812        .H      LDR      r0,[pc,#72] ; [0x16a4] = 0x200001d8
        0x0000165c:    8880        ..      LDRH     r0,[r0,#4]
        0x0000165e:    2805        .(      CMP      r0,#5
        0x00001660:    d80e        ..      BHI      0x1680 ; Fault_phaseloss + 324
        0x00001662:    8c18        ..      LDRH     r0,[r3,#0x20]
        0x00001664:    1c40        @.      ADDS     r0,r0,#1
        0x00001666:    b280        ..      UXTH     r0,r0
        0x00001668:    8418        ..      STRH     r0,[r3,#0x20]
        0x0000166a:    22ff        ."      MOVS     r2,#0xff
        0x0000166c:    3291        .2      ADDS     r2,r2,#0x91
        0x0000166e:    4290        .B      CMP      r0,r2
        0x00001670:    d304        ..      BCC      0x167c ; Fault_phaseloss + 320
        0x00001672:    2000        .       MOVS     r0,#0
        0x00001674:    8318        ..      STRH     r0,[r3,#0x18]
        0x00001676:    8358        X.      STRH     r0,[r3,#0x1a]
        0x00001678:    8398        ..      STRH     r0,[r3,#0x1c]
        0x0000167a:    7008        .p      STRB     r0,[r1,#0]
        0x0000167c:    bcf0        ..      POP      {r4-r7}
        0x0000167e:    4770        pG      BX       lr
        0x00001680:    2000        .       MOVS     r0,#0
        0x00001682:    8418        ..      STRH     r0,[r3,#0x20]
        0x00001684:    bcf0        ..      POP      {r4-r7}
        0x00001686:    4770        pG      BX       lr
    $d
        0x00001688:    20000010    ...     DCD    536870928
        0x0000168c:    2000019c    ...     DCD    536871324
        0x00001690:    200001ca    ...     DCD    536871370
        0x00001694:    0000ffff    ....    DCD    65535
        0x00001698:    40046400    .d.@    DCD    1074029568
        0x0000169c:    20000064    d..     DCD    536871012
        0x000016a0:    000073a1    .s..    DCD    29601
        0x000016a4:    200001d8    ...     DCD    536871384
        0x000016a8:    20000018    ...     DCD    536870936
    $t
    i.Flash_Param_at_xMHz
    Flash_Param_at_xMHz
        0x000016ac:    b510        ..      PUSH     {r4,lr}
        0x000016ae:    b672        r.      CPSID    i
        0x000016b0:    4b08        .K      LDR      r3,[pc,#32] ; [0x16d4] = 0x89241
        0x000016b2:    4a0a        .J      LDR      r2,[pc,#40] ; [0x16dc] = 0x20000050
        0x000016b4:    4908        .I      LDR      r1,[pc,#32] ; [0x16d8] = 0xb11ffac
        0x000016b6:    6812        .h      LDR      r2,[r2,#0]
        0x000016b8:    2821        !(      CMP      r0,#0x21
        0x000016ba:    d202        ..      BCS      0x16c2 ; Flash_Param_at_xMHz + 22
        0x000016bc:    4618        .F      MOV      r0,r3
        0x000016be:    4790        .G      BLX      r2
        0x000016c0:    e006        ..      B        0x16d0 ; Flash_Param_at_xMHz + 36
        0x000016c2:    2842        B(      CMP      r0,#0x42
        0x000016c4:    d202        ..      BCS      0x16cc ; Flash_Param_at_xMHz + 32
        0x000016c6:    4618        .F      MOV      r0,r3
        0x000016c8:    4790        .G      BLX      r2
        0x000016ca:    e001        ..      B        0x16d0 ; Flash_Param_at_xMHz + 36
        0x000016cc:    4804        .H      LDR      r0,[pc,#16] ; [0x16e0] = 0x8a241
        0x000016ce:    4790        .G      BLX      r2
        0x000016d0:    b662        b.      CPSIE    i
        0x000016d2:    bd10        ..      POP      {r4,pc}
    $d
        0x000016d4:    00089241    A...    DCD    561729
        0x000016d8:    0b11ffac    ....    DCD    185728940
        0x000016dc:    20000050    P..     DCD    536870992
        0x000016e0:    0008a241    A...    DCD    565825
    $t
    i.GPIO_Init
    GPIO_Init
        0x000016e4:    b5ff        ..      PUSH     {r0-r7,lr}
        0x000016e6:    b081        ..      SUB      sp,sp,#4
        0x000016e8:    9f0b        ..      LDR      r7,[sp,#0x2c]
        0x000016ea:    9e0a        ..      LDR      r6,[sp,#0x28]
        0x000016ec:    4605        .F      MOV      r5,r0
        0x000016ee:    4c2e        .L      LDR      r4,[pc,#184] ; [0x17a8] = 0x400a0000
        0x000016f0:    482e        .H      LDR      r0,[pc,#184] ; [0x17ac] = 0xbfffc000
        0x000016f2:    0361        a.      LSLS     r1,r4,#13
        0x000016f4:    1828        (.      ADDS     r0,r5,r0
        0x000016f6:    2201        ."      MOVS     r2,#1
        0x000016f8:    2800        .(      CMP      r0,#0
        0x000016fa:    d010        ..      BEQ      0x171e ; GPIO_Init + 58
        0x000016fc:    14cb        ..      ASRS     r3,r1,#19
        0x000016fe:    1ac0        ..      SUBS     r0,r0,r3
        0x00001700:    d009        ..      BEQ      0x1716 ; GPIO_Init + 50
        0x00001702:    220f        ."      MOVS     r2,#0xf
        0x00001704:    0392        ..      LSLS     r2,r2,#14
        0x00001706:    4290        .B      CMP      r0,r2
        0x00001708:    d10e        ..      BNE      0x1728 ; GPIO_Init + 68
        0x0000170a:    6888        .h      LDR      r0,[r1,#8]
        0x0000170c:    2202        ."      MOVS     r2,#2
        0x0000170e:    4310        .C      ORRS     r0,r0,r2
        0x00001710:    6088        .`      STR      r0,[r1,#8]
        0x00001712:    4c27        'L      LDR      r4,[pc,#156] ; [0x17b0] = 0x400a0010
        0x00001714:    e008        ..      B        0x1728 ; GPIO_Init + 68
        0x00001716:    6888        .h      LDR      r0,[r1,#8]
        0x00001718:    4310        .C      ORRS     r0,r0,r2
        0x0000171a:    6088        .`      STR      r0,[r1,#8]
        0x0000171c:    e004        ..      B        0x1728 ; GPIO_Init + 68
        0x0000171e:    6888        .h      LDR      r0,[r1,#8]
        0x00001720:    2210        ."      MOVS     r2,#0x10
        0x00001722:    4310        .C      ORRS     r0,r0,r2
        0x00001724:    6088        .`      STR      r0,[r1,#8]
        0x00001726:    4c23        #L      LDR      r4,[pc,#140] ; [0x17b4] = 0x400a0080
        0x00001728:    2301        .#      MOVS     r3,#1
        0x0000172a:    2200        ."      MOVS     r2,#0
        0x0000172c:    4620         F      MOV      r0,r4
        0x0000172e:    9902        ..      LDR      r1,[sp,#8]
        0x00001730:    f000ff4c    ..L.    BL       PORT_Init ; 0x25cc
        0x00001734:    9a02        ..      LDR      r2,[sp,#8]
        0x00001736:    2001        .       MOVS     r0,#1
        0x00001738:    9903        ..      LDR      r1,[sp,#0xc]
        0x0000173a:    4090        .@      LSLS     r0,r0,r2
        0x0000173c:    2901        .)      CMP      r1,#1
        0x0000173e:    d01c        ..      BEQ      0x177a ; GPIO_Init + 150
        0x00001740:    6869        ih      LDR      r1,[r5,#4]
        0x00001742:    4381        .C      BICS     r1,r1,r0
        0x00001744:    6069        i`      STR      r1,[r5,#4]
        0x00001746:    9904        ..      LDR      r1,[sp,#0x10]
        0x00001748:    2901        .)      CMP      r1,#1
        0x0000174a:    d01a        ..      BEQ      0x1782 ; GPIO_Init + 158
        0x0000174c:    1de1        ..      ADDS     r1,r4,#7
        0x0000174e:    31f9        .1      ADDS     r1,r1,#0xf9
        0x00001750:    680a        .h      LDR      r2,[r1,#0]
        0x00001752:    4382        .C      BICS     r2,r2,r0
        0x00001754:    600a        .`      STR      r2,[r1,#0]
        0x00001756:    2e01        ..      CMP      r6,#1
        0x00001758:    d019        ..      BEQ      0x178e ; GPIO_Init + 170
        0x0000175a:    1de1        ..      ADDS     r1,r4,#7
        0x0000175c:    31ff        .1      ADDS     r1,r1,#0xff
        0x0000175e:    31fa        .1      ADDS     r1,r1,#0xfa
        0x00001760:    680a        .h      LDR      r2,[r1,#0]
        0x00001762:    4302        .C      ORRS     r2,r2,r0
        0x00001764:    600a        .`      STR      r2,[r1,#0]
        0x00001766:    2101        .!      MOVS     r1,#1
        0x00001768:    0289        ..      LSLS     r1,r1,#10
        0x0000176a:    2f01        ./      CMP      r7,#1
        0x0000176c:    d016        ..      BEQ      0x179c ; GPIO_Init + 184
        0x0000176e:    1861        a.      ADDS     r1,r4,r1
        0x00001770:    680a        .h      LDR      r2,[r1,#0]
        0x00001772:    4382        .C      BICS     r2,r2,r0
        0x00001774:    600a        .`      STR      r2,[r1,#0]
        0x00001776:    b005        ..      ADD      sp,sp,#0x14
        0x00001778:    bdf0        ..      POP      {r4-r7,pc}
        0x0000177a:    6869        ih      LDR      r1,[r5,#4]
        0x0000177c:    4301        .C      ORRS     r1,r1,r0
        0x0000177e:    6069        i`      STR      r1,[r5,#4]
        0x00001780:    e7e1        ..      B        0x1746 ; GPIO_Init + 98
        0x00001782:    1de1        ..      ADDS     r1,r4,#7
        0x00001784:    31f9        .1      ADDS     r1,r1,#0xf9
        0x00001786:    680a        .h      LDR      r2,[r1,#0]
        0x00001788:    4302        .C      ORRS     r2,r2,r0
        0x0000178a:    600a        .`      STR      r2,[r1,#0]
        0x0000178c:    e7e3        ..      B        0x1756 ; GPIO_Init + 114
        0x0000178e:    1de1        ..      ADDS     r1,r4,#7
        0x00001790:    31ff        .1      ADDS     r1,r1,#0xff
        0x00001792:    31fa        .1      ADDS     r1,r1,#0xfa
        0x00001794:    680a        .h      LDR      r2,[r1,#0]
        0x00001796:    4382        .C      BICS     r2,r2,r0
        0x00001798:    600a        .`      STR      r2,[r1,#0]
        0x0000179a:    e7e4        ..      B        0x1766 ; GPIO_Init + 130
        0x0000179c:    1861        a.      ADDS     r1,r4,r1
        0x0000179e:    680a        .h      LDR      r2,[r1,#0]
        0x000017a0:    4302        .C      ORRS     r2,r2,r0
        0x000017a2:    600a        .`      STR      r2,[r1,#0]
        0x000017a4:    b005        ..      ADD      sp,sp,#0x14
        0x000017a6:    bdf0        ..      POP      {r4-r7,pc}
    $d
        0x000017a8:    400a0000    ...@    DCD    1074397184
        0x000017ac:    bfffc000    ....    DCD    3221209088
        0x000017b0:    400a0010    ...@    DCD    1074397200
        0x000017b4:    400a0080    ...@    DCD    1074397312
    $t
    i.GPIO_InvBit
    GPIO_InvBit
        0x000017b8:    6802        .h      LDR      r2,[r0,#0]
        0x000017ba:    2301        .#      MOVS     r3,#1
        0x000017bc:    408b        .@      LSLS     r3,r3,r1
        0x000017be:    405a        Z@      EORS     r2,r2,r3
        0x000017c0:    6002        .`      STR      r2,[r0,#0]
        0x000017c2:    4770        pG      BX       lr
    i.GetCurrentOffset
    GetCurrentOffset
        0x000017c4:    b510        ..      PUSH     {r4,lr}
        0x000017c6:    4a1f        .J      LDR      r2,[pc,#124] ; [0x1844] = 0x20000180
        0x000017c8:    7890        .x      LDRB     r0,[r2,#2]
        0x000017ca:    2800        .(      CMP      r0,#0
        0x000017cc:    d139        9.      BNE      0x1842 ; GetCurrentOffset + 126
        0x000017ce:    4b1e        .K      LDR      r3,[pc,#120] ; [0x1848] = 0x20000160
        0x000017d0:    491e        .I      LDR      r1,[pc,#120] ; [0x184c] = 0x40049000
        0x000017d2:    69d8        .i      LDR      r0,[r3,#0x1c]
        0x000017d4:    6b49        Ik      LDR      r1,[r1,#0x34]
        0x000017d6:    0509        ..      LSLS     r1,r1,#20
        0x000017d8:    0c49        I.      LSRS     r1,r1,#17
        0x000017da:    1841        A.      ADDS     r1,r0,r1
        0x000017dc:    1108        ..      ASRS     r0,r1,#4
        0x000017de:    b200        ..      SXTH     r0,r0
        0x000017e0:    8318        ..      STRH     r0,[r3,#0x18]
        0x000017e2:    1a09        ..      SUBS     r1,r1,r0
        0x000017e4:    61d9        .a      STR      r1,[r3,#0x1c]
        0x000017e6:    8c19        ..      LDRH     r1,[r3,#0x20]
        0x000017e8:    1c49        I.      ADDS     r1,r1,#1
        0x000017ea:    b209        ..      SXTH     r1,r1
        0x000017ec:    8419        ..      STRH     r1,[r3,#0x20]
        0x000017ee:    237d        }#      MOVS     r3,#0x7d
        0x000017f0:    015b        [.      LSLS     r3,r3,#5
        0x000017f2:    4299        .B      CMP      r1,r3
        0x000017f4:    dd0c        ..      BLE      0x1810 ; GetCurrentOffset + 76
        0x000017f6:    2101        .!      MOVS     r1,#1
        0x000017f8:    7091        .p      STRB     r1,[r2,#2]
        0x000017fa:    4915        .I      LDR      r1,[pc,#84] ; [0x1850] = 0xffffcd38
        0x000017fc:    4a15        .J      LDR      r2,[pc,#84] ; [0x1854] = 0x2ee1
        0x000017fe:    1841        A.      ADDS     r1,r0,r1
        0x00001800:    4291        .B      CMP      r1,r2
        0x00001802:    d305        ..      BCC      0x1810 ; GetCurrentOffset + 76
        0x00001804:    4a14        .J      LDR      r2,[pc,#80] ; [0x1858] = 0x20000010
        0x00001806:    210b        .!      MOVS     r1,#0xb
        0x00001808:    7011        .p      STRB     r1,[r2,#0]
        0x0000180a:    4a14        .J      LDR      r2,[pc,#80] ; [0x185c] = 0x20000018
        0x0000180c:    210a        .!      MOVS     r1,#0xa
        0x0000180e:    7011        .p      STRB     r1,[r2,#0]
        0x00001810:    21b6        .!      MOVS     r1,#0xb6
        0x00001812:    f7fefca5    ....    BL       __aeabi_idiv ; 0x160
        0x00001816:    303c        <0      ADDS     r0,r0,#0x3c
        0x00001818:    4911        .I      LDR      r1,[pc,#68] ; [0x1860] = 0x20000000
        0x0000181a:    b200        ..      SXTH     r0,r0
        0x0000181c:    8008        ..      STRH     r0,[r1,#0]
        0x0000181e:    28fa        .(      CMP      r0,#0xfa
        0x00001820:    dd01        ..      BLE      0x1826 ; GetCurrentOffset + 98
        0x00001822:    20fa        .       MOVS     r0,#0xfa
        0x00001824:    8008        ..      STRH     r0,[r1,#0]
        0x00001826:    4a0f        .J      LDR      r2,[pc,#60] ; [0x1864] = 0x2000003c
        0x00001828:    2300        .#      MOVS     r3,#0
        0x0000182a:    2000        .       MOVS     r0,#0
        0x0000182c:    5ecb        .^      LDRSH    r3,[r1,r3]
        0x0000182e:    5e10        .^      LDRSH    r0,[r2,r0]
        0x00001830:    4283        .B      CMP      r3,r0
        0x00001832:    da00        ..      BGE      0x1836 ; GetCurrentOffset + 114
        0x00001834:    8008        ..      STRH     r0,[r1,#0]
        0x00001836:    8809        ..      LDRH     r1,[r1,#0]
        0x00001838:    1808        ..      ADDS     r0,r1,r0
        0x0000183a:    0400        ..      LSLS     r0,r0,#16
        0x0000183c:    490a        .I      LDR      r1,[pc,#40] ; [0x1868] = 0x400aa080
        0x0000183e:    1c40        @.      ADDS     r0,r0,#1
        0x00001840:    6108        .a      STR      r0,[r1,#0x10]
        0x00001842:    bd10        ..      POP      {r4,pc}
    $d
        0x00001844:    20000180    ...     DCD    536871296
        0x00001848:    20000160    `..     DCD    536871264
        0x0000184c:    40049000    ...@    DCD    1074040832
        0x00001850:    ffffcd38    8...    DCD    4294954296
        0x00001854:    00002ee1    ....    DCD    12001
        0x00001858:    20000010    ...     DCD    536870928
        0x0000185c:    20000018    ...     DCD    536870936
        0x00001860:    20000000    ...     DCD    536870912
        0x00001864:    2000003c    <..     DCD    536870972
        0x00001868:    400aa080    ...@    DCD    1074438272
    $t
    i.HardwareInit
    HardwareInit
        0x0000186c:    b510        ..      PUSH     {r4,lr}
        0x0000186e:    f000fa95    ....    BL       Init_PWM_Drive ; 0x1d9c
        0x00001872:    f000fa6d    ..m.    BL       Init_GPIO ; 0x1d50
        0x00001876:    4813        .H      LDR      r0,[pc,#76] ; [0x18c4] = 0x40003800
        0x00001878:    f7fffc24    ..$.    BL       DIV_Init ; 0x10c4
        0x0000187c:    4812        .H      LDR      r0,[pc,#72] ; [0x18c8] = 0x40003000
        0x0000187e:    f7fffc05    ....    BL       CORDIC_Init ; 0x108c
        0x00001882:    f000fa03    ....    BL       Init_ADC ; 0x1c8c
        0x00001886:    f000fae5    ....    BL       Init_Timer ; 0x1e54
        0x0000188a:    f000fa63    ..c.    BL       Init_OPA ; 0x1d54
        0x0000188e:    f7fffc25    ..%.    BL       FGOutput_Timer ; 0x10dc
        0x00001892:    480e        .H      LDR      r0,[pc,#56] ; [0x18cc] = 0x2000005c
        0x00001894:    217d        }!      MOVS     r1,#0x7d
