747lulu747/SAOZHAN_BRUASH/src/SDK-LIB/华芯第一版本硬件-非FPC/ROMAN-21DD - SDK - V0.1/out/SWM211.asm
        0x00001896:    00c9        ..      LSLS     r1,r1,#3
        0x00001898:    6800        .h      LDR      r0,[r0,#0]
        0x0000189a:    f7fefc4b    ..K.    BL       __aeabi_uidiv ; 0x134
        0x0000189e:    490c        .I      LDR      r1,[pc,#48] ; [0x18d0] = 0xffffff
        0x000018a0:    1e40        @.      SUBS     r0,r0,#1
        0x000018a2:    4288        .B      CMP      r0,r1
        0x000018a4:    d80c        ..      BHI      0x18c0 ; HardwareInit + 84
        0x000018a6:    490b        .I      LDR      r1,[pc,#44] ; [0x18d4] = 0xe000e000
        0x000018a8:    6148        Ha      STR      r0,[r1,#0x14]
        0x000018aa:    480b        .H      LDR      r0,[pc,#44] ; [0x18d8] = 0xe000ed04
        0x000018ac:    2207        ."      MOVS     r2,#7
        0x000018ae:    69c3        .i      LDR      r3,[r0,#0x1c]
        0x000018b0:    021b        ..      LSLS     r3,r3,#8
        0x000018b2:    0a1b        ..      LSRS     r3,r3,#8
        0x000018b4:    044c        L.      LSLS     r4,r1,#17
        0x000018b6:    4323        #C      ORRS     r3,r3,r4
        0x000018b8:    61c3        .a      STR      r3,[r0,#0x1c]
        0x000018ba:    2000        .       MOVS     r0,#0
        0x000018bc:    6188        .a      STR      r0,[r1,#0x18]
        0x000018be:    610a        .a      STR      r2,[r1,#0x10]
        0x000018c0:    bd10        ..      POP      {r4,pc}
    $d
        0x000018c2:    0000        ..      DCW    0
        0x000018c4:    40003800    .8.@    DCD    1073756160
        0x000018c8:    40003000    .0.@    DCD    1073754112
        0x000018cc:    2000005c    \..     DCD    536871004
        0x000018d0:    00ffffff    ....    DCD    16777215
        0x000018d4:    e000e000    ....    DCD    3758153728
        0x000018d8:    e000ed04    ....    DCD    3758157060
    $t
    i.IN_Count
    IN_Count
        0x000018dc:    4a12        .J      LDR      r2,[pc,#72] ; [0x1928] = 0x20000f8c
        0x000018de:    0049        I.      LSLS     r1,r1,#1
        0x000018e0:    2807        .(      CMP      r0,#7
        0x000018e2:    d20b        ..      BCS      0x18fc ; IN_Count + 32
        0x000018e4:    0003        ..      MOVS     r3,r0
        0x000018e6:    447b        {D      ADD      r3,r3,pc
        0x000018e8:    791b        .y      LDRB     r3,[r3,#4]
        0x000018ea:    18db        ..      ADDS     r3,r3,r3
        0x000018ec:    449f        .D      ADD      pc,pc,r3
    $d
        0x000018ee:    0306        ..      DCW    774
        0x000018f0:    130f0b07    ....    DCD    319752967
        0x000018f4:    0017        ..      DCW    23
    $t
        0x000018f6:    8a10        ..      LDRH     r0,[r2,#0x10]
        0x000018f8:    4a0c        .J      LDR      r2,[pc,#48] ; [0x192c] = 0x20000374
        0x000018fa:    5250        PR      STRH     r0,[r2,r1]
        0x000018fc:    4770        pG      BX       lr
        0x000018fe:    8a10        ..      LDRH     r0,[r2,#0x10]
        0x00001900:    4a0b        .J      LDR      r2,[pc,#44] ; [0x1930] = 0x20000568
        0x00001902:    5250        PR      STRH     r0,[r2,r1]
        0x00001904:    4770        pG      BX       lr
        0x00001906:    8a10        ..      LDRH     r0,[r2,#0x10]
        0x00001908:    4a0a        .J      LDR      r2,[pc,#40] ; [0x1934] = 0x2000075c
        0x0000190a:    5250        PR      STRH     r0,[r2,r1]
        0x0000190c:    4770        pG      BX       lr
        0x0000190e:    8a10        ..      LDRH     r0,[r2,#0x10]
        0x00001910:    4a09        .J      LDR      r2,[pc,#36] ; [0x1938] = 0x20000950
        0x00001912:    5250        PR      STRH     r0,[r2,r1]
        0x00001914:    4770        pG      BX       lr
        0x00001916:    8a10        ..      LDRH     r0,[r2,#0x10]
        0x00001918:    4a08        .J      LDR      r2,[pc,#32] ; [0x193c] = 0x20000b44
        0x0000191a:    5250        PR      STRH     r0,[r2,r1]
        0x0000191c:    4770        pG      BX       lr
        0x0000191e:    8a10        ..      LDRH     r0,[r2,#0x10]
        0x00001920:    4a07        .J      LDR      r2,[pc,#28] ; [0x1940] = 0x20000d38
        0x00001922:    5250        PR      STRH     r0,[r2,r1]
        0x00001924:    4770        pG      BX       lr
    $d
        0x00001926:    0000        ..      DCW    0
        0x00001928:    20000f8c    ...     DCD    536874892
        0x0000192c:    20000374    t..     DCD    536871796
        0x00001930:    20000568    h..     DCD    536872296
        0x00001934:    2000075c    \..     DCD    536872796
        0x00001938:    20000950    P..     DCD    536873296
        0x0000193c:    20000b44    D..     DCD    536873796
        0x00001940:    20000d38    8..     DCD    536874296
    $t
    i.IPD_SlopCount
    IPD_SlopCount
        0x00001944:    b5f0        ..      PUSH     {r4-r7,lr}
        0x00001946:    b0a9        ..      SUB      sp,sp,#0xa4
        0x00001948:    2600        .&      MOVS     r6,#0
        0x0000194a:    9628        (.      STR      r6,[sp,#0xa0]
        0x0000194c:    9627        '.      STR      r6,[sp,#0x9c]
        0x0000194e:    9626        &.      STR      r6,[sp,#0x98]
        0x00001950:    9625        %.      STR      r6,[sp,#0x94]
        0x00001952:    9624        $.      STR      r6,[sp,#0x90]
        0x00001954:    9623        #.      STR      r6,[sp,#0x8c]
        0x00001956:    9622        ".      STR      r6,[sp,#0x88]
        0x00001958:    961f        ..      STR      r6,[sp,#0x7c]
        0x0000195a:    961e        ..      STR      r6,[sp,#0x78]
        0x0000195c:    961d        ..      STR      r6,[sp,#0x74]
        0x0000195e:    9615        ..      STR      r6,[sp,#0x54]
        0x00001960:    9616        ..      STR      r6,[sp,#0x58]
        0x00001962:    9617        ..      STR      r6,[sp,#0x5c]
        0x00001964:    9618        ..      STR      r6,[sp,#0x60]
        0x00001966:    9619        ..      STR      r6,[sp,#0x64]
        0x00001968:    961a        ..      STR      r6,[sp,#0x68]
        0x0000196a:    961b        ..      STR      r6,[sp,#0x6c]
        0x0000196c:    961c        ..      STR      r6,[sp,#0x70]
        0x0000196e:    960d        ..      STR      r6,[sp,#0x34]
        0x00001970:    960e        ..      STR      r6,[sp,#0x38]
        0x00001972:    960f        ..      STR      r6,[sp,#0x3c]
        0x00001974:    9610        ..      STR      r6,[sp,#0x40]
        0x00001976:    9611        ..      STR      r6,[sp,#0x44]
        0x00001978:    9612        ..      STR      r6,[sp,#0x48]
        0x0000197a:    9613        ..      STR      r6,[sp,#0x4c]
        0x0000197c:    9614        ..      STR      r6,[sp,#0x50]
        0x0000197e:    960c        ..      STR      r6,[sp,#0x30]
        0x00001980:    960b        ..      STR      r6,[sp,#0x2c]
        0x00001982:    960a        ..      STR      r6,[sp,#0x28]
        0x00001984:    9609        ..      STR      r6,[sp,#0x24]
        0x00001986:    9608        ..      STR      r6,[sp,#0x20]
        0x00001988:    9607        ..      STR      r6,[sp,#0x1c]
        0x0000198a:    9606        ..      STR      r6,[sp,#0x18]
        0x0000198c:    9605        ..      STR      r6,[sp,#0x14]
        0x0000198e:    9604        ..      STR      r6,[sp,#0x10]
        0x00001990:    9603        ..      STR      r6,[sp,#0xc]
        0x00001992:    9602        ..      STR      r6,[sp,#8]
        0x00001994:    9601        ..      STR      r6,[sp,#4]
        0x00001996:    2701        .'      MOVS     r7,#1
        0x00001998:    9720         .      STR      r7,[sp,#0x80]
        0x0000199a:    4db4        .M      LDR      r5,[pc,#720] ; [0x1c6c] = 0x20000f4c
        0x0000199c:    6d68        hm      LDR      r0,[r5,#0x54]
        0x0000199e:    380c        .8      SUBS     r0,r0,#0xc
        0x000019a0:    9021        !.      STR      r0,[sp,#0x84]
        0x000019a2:    6d68        hm      LDR      r0,[r5,#0x54]
        0x000019a4:    9921        !.      LDR      r1,[sp,#0x84]
        0x000019a6:    1e40        @.      SUBS     r0,r0,#1
        0x000019a8:    4288        .B      CMP      r0,r1
        0x000019aa:    d95d        ].      BLS      0x1a68 ; IPD_SlopCount + 292
        0x000019ac:    a910        ..      ADD      r1,sp,#0x40
        0x000019ae:    828e        ..      STRH     r6,[r1,#0x14]
        0x000019b0:    9821        !.      LDR      r0,[sp,#0x84]
        0x000019b2:    210a        .!      MOVS     r1,#0xa
        0x000019b4:    0044        D.      LSLS     r4,r0,#1
        0x000019b6:    48ae        .H      LDR      r0,[pc,#696] ; [0x1c70] = 0x20000374
        0x000019b8:    5f00        ._      LDRSH    r0,[r0,r4]
        0x000019ba:    f7fefbd1    ....    BL       __aeabi_idiv ; 0x160
        0x000019be:    210a        .!      MOVS     r1,#0xa
        0x000019c0:    4348        HC      MULS     r0,r1,r0
        0x000019c2:    a910        ..      ADD      r1,sp,#0x40
        0x000019c4:    82c8        ..      STRH     r0,[r1,#0x16]
        0x000019c6:    48ab        .H      LDR      r0,[pc,#684] ; [0x1c74] = 0x20000568
        0x000019c8:    210a        .!      MOVS     r1,#0xa
        0x000019ca:    5f00        ._      LDRSH    r0,[r0,r4]
        0x000019cc:    f7fefbc8    ....    BL       __aeabi_idiv ; 0x160
        0x000019d0:    210a        .!      MOVS     r1,#0xa
        0x000019d2:    4348        HC      MULS     r0,r1,r0
        0x000019d4:    a910        ..      ADD      r1,sp,#0x40
        0x000019d6:    8308        ..      STRH     r0,[r1,#0x18]
        0x000019d8:    48a7        .H      LDR      r0,[pc,#668] ; [0x1c78] = 0x2000075c
        0x000019da:    210a        .!      MOVS     r1,#0xa
        0x000019dc:    5f00        ._      LDRSH    r0,[r0,r4]
        0x000019de:    f7fefbbf    ....    BL       __aeabi_idiv ; 0x160
        0x000019e2:    210a        .!      MOVS     r1,#0xa
        0x000019e4:    4348        HC      MULS     r0,r1,r0
        0x000019e6:    a910        ..      ADD      r1,sp,#0x40
        0x000019e8:    8348        H.      STRH     r0,[r1,#0x1a]
        0x000019ea:    48a4        .H      LDR      r0,[pc,#656] ; [0x1c7c] = 0x20000950
        0x000019ec:    210a        .!      MOVS     r1,#0xa
        0x000019ee:    5f00        ._      LDRSH    r0,[r0,r4]
        0x000019f0:    f7fefbb6    ....    BL       __aeabi_idiv ; 0x160
        0x000019f4:    210a        .!      MOVS     r1,#0xa
        0x000019f6:    4348        HC      MULS     r0,r1,r0
        0x000019f8:    a910        ..      ADD      r1,sp,#0x40
        0x000019fa:    8388        ..      STRH     r0,[r1,#0x1c]
        0x000019fc:    48a0        .H      LDR      r0,[pc,#640] ; [0x1c80] = 0x20000b44
        0x000019fe:    210a        .!      MOVS     r1,#0xa
        0x00001a00:    5f00        ._      LDRSH    r0,[r0,r4]
        0x00001a02:    f7fefbad    ....    BL       __aeabi_idiv ; 0x160
        0x00001a06:    210a        .!      MOVS     r1,#0xa
        0x00001a08:    4348        HC      MULS     r0,r1,r0
        0x00001a0a:    a910        ..      ADD      r1,sp,#0x40
        0x00001a0c:    83c8        ..      STRH     r0,[r1,#0x1e]
        0x00001a0e:    489d        .H      LDR      r0,[pc,#628] ; [0x1c84] = 0x20000d38
        0x00001a10:    210a        .!      MOVS     r1,#0xa
        0x00001a12:    5f00        ._      LDRSH    r0,[r0,r4]
        0x00001a14:    f7fefba4    ....    BL       __aeabi_idiv ; 0x160
        0x00001a18:    210a        .!      MOVS     r1,#0xa
        0x00001a1a:    4348        HC      MULS     r0,r1,r0
        0x00001a1c:    a910        ..      ADD      r1,sp,#0x40
        0x00001a1e:    8408        ..      STRH     r0,[r1,#0x20]
        0x00001a20:    971e        ..      STR      r7,[sp,#0x78]
        0x00001a22:    aa15        ..      ADD      r2,sp,#0x54
        0x00001a24:    981e        ..      LDR      r0,[sp,#0x78]
        0x00001a26:    991d        ..      LDR      r1,[sp,#0x74]
        0x00001a28:    0040        @.      LSLS     r0,r0,#1
        0x00001a2a:    5e10        .^      LDRSH    r0,[r2,r0]
        0x00001a2c:    4288        .B      CMP      r0,r1
        0x00001a2e:    db03        ..      BLT      0x1a38 ; IPD_SlopCount + 244
        0x00001a30:    901d        ..      STR      r0,[sp,#0x74]
        0x00001a32:    981e        ..      LDR      r0,[sp,#0x78]
        0x00001a34:    9028        (.      STR      r0,[sp,#0xa0]
        0x00001a36:    bf00        ..      NOP      
        0x00001a38:    bf00        ..      NOP      
        0x00001a3a:    981e        ..      LDR      r0,[sp,#0x78]
        0x00001a3c:    1c40        @.      ADDS     r0,r0,#1
        0x00001a3e:    901e        ..      STR      r0,[sp,#0x78]
        0x00001a40:    981e        ..      LDR      r0,[sp,#0x78]
        0x00001a42:    2807        .(      CMP      r0,#7
        0x00001a44:    dbee        ..      BLT      0x1a24 ; IPD_SlopCount + 224
        0x00001a46:    9820         .      LDR      r0,[sp,#0x80]
        0x00001a48:    1c40        @.      ADDS     r0,r0,#1
        0x00001a4a:    9020         .      STR      r0,[sp,#0x80]
        0x00001a4c:    9920         .      LDR      r1,[sp,#0x80]
        0x00001a4e:    9828        (.      LDR      r0,[sp,#0xa0]
        0x00001a50:    004a        J.      LSLS     r2,r1,#1
        0x00001a52:    a90d        ..      ADD      r1,sp,#0x34
        0x00001a54:    5288        .R      STRH     r0,[r1,r2]
        0x00001a56:    bf00        ..      NOP      
        0x00001a58:    9821        !.      LDR      r0,[sp,#0x84]
        0x00001a5a:    1c40        @.      ADDS     r0,r0,#1
        0x00001a5c:    9021        !.      STR      r0,[sp,#0x84]
        0x00001a5e:    6d68        hm      LDR      r0,[r5,#0x54]
        0x00001a60:    9921        !.      LDR      r1,[sp,#0x84]
        0x00001a62:    1e40        @.      SUBS     r0,r0,#1
        0x00001a64:    4288        .B      CMP      r0,r1
        0x00001a66:    d8a1        ..      BHI      0x19ac ; IPD_SlopCount + 104
        0x00001a68:    961f        ..      STR      r6,[sp,#0x7c]
        0x00001a6a:    9721        !.      STR      r7,[sp,#0x84]
        0x00001a6c:    4a86        .J      LDR      r2,[pc,#536] ; [0x1c88] = 0x20000f2c
        0x00001a6e:    a90d        ..      ADD      r1,sp,#0x34
        0x00001a70:    971e        ..      STR      r7,[sp,#0x78]
        0x00001a72:    981e        ..      LDR      r0,[sp,#0x78]
        0x00001a74:    9b21        !.      LDR      r3,[sp,#0x84]
        0x00001a76:    0040        @.      LSLS     r0,r0,#1
        0x00001a78:    5e08        .^      LDRSH    r0,[r1,r0]
        0x00001a7a:    4298        .B      CMP      r0,r3
        0x00001a7c:    d102        ..      BNE      0x1a84 ; IPD_SlopCount + 320
        0x00001a7e:    981f        ..      LDR      r0,[sp,#0x7c]
        0x00001a80:    1c40        @.      ADDS     r0,r0,#1
        0x00001a82:    901f        ..      STR      r0,[sp,#0x7c]
        0x00001a84:    bf00        ..      NOP      
        0x00001a86:    981e        ..      LDR      r0,[sp,#0x78]
        0x00001a88:    1c40        @.      ADDS     r0,r0,#1
        0x00001a8a:    901e        ..      STR      r0,[sp,#0x78]
        0x00001a8c:    981e        ..      LDR      r0,[sp,#0x78]
        0x00001a8e:    280b        .(      CMP      r0,#0xb
        0x00001a90:    dbef        ..      BLT      0x1a72 ; IPD_SlopCount + 302
        0x00001a92:    9b21        !.      LDR      r3,[sp,#0x84]
        0x00001a94:    981f        ..      LDR      r0,[sp,#0x7c]
        0x00001a96:    005b        [.      LSLS     r3,r3,#1
        0x00001a98:    52d0        .R      STRH     r0,[r2,r3]
        0x00001a9a:    961f        ..      STR      r6,[sp,#0x7c]
        0x00001a9c:    bf00        ..      NOP      
        0x00001a9e:    9821        !.      LDR      r0,[sp,#0x84]
        0x00001aa0:    1c40        @.      ADDS     r0,r0,#1
        0x00001aa2:    9021        !.      STR      r0,[sp,#0x84]
        0x00001aa4:    9821        !.      LDR      r0,[sp,#0x84]
        0x00001aa6:    2807        .(      CMP      r0,#7
        0x00001aa8:    dbe2        ..      BLT      0x1a70 ; IPD_SlopCount + 300
        0x00001aaa:    9624        $.      STR      r6,[sp,#0x90]
        0x00001aac:    9721        !.      STR      r7,[sp,#0x84]
        0x00001aae:    9821        !.      LDR      r0,[sp,#0x84]
        0x00001ab0:    9924        $.      LDR      r1,[sp,#0x90]
        0x00001ab2:    0040        @.      LSLS     r0,r0,#1
        0x00001ab4:    5e10        .^      LDRSH    r0,[r2,r0]
        0x00001ab6:    4288        .B      CMP      r0,r1
        0x00001ab8:    dd03        ..      BLE      0x1ac2 ; IPD_SlopCount + 382
        0x00001aba:    9024        $.      STR      r0,[sp,#0x90]
        0x00001abc:    9821        !.      LDR      r0,[sp,#0x84]
        0x00001abe:    9027        '.      STR      r0,[sp,#0x9c]
        0x00001ac0:    bf00        ..      NOP      
        0x00001ac2:    9821        !.      LDR      r0,[sp,#0x84]
        0x00001ac4:    1c40        @.      ADDS     r0,r0,#1
        0x00001ac6:    9021        !.      STR      r0,[sp,#0x84]
        0x00001ac8:    9821        !.      LDR      r0,[sp,#0x84]
        0x00001aca:    2807        .(      CMP      r0,#7
        0x00001acc:    dbef        ..      BLT      0x1aae ; IPD_SlopCount + 362
        0x00001ace:    9622        ".      STR      r6,[sp,#0x88]
        0x00001ad0:    9721        !.      STR      r7,[sp,#0x84]
        0x00001ad2:    9827        '.      LDR      r0,[sp,#0x9c]
        0x00001ad4:    0040        @.      LSLS     r0,r0,#1
        0x00001ad6:    9921        !.      LDR      r1,[sp,#0x84]
        0x00001ad8:    9b22        ".      LDR      r3,[sp,#0x88]
        0x00001ada:    0049        I.      LSLS     r1,r1,#1
        0x00001adc:    5e51        Q^      LDRSH    r1,[r2,r1]
        0x00001ade:    4299        .B      CMP      r1,r3
        0x00001ae0:    dd07        ..      BLE      0x1af2 ; IPD_SlopCount + 430
        0x00001ae2:    5e13        .^      LDRSH    r3,[r2,r0]
        0x00001ae4:    9c24        $.      LDR      r4,[sp,#0x90]
        0x00001ae6:    42a3        .B      CMP      r3,r4
        0x00001ae8:    d003        ..      BEQ      0x1af2 ; IPD_SlopCount + 430
        0x00001aea:    9122        ".      STR      r1,[sp,#0x88]
        0x00001aec:    9921        !.      LDR      r1,[sp,#0x84]
        0x00001aee:    9126        &.      STR      r1,[sp,#0x98]
        0x00001af0:    bf00        ..      NOP      
        0x00001af2:    9921        !.      LDR      r1,[sp,#0x84]
        0x00001af4:    1c49        I.      ADDS     r1,r1,#1
        0x00001af6:    9121        !.      STR      r1,[sp,#0x84]
        0x00001af8:    9921        !.      LDR      r1,[sp,#0x84]
        0x00001afa:    2907        .)      CMP      r1,#7
        0x00001afc:    dbeb        ..      BLT      0x1ad6 ; IPD_SlopCount + 402
        0x00001afe:    9623        #.      STR      r6,[sp,#0x8c]
        0x00001b00:    9721        !.      STR      r7,[sp,#0x84]
        0x00001b02:    9926        &.      LDR      r1,[sp,#0x98]
        0x00001b04:    004e        N.      LSLS     r6,r1,#1
        0x00001b06:    9921        !.      LDR      r1,[sp,#0x84]
        0x00001b08:    9b23        #.      LDR      r3,[sp,#0x8c]
        0x00001b0a:    0049        I.      LSLS     r1,r1,#1
        0x00001b0c:    5e51        Q^      LDRSH    r1,[r2,r1]
        0x00001b0e:    4299        .B      CMP      r1,r3
        0x00001b10:    dd0b        ..      BLE      0x1b2a ; IPD_SlopCount + 486
        0x00001b12:    5e13        .^      LDRSH    r3,[r2,r0]
        0x00001b14:    9c24        $.      LDR      r4,[sp,#0x90]
        0x00001b16:    42a3        .B      CMP      r3,r4
        0x00001b18:    d007        ..      BEQ      0x1b2a ; IPD_SlopCount + 486
        0x00001b1a:    5f93        ._      LDRSH    r3,[r2,r6]
        0x00001b1c:    9c22        ".      LDR      r4,[sp,#0x88]
        0x00001b1e:    42a3        .B      CMP      r3,r4
        0x00001b20:    d003        ..      BEQ      0x1b2a ; IPD_SlopCount + 486
        0x00001b22:    9123        #.      STR      r1,[sp,#0x8c]
        0x00001b24:    9921        !.      LDR      r1,[sp,#0x84]
        0x00001b26:    9125        %.      STR      r1,[sp,#0x94]
        0x00001b28:    bf00        ..      NOP      
        0x00001b2a:    9921        !.      LDR      r1,[sp,#0x84]
        0x00001b2c:    1c49        I.      ADDS     r1,r1,#1
        0x00001b2e:    9121        !.      STR      r1,[sp,#0x84]
        0x00001b30:    9921        !.      LDR      r1,[sp,#0x84]
        0x00001b32:    2907        .)      CMP      r1,#7
        0x00001b34:    dbe7        ..      BLT      0x1b06 ; IPD_SlopCount + 450
        0x00001b36:    9a27        '.      LDR      r2,[sp,#0x9c]
        0x00001b38:    240a        .$      MOVS     r4,#0xa
        0x00001b3a:    2006        .       MOVS     r0,#6
        0x00001b3c:    2304        .#      MOVS     r3,#4
        0x00001b3e:    210c        .!      MOVS     r1,#0xc
        0x00001b40:    2a07        .*      CMP      r2,#7
        0x00001b42:    d249        I.      BCS      0x1bd8 ; IPD_SlopCount + 660
        0x00001b44:    0016        ..      MOVS     r6,r2
        0x00001b46:    447e        ~D      ADD      r6,r6,pc
        0x00001b48:    7936        6y      LDRB     r6,[r6,#4]
        0x00001b4a:    19b6        ..      ADDS     r6,r6,r6
        0x00001b4c:    44b7        .D      ADD      pc,pc,r6
    $d
        0x00001b4e:    0388        ..      DCW    904
        0x00001b50:    5c452f18    ./E\    DCD    1548037912
        0x00001b54:    0073        s.      DCW    115
    $t
        0x00001b56:    9826        &.      LDR      r0,[sp,#0x98]
        0x00001b58:    2802        .(      CMP      r0,#2
        0x00001b5a:    d100        ..      BNE      0x1b5e ; IPD_SlopCount + 538
        0x00001b5c:    6428        (d      STR      r0,[r5,#0x40]
        0x00001b5e:    9826        &.      LDR      r0,[sp,#0x98]
        0x00001b60:    2806        .(      CMP      r0,#6
        0x00001b62:    d100        ..      BNE      0x1b66 ; IPD_SlopCount + 546
        0x00001b64:    6429        )d      STR      r1,[r5,#0x40]
        0x00001b66:    9925        %.      LDR      r1,[sp,#0x94]
        0x00001b68:    9826        &.      LDR      r0,[sp,#0x98]
        0x00001b6a:    4288        .B      CMP      r0,r1
        0x00001b6c:    d100        ..      BNE      0x1b70 ; IPD_SlopCount + 556
        0x00001b6e:    642f        /d      STR      r7,[r5,#0x40]
        0x00001b70:    9826        &.      LDR      r0,[sp,#0x98]
        0x00001b72:    2802        .(      CMP      r0,#2
        0x00001b74:    d074        t.      BEQ      0x1c60 ; IPD_SlopCount + 796
        0x00001b76:    9826        &.      LDR      r0,[sp,#0x98]
        0x00001b78:    2806        .(      CMP      r0,#6
        0x00001b7a:    d071        q.      BEQ      0x1c60 ; IPD_SlopCount + 796
        0x00001b7c:    642f        /d      STR      r7,[r5,#0x40]
        0x00001b7e:    e06f        o.      B        0x1c60 ; IPD_SlopCount + 796
        0x00001b80:    9826        &.      LDR      r0,[sp,#0x98]
        0x00001b82:    2803        .(      CMP      r0,#3
        0x00001b84:    d100        ..      BNE      0x1b88 ; IPD_SlopCount + 580
        0x00001b86:    642b        +d      STR      r3,[r5,#0x40]
        0x00001b88:    9826        &.      LDR      r0,[sp,#0x98]
        0x00001b8a:    2801        .(      CMP      r0,#1
        0x00001b8c:    d101        ..      BNE      0x1b92 ; IPD_SlopCount + 590
        0x00001b8e:    2002        .       MOVS     r0,#2
        0x00001b90:    6428        (d      STR      r0,[r5,#0x40]
        0x00001b92:    9a25        %.      LDR      r2,[sp,#0x94]
        0x00001b94:    9926        &.      LDR      r1,[sp,#0x98]
        0x00001b96:    2003        .       MOVS     r0,#3
        0x00001b98:    4291        .B      CMP      r1,r2
