747lulu747/SAOZHAN_BRUASH/src/SDK-LIB/华芯第一版本硬件-非FPC/ROMAN-21DD - SDK - V0.1/out/SWM211.asm
        0x00001b9a:    d100        ..      BNE      0x1b9e ; IPD_SlopCount + 602
        0x00001b9c:    6428        (d      STR      r0,[r5,#0x40]
        0x00001b9e:    9926        &.      LDR      r1,[sp,#0x98]
        0x00001ba0:    2903        .)      CMP      r1,#3
        0x00001ba2:    d05d        ].      BEQ      0x1c60 ; IPD_SlopCount + 796
        0x00001ba4:    9926        &.      LDR      r1,[sp,#0x98]
        0x00001ba6:    2901        .)      CMP      r1,#1
        0x00001ba8:    d05a        Z.      BEQ      0x1c60 ; IPD_SlopCount + 796
        0x00001baa:    6428        (d      STR      r0,[r5,#0x40]
        0x00001bac:    e058        X.      B        0x1c60 ; IPD_SlopCount + 796
        0x00001bae:    9926        &.      LDR      r1,[sp,#0x98]
        0x00001bb0:    2904        .)      CMP      r1,#4
        0x00001bb2:    d100        ..      BNE      0x1bb6 ; IPD_SlopCount + 626
        0x00001bb4:    6428        (d      STR      r0,[r5,#0x40]
        0x00001bb6:    9826        &.      LDR      r0,[sp,#0x98]
        0x00001bb8:    2802        .(      CMP      r0,#2
        0x00001bba:    d100        ..      BNE      0x1bbe ; IPD_SlopCount + 634
        0x00001bbc:    642b        +d      STR      r3,[r5,#0x40]
        0x00001bbe:    9a25        %.      LDR      r2,[sp,#0x94]
        0x00001bc0:    9926        &.      LDR      r1,[sp,#0x98]
        0x00001bc2:    2005        .       MOVS     r0,#5
        0x00001bc4:    4291        .B      CMP      r1,r2
        0x00001bc6:    d100        ..      BNE      0x1bca ; IPD_SlopCount + 646
        0x00001bc8:    6428        (d      STR      r0,[r5,#0x40]
        0x00001bca:    9926        &.      LDR      r1,[sp,#0x98]
        0x00001bcc:    2904        .)      CMP      r1,#4
        0x00001bce:    d047        G.      BEQ      0x1c60 ; IPD_SlopCount + 796
        0x00001bd0:    9926        &.      LDR      r1,[sp,#0x98]
        0x00001bd2:    2902        .)      CMP      r1,#2
        0x00001bd4:    d044        D.      BEQ      0x1c60 ; IPD_SlopCount + 796
        0x00001bd6:    6428        (d      STR      r0,[r5,#0x40]
        0x00001bd8:    e042        B.      B        0x1c60 ; IPD_SlopCount + 796
        0x00001bda:    9926        &.      LDR      r1,[sp,#0x98]
        0x00001bdc:    2905        .)      CMP      r1,#5
        0x00001bde:    d101        ..      BNE      0x1be4 ; IPD_SlopCount + 672
        0x00001be0:    2108        .!      MOVS     r1,#8
        0x00001be2:    6429        )d      STR      r1,[r5,#0x40]
        0x00001be4:    9926        &.      LDR      r1,[sp,#0x98]
        0x00001be6:    2903        .)      CMP      r1,#3
        0x00001be8:    d100        ..      BNE      0x1bec ; IPD_SlopCount + 680
        0x00001bea:    6428        (d      STR      r0,[r5,#0x40]
        0x00001bec:    9a25        %.      LDR      r2,[sp,#0x94]
        0x00001bee:    9926        &.      LDR      r1,[sp,#0x98]
        0x00001bf0:    2007        .       MOVS     r0,#7
        0x00001bf2:    4291        .B      CMP      r1,r2
        0x00001bf4:    d100        ..      BNE      0x1bf8 ; IPD_SlopCount + 692
        0x00001bf6:    6428        (d      STR      r0,[r5,#0x40]
        0x00001bf8:    9926        &.      LDR      r1,[sp,#0x98]
        0x00001bfa:    2905        .)      CMP      r1,#5
        0x00001bfc:    d030        0.      BEQ      0x1c60 ; IPD_SlopCount + 796
        0x00001bfe:    9926        &.      LDR      r1,[sp,#0x98]
        0x00001c00:    2903        .)      CMP      r1,#3
        0x00001c02:    d02d        -.      BEQ      0x1c60 ; IPD_SlopCount + 796
        0x00001c04:    6428        (d      STR      r0,[r5,#0x40]
        0x00001c06:    e02b        +.      B        0x1c60 ; IPD_SlopCount + 796
        0x00001c08:    9826        &.      LDR      r0,[sp,#0x98]
        0x00001c0a:    2806        .(      CMP      r0,#6
        0x00001c0c:    d100        ..      BNE      0x1c10 ; IPD_SlopCount + 716
        0x00001c0e:    642c        ,d      STR      r4,[r5,#0x40]
        0x00001c10:    9826        &.      LDR      r0,[sp,#0x98]
        0x00001c12:    2804        .(      CMP      r0,#4
        0x00001c14:    d101        ..      BNE      0x1c1a ; IPD_SlopCount + 726
        0x00001c16:    2008        .       MOVS     r0,#8
        0x00001c18:    6428        (d      STR      r0,[r5,#0x40]
        0x00001c1a:    9a25        %.      LDR      r2,[sp,#0x94]
        0x00001c1c:    9926        &.      LDR      r1,[sp,#0x98]
        0x00001c1e:    2009        .       MOVS     r0,#9
        0x00001c20:    4291        .B      CMP      r1,r2
        0x00001c22:    d100        ..      BNE      0x1c26 ; IPD_SlopCount + 738
        0x00001c24:    6428        (d      STR      r0,[r5,#0x40]
        0x00001c26:    9926        &.      LDR      r1,[sp,#0x98]
        0x00001c28:    2906        .)      CMP      r1,#6
        0x00001c2a:    d019        ..      BEQ      0x1c60 ; IPD_SlopCount + 796
        0x00001c2c:    9926        &.      LDR      r1,[sp,#0x98]
        0x00001c2e:    2904        .)      CMP      r1,#4
        0x00001c30:    d016        ..      BEQ      0x1c60 ; IPD_SlopCount + 796
        0x00001c32:    6428        (d      STR      r0,[r5,#0x40]
        0x00001c34:    e014        ..      B        0x1c60 ; IPD_SlopCount + 796
        0x00001c36:    9826        &.      LDR      r0,[sp,#0x98]
        0x00001c38:    2801        .(      CMP      r0,#1
        0x00001c3a:    d100        ..      BNE      0x1c3e ; IPD_SlopCount + 762
        0x00001c3c:    6429        )d      STR      r1,[r5,#0x40]
        0x00001c3e:    9826        &.      LDR      r0,[sp,#0x98]
        0x00001c40:    2805        .(      CMP      r0,#5
        0x00001c42:    d100        ..      BNE      0x1c46 ; IPD_SlopCount + 770
        0x00001c44:    642c        ,d      STR      r4,[r5,#0x40]
        0x00001c46:    9a25        %.      LDR      r2,[sp,#0x94]
        0x00001c48:    9926        &.      LDR      r1,[sp,#0x98]
        0x00001c4a:    200b        .       MOVS     r0,#0xb
        0x00001c4c:    4291        .B      CMP      r1,r2
        0x00001c4e:    d100        ..      BNE      0x1c52 ; IPD_SlopCount + 782
        0x00001c50:    6428        (d      STR      r0,[r5,#0x40]
        0x00001c52:    9926        &.      LDR      r1,[sp,#0x98]
        0x00001c54:    2905        .)      CMP      r1,#5
        0x00001c56:    d003        ..      BEQ      0x1c60 ; IPD_SlopCount + 796
        0x00001c58:    9926        &.      LDR      r1,[sp,#0x98]
        0x00001c5a:    2901        .)      CMP      r1,#1
        0x00001c5c:    d000        ..      BEQ      0x1c60 ; IPD_SlopCount + 796
        0x00001c5e:    6428        (d      STR      r0,[r5,#0x40]
        0x00001c60:    6c28        (l      LDR      r0,[r5,#0x40]
        0x00001c62:    f000fe11    ....    BL       RIPD_Angle_Out ; 0x2888
        0x00001c66:    b029        ).      ADD      sp,sp,#0xa4
        0x00001c68:    bdf0        ..      POP      {r4-r7,pc}
    $d
        0x00001c6a:    0000        ..      DCW    0
        0x00001c6c:    20000f4c    L..     DCD    536874828
        0x00001c70:    20000374    t..     DCD    536871796
        0x00001c74:    20000568    h..     DCD    536872296
        0x00001c78:    2000075c    \..     DCD    536872796
        0x00001c7c:    20000950    P..     DCD    536873296
        0x00001c80:    20000b44    D..     DCD    536873796
        0x00001c84:    20000d38    8..     DCD    536874296
        0x00001c88:    20000f2c    ,..     DCD    536874796
    $t
    i.Init_ADC
    Init_ADC
        0x00001c8c:    b530        0.      PUSH     {r4,r5,lr}
        0x00001c8e:    b085        ..      SUB      sp,sp,#0x14
        0x00001c90:    2300        .#      MOVS     r3,#0
        0x00001c92:    2207        ."      MOVS     r2,#7
        0x00001c94:    2109        .!      MOVS     r1,#9
        0x00001c96:    4827        'H      LDR      r0,[pc,#156] ; [0x1d34] = 0x400a0080
        0x00001c98:    f000fc98    ....    BL       PORT_Init ; 0x25cc
        0x00001c9c:    4c26        &L      LDR      r4,[pc,#152] ; [0x1d38] = 0x400a0000
        0x00001c9e:    2300        .#      MOVS     r3,#0
        0x00001ca0:    2207        ."      MOVS     r2,#7
        0x00001ca2:    2108        .!      MOVS     r1,#8
        0x00001ca4:    4620         F      MOV      r0,r4
        0x00001ca6:    f000fc91    ....    BL       PORT_Init ; 0x25cc
        0x00001caa:    4d24        $M      LDR      r5,[pc,#144] ; [0x1d3c] = 0x400a0010
        0x00001cac:    2300        .#      MOVS     r3,#0
        0x00001cae:    2207        ."      MOVS     r2,#7
        0x00001cb0:    2109        .!      MOVS     r1,#9
        0x00001cb2:    4628        (F      MOV      r0,r5
        0x00001cb4:    f000fc8a    ....    BL       PORT_Init ; 0x25cc
        0x00001cb8:    2300        .#      MOVS     r3,#0
        0x00001cba:    2207        ."      MOVS     r2,#7
        0x00001cbc:    2104        .!      MOVS     r1,#4
        0x00001cbe:    4628        (F      MOV      r0,r5
        0x00001cc0:    f000fc84    ....    BL       PORT_Init ; 0x25cc
        0x00001cc4:    2300        .#      MOVS     r3,#0
        0x00001cc6:    2207        ."      MOVS     r2,#7
        0x00001cc8:    2108        .!      MOVS     r1,#8
        0x00001cca:    4620         F      MOV      r0,r4
        0x00001ccc:    f000fc7e    ..~.    BL       PORT_Init ; 0x25cc
        0x00001cd0:    2300        .#      MOVS     r3,#0
        0x00001cd2:    2207        ."      MOVS     r2,#7
        0x00001cd4:    2106        .!      MOVS     r1,#6
        0x00001cd6:    4628        (F      MOV      r0,r5
        0x00001cd8:    f000fc78    ..x.    BL       PORT_Init ; 0x25cc
        0x00001cdc:    2300        .#      MOVS     r3,#0
        0x00001cde:    2207        ."      MOVS     r2,#7
        0x00001ce0:    2105        .!      MOVS     r1,#5
        0x00001ce2:    4628        (F      MOV      r0,r5
        0x00001ce4:    f000fc72    ..r.    BL       PORT_Init ; 0x25cc
        0x00001ce8:    2090        .       MOVS     r0,#0x90
        0x00001cea:    466b        kF      MOV      r3,sp
        0x00001cec:    7018        .p      STRB     r0,[r3,#0]
        0x00001cee:    2104        .!      MOVS     r1,#4
        0x00001cf0:    7059        Yp      STRB     r1,[r3,#1]
        0x00001cf2:    2007        .       MOVS     r0,#7
        0x00001cf4:    7098        .p      STRB     r0,[r3,#2]
        0x00001cf6:    20ff        .       MOVS     r0,#0xff
        0x00001cf8:    3085        .0      ADDS     r0,r0,#0x85
        0x00001cfa:    8098        ..      STRH     r0,[r3,#4]
        0x00001cfc:    2000        .       MOVS     r0,#0
        0x00001cfe:    7198        .q      STRB     r0,[r3,#6]
        0x00001d00:    4a0f        .J      LDR      r2,[pc,#60] ; [0x1d40] = 0x1005
        0x00001d02:    811a        ..      STRH     r2,[r3,#8]
        0x00001d04:    7298        .r      STRB     r0,[r3,#0xa]
        0x00001d06:    8199        ..      STRH     r1,[r3,#0xc]
        0x00001d08:    81d8        ..      STRH     r0,[r3,#0xe]
        0x00001d0a:    4c0e        .L      LDR      r4,[pc,#56] ; [0x1d44] = 0x40049000
        0x00001d0c:    4669        iF      MOV      r1,sp
        0x00001d0e:    4620         F      MOV      r0,r4
        0x00001d10:    f7fff844    ..D.    BL       ADC_Init ; 0xd9c
        0x00001d14:    490c        .I      LDR      r1,[pc,#48] ; [0x1d48] = 0xe000e40c
        0x00001d16:    680a        .h      LDR      r2,[r1,#0]
        0x00001d18:    20ff        .       MOVS     r0,#0xff
        0x00001d1a:    0400        ..      LSLS     r0,r0,#16
        0x00001d1c:    4382        .C      BICS     r2,r2,r0
        0x00001d1e:    600a        .`      STR      r2,[r1,#0]
        0x00001d20:    2101        .!      MOVS     r1,#1
        0x00001d22:    480a        .H      LDR      r0,[pc,#40] ; [0x1d4c] = 0xe000e100
        0x00001d24:    0389        ..      LSLS     r1,r1,#14
        0x00001d26:    6001        .`      STR      r1,[r0,#0]
        0x00001d28:    4620         F      MOV      r0,r4
        0x00001d2a:    f7fff961    ..a.    BL       ADC_Open ; 0xff0
        0x00001d2e:    b005        ..      ADD      sp,sp,#0x14
        0x00001d30:    bd30        0.      POP      {r4,r5,pc}
    $d
        0x00001d32:    0000        ..      DCW    0
        0x00001d34:    400a0080    ...@    DCD    1074397312
        0x00001d38:    400a0000    ...@    DCD    1074397184
        0x00001d3c:    400a0010    ...@    DCD    1074397200
        0x00001d40:    00001005    ....    DCD    4101
        0x00001d44:    40049000    ...@    DCD    1074040832
        0x00001d48:    e000e40c    ....    DCD    3758154764
        0x00001d4c:    e000e100    ....    DCD    3758153984
    $t
    i.Init_GPIO
    Init_GPIO
        0x00001d50:    4770        pG      BX       lr
        0x00001d52:    0000        ..      MOVS     r0,r0
    i.Init_OPA
    Init_OPA
        0x00001d54:    b510        ..      PUSH     {r4,lr}
        0x00001d56:    4c0f        .L      LDR      r4,[pc,#60] ; [0x1d94] = 0x400a0000
        0x00001d58:    2300        .#      MOVS     r3,#0
        0x00001d5a:    2207        ."      MOVS     r2,#7
        0x00001d5c:    210e        .!      MOVS     r1,#0xe
        0x00001d5e:    4620         F      MOV      r0,r4
        0x00001d60:    f000fc34    ..4.    BL       PORT_Init ; 0x25cc
        0x00001d64:    2300        .#      MOVS     r3,#0
        0x00001d66:    2207        ."      MOVS     r2,#7
        0x00001d68:    210d        .!      MOVS     r1,#0xd
        0x00001d6a:    4620         F      MOV      r0,r4
        0x00001d6c:    f000fc2e    ....    BL       PORT_Init ; 0x25cc
        0x00001d70:    2300        .#      MOVS     r3,#0
        0x00001d72:    2207        ."      MOVS     r2,#7
        0x00001d74:    2109        .!      MOVS     r1,#9
        0x00001d76:    4620         F      MOV      r0,r4
        0x00001d78:    f000fc28    ..(.    BL       PORT_Init ; 0x25cc
        0x00001d7c:    2300        .#      MOVS     r3,#0
        0x00001d7e:    2207        ."      MOVS     r2,#7
        0x00001d80:    2108        .!      MOVS     r1,#8
        0x00001d82:    4620         F      MOV      r0,r4
        0x00001d84:    f000fc22    ..".    BL       PORT_Init ; 0x25cc
        0x00001d88:    4803        .H      LDR      r0,[pc,#12] ; [0x1d98] = 0x400aa040
        0x00001d8a:    6b01        .k      LDR      r1,[r0,#0x30]
        0x00001d8c:    220f        ."      MOVS     r2,#0xf
        0x00001d8e:    4311        .C      ORRS     r1,r1,r2
        0x00001d90:    6301        .c      STR      r1,[r0,#0x30]
        0x00001d92:    bd10        ..      POP      {r4,pc}
    $d
        0x00001d94:    400a0000    ...@    DCD    1074397184
        0x00001d98:    400aa040    @..@    DCD    1074438208
    $t
    i.Init_PWM_Drive
    Init_PWM_Drive
        0x00001d9c:    b570        p.      PUSH     {r4-r6,lr}
        0x00001d9e:    b08a        ..      SUB      sp,sp,#0x28
        0x00001da0:    2002        .       MOVS     r0,#2
        0x00001da2:    466b        kF      MOV      r3,sp
        0x00001da4:    7218        .r      STRB     r0,[r3,#8]
        0x00001da6:    2201        ."      MOVS     r2,#1
        0x00001da8:    815a        Z.      STRH     r2,[r3,#0xa]
        0x00001daa:    4821        !H      LDR      r0,[pc,#132] ; [0x1e30] = 0xafc
        0x00001dac:    8198        ..      STRH     r0,[r3,#0xc]
        0x00001dae:    1041        A.      ASRS     r1,r0,#1
        0x00001db0:    81d9        ..      STRH     r1,[r3,#0xe]
        0x00001db2:    2051        Q       MOVS     r0,#0x51
        0x00001db4:    8258        X.      STRH     r0,[r3,#0x12]
        0x00001db6:    2400        .$      MOVS     r4,#0
        0x00001db8:    9405        ..      STR      r4,[sp,#0x14]
        0x00001dba:    8319        ..      STRH     r1,[r3,#0x18]
        0x00001dbc:    8398        ..      STRH     r0,[r3,#0x1c]
        0x00001dbe:    779c        .w      STRB     r4,[r3,#0x1e]
        0x00001dc0:    77dc        .w      STRB     r4,[r3,#0x1f]
        0x00001dc2:    ab08        ..      ADD      r3,sp,#0x20
        0x00001dc4:    701c        .p      STRB     r4,[r3,#0]
        0x00001dc6:    709a        .p      STRB     r2,[r3,#2]
        0x00001dc8:    70dc        .p      STRB     r4,[r3,#3]
        0x00001dca:    9409        ..      STR      r4,[sp,#0x24]
        0x00001dcc:    4d19        .M      LDR      r5,[pc,#100] ; [0x1e34] = 0x40046000
        0x00001dce:    a902        ..      ADD      r1,sp,#8
        0x00001dd0:    4628        (F      MOV      r0,r5
        0x00001dd2:    f000fc99    ....    BL       PWM_Init ; 0x2708
        0x00001dd6:    ab08        ..      ADD      r3,sp,#0x20
        0x00001dd8:    709c        .p      STRB     r4,[r3,#2]
        0x00001dda:    70dc        .p      STRB     r4,[r3,#3]
        0x00001ddc:    4e16        .N      LDR      r6,[pc,#88] ; [0x1e38] = 0x40046080
        0x00001dde:    a902        ..      ADD      r1,sp,#8
        0x00001de0:    4630        0F      MOV      r0,r6
        0x00001de2:    f000fc91    ....    BL       PWM_Init ; 0x2708
        0x00001de6:    4916        .I      LDR      r1,[pc,#88] ; [0x1e40] = 0x40046400
        0x00001de8:    4814        .H      LDR      r0,[pc,#80] ; [0x1e3c] = 0xffff
        0x00001dea:    6048        H`      STR      r0,[r1,#4]
        0x00001dec:    2003        .       MOVS     r0,#3
        0x00001dee:    f000fd43    ..C.    BL       PWM_Start ; 0x2878
        0x00001df2:    2300        .#      MOVS     r3,#0
        0x00001df4:    9400        ..      STR      r4,[sp,#0]
        0x00001df6:    461a        .F      MOV      r2,r3
        0x00001df8:    4912        .I      LDR      r1,[pc,#72] ; [0x1e44] = 0x99e
        0x00001dfa:    4628        (F      MOV      r0,r5
        0x00001dfc:    9401        ..      STR      r4,[sp,#4]
        0x00001dfe:    f000fc71    ..q.    BL       PWM_CmpTrigger ; 0x26e4
        0x00001e02:    2300        .#      MOVS     r3,#0
        0x00001e04:    9400        ..      STR      r4,[sp,#0]
        0x00001e06:    461a        .F      MOV      r2,r3
        0x00001e08:    490f        .I      LDR      r1,[pc,#60] ; [0x1e48] = 0xa66
        0x00001e0a:    4630        0F      MOV      r0,r6
        0x00001e0c:    9401        ..      STR      r4,[sp,#4]
        0x00001e0e:    f000fc69    ..i.    BL       PWM_CmpTrigger ; 0x26e4
        0x00001e12:    f000fc3d    ..=.    BL       PORT_SixDrive_Enable ; 0x2690
        0x00001e16:    480d        .H      LDR      r0,[pc,#52] ; [0x1e4c] = 0xe000e404
        0x00001e18:    6801        .h      LDR      r1,[r0,#0]
        0x00001e1a:    0209        ..      LSLS     r1,r1,#8
        0x00001e1c:    0a09        ..      LSRS     r1,r1,#8
        0x00001e1e:    0702        ..      LSLS     r2,r0,#28
        0x00001e20:    4311        .C      ORRS     r1,r1,r2
        0x00001e22:    6001        .`      STR      r1,[r0,#0]
        0x00001e24:    490a        .I      LDR      r1,[pc,#40] ; [0x1e50] = 0xe000e100
        0x00001e26:    2080        .       MOVS     r0,#0x80
        0x00001e28:    6008        .`      STR      r0,[r1,#0]
        0x00001e2a:    b00a        ..      ADD      sp,sp,#0x28
        0x00001e2c:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x00001e2e:    0000        ..      DCW    0
        0x00001e30:    00000afc    ....    DCD    2812
        0x00001e34:    40046000    .`.@    DCD    1074028544
        0x00001e38:    40046080    .`.@    DCD    1074028672
        0x00001e3c:    0000ffff    ....    DCD    65535
        0x00001e40:    40046400    .d.@    DCD    1074029568
        0x00001e44:    0000099e    ....    DCD    2462
        0x00001e48:    00000a66    f...    DCD    2662
        0x00001e4c:    e000e404    ....    DCD    3758154756
        0x00001e50:    e000e100    ....    DCD    3758153984
    $t
    i.Init_Timer
    Init_Timer
        0x00001e54:    4770        pG      BX       lr
        0x00001e56:    0000        ..      MOVS     r0,r0
    i.Inport_Plus_PWM
    Inport_Plus_PWM
        0x00001e58:    b4f0        ..      PUSH     {r4-r7}
        0x00001e5a:    2100        .!      MOVS     r1,#0
        0x00001e5c:    2200        ."      MOVS     r2,#0
        0x00001e5e:    2300        .#      MOVS     r3,#0
        0x00001e60:    2400        .$      MOVS     r4,#0
        0x00001e62:    2500        .%      MOVS     r5,#0
        0x00001e64:    2600        .&      MOVS     r6,#0
        0x00001e66:    280a        .(      CMP      r0,#0xa
        0x00001e68:    d240        @.      BCS      0x1eec ; Inport_Plus_PWM + 148
        0x00001e6a:    0007        ..      MOVS     r7,r0
        0x00001e6c:    447f        .D      ADD      r7,r7,pc
        0x00001e6e:    793f        ?y      LDRB     r7,[r7,#4]
        0x00001e70:    19ff        ..      ADDS     r7,r7,r7
        0x00001e72:    44bf        .D      ADD      pc,pc,r7
    $d
        0x00001e74:    20120480    ...     DCD    538051712
        0x00001e78:    584a3c2e    .<JX    DCD    1481260078
        0x00001e7c:    7466        ft      DCW    29798
    $t
        0x00001e7e:    4843        CH      LDR      r0,[pc,#268] ; [0x1f8c] = 0x20000f4c
        0x00001e80:    6b41        Ak      LDR      r1,[r0,#0x34]
        0x00001e82:    b209        ..      SXTH     r1,r1
        0x00001e84:    6b02        .k      LDR      r2,[r0,#0x30]
        0x00001e86:    b212        ..      SXTH     r2,r2
        0x00001e88:    6b03        .k      LDR      r3,[r0,#0x30]
        0x00001e8a:    b21b        ..      SXTH     r3,r3
        0x00001e8c:    6b44        Dk      LDR      r4,[r0,#0x34]
        0x00001e8e:    b224        $.      SXTH     r4,r4
        0x00001e90:    6b05        .k      LDR      r5,[r0,#0x30]
        0x00001e92:    b22d        -.      SXTH     r5,r5
        0x00001e94:    6b00        .k      LDR      r0,[r0,#0x30]
        0x00001e96:    b206        ..      SXTH     r6,r0
        0x00001e98:    e06d        m.      B        0x1f76 ; Inport_Plus_PWM + 286
        0x00001e9a:    483c        <H      LDR      r0,[pc,#240] ; [0x1f8c] = 0x20000f4c
        0x00001e9c:    6b41        Ak      LDR      r1,[r0,#0x34]
        0x00001e9e:    b209        ..      SXTH     r1,r1
        0x00001ea0:    6b42        Bk      LDR      r2,[r0,#0x34]
        0x00001ea2:    b212        ..      SXTH     r2,r2
        0x00001ea4:    6b03        .k      LDR      r3,[r0,#0x30]
        0x00001ea6:    b21b        ..      SXTH     r3,r3
        0x00001ea8:    6b44        Dk      LDR      r4,[r0,#0x34]
        0x00001eaa:    b224        $.      SXTH     r4,r4
        0x00001eac:    6b45        Ek      LDR      r5,[r0,#0x34]
        0x00001eae:    b22d        -.      SXTH     r5,r5
        0x00001eb0:    6b00        .k      LDR      r0,[r0,#0x30]
        0x00001eb2:    b206        ..      SXTH     r6,r0
        0x00001eb4:    e05f        _.      B        0x1f76 ; Inport_Plus_PWM + 286
        0x00001eb6:    4835        5H      LDR      r0,[pc,#212] ; [0x1f8c] = 0x20000f4c
        0x00001eb8:    6b01        .k      LDR      r1,[r0,#0x30]
        0x00001eba:    b209        ..      SXTH     r1,r1
        0x00001ebc:    6b42        Bk      LDR      r2,[r0,#0x34]
        0x00001ebe:    b212        ..      SXTH     r2,r2
        0x00001ec0:    6b03        .k      LDR      r3,[r0,#0x30]
        0x00001ec2:    b21b        ..      SXTH     r3,r3
        0x00001ec4:    6b04        .k      LDR      r4,[r0,#0x30]
        0x00001ec6:    b224        $.      SXTH     r4,r4
        0x00001ec8:    6b45        Ek      LDR      r5,[r0,#0x34]
        0x00001eca:    b22d        -.      SXTH     r5,r5
        0x00001ecc:    6b00        .k      LDR      r0,[r0,#0x30]
        0x00001ece:    b206        ..      SXTH     r6,r0
        0x00001ed0:    e051        Q.      B        0x1f76 ; Inport_Plus_PWM + 286
        0x00001ed2:    482e        .H      LDR      r0,[pc,#184] ; [0x1f8c] = 0x20000f4c
