747lulu747/SAOZHAN_BRUASH/src/SDK-LIB/华芯第一版本硬件-非FPC/ROMAN-21DD - SDK - V0.1/out/SWM211.asm
        0x00001ed4:    6b01        .k      LDR      r1,[r0,#0x30]
        0x00001ed6:    b209        ..      SXTH     r1,r1
        0x00001ed8:    6b42        Bk      LDR      r2,[r0,#0x34]
        0x00001eda:    b212        ..      SXTH     r2,r2
        0x00001edc:    6b43        Ck      LDR      r3,[r0,#0x34]
        0x00001ede:    b21b        ..      SXTH     r3,r3
        0x00001ee0:    6b04        .k      LDR      r4,[r0,#0x30]
        0x00001ee2:    b224        $.      SXTH     r4,r4
        0x00001ee4:    6b45        Ek      LDR      r5,[r0,#0x34]
        0x00001ee6:    b22d        -.      SXTH     r5,r5
        0x00001ee8:    6b40        @k      LDR      r0,[r0,#0x34]
        0x00001eea:    b206        ..      SXTH     r6,r0
        0x00001eec:    e043        C.      B        0x1f76 ; Inport_Plus_PWM + 286
        0x00001eee:    4827        'H      LDR      r0,[pc,#156] ; [0x1f8c] = 0x20000f4c
        0x00001ef0:    6b01        .k      LDR      r1,[r0,#0x30]
        0x00001ef2:    b209        ..      SXTH     r1,r1
        0x00001ef4:    6b02        .k      LDR      r2,[r0,#0x30]
        0x00001ef6:    b212        ..      SXTH     r2,r2
        0x00001ef8:    6b43        Ck      LDR      r3,[r0,#0x34]
        0x00001efa:    b21b        ..      SXTH     r3,r3
        0x00001efc:    6b04        .k      LDR      r4,[r0,#0x30]
        0x00001efe:    b224        $.      SXTH     r4,r4
        0x00001f00:    6b05        .k      LDR      r5,[r0,#0x30]
        0x00001f02:    b22d        -.      SXTH     r5,r5
        0x00001f04:    6b40        @k      LDR      r0,[r0,#0x34]
        0x00001f06:    b206        ..      SXTH     r6,r0
        0x00001f08:    e035        5.      B        0x1f76 ; Inport_Plus_PWM + 286
        0x00001f0a:    4820         H      LDR      r0,[pc,#128] ; [0x1f8c] = 0x20000f4c
        0x00001f0c:    6b41        Ak      LDR      r1,[r0,#0x34]
        0x00001f0e:    b209        ..      SXTH     r1,r1
        0x00001f10:    6b02        .k      LDR      r2,[r0,#0x30]
        0x00001f12:    b212        ..      SXTH     r2,r2
        0x00001f14:    6b43        Ck      LDR      r3,[r0,#0x34]
        0x00001f16:    b21b        ..      SXTH     r3,r3
        0x00001f18:    6b44        Dk      LDR      r4,[r0,#0x34]
        0x00001f1a:    b224        $.      SXTH     r4,r4
        0x00001f1c:    6b05        .k      LDR      r5,[r0,#0x30]
        0x00001f1e:    b22d        -.      SXTH     r5,r5
        0x00001f20:    6b40        @k      LDR      r0,[r0,#0x34]
        0x00001f22:    b206        ..      SXTH     r6,r0
        0x00001f24:    e027        '.      B        0x1f76 ; Inport_Plus_PWM + 286
        0x00001f26:    4819        .H      LDR      r0,[pc,#100] ; [0x1f8c] = 0x20000f4c
        0x00001f28:    6b01        .k      LDR      r1,[r0,#0x30]
        0x00001f2a:    b209        ..      SXTH     r1,r1
        0x00001f2c:    6b02        .k      LDR      r2,[r0,#0x30]
        0x00001f2e:    b212        ..      SXTH     r2,r2
        0x00001f30:    6b03        .k      LDR      r3,[r0,#0x30]
        0x00001f32:    b21b        ..      SXTH     r3,r3
        0x00001f34:    6b04        .k      LDR      r4,[r0,#0x30]
        0x00001f36:    b224        $.      SXTH     r4,r4
        0x00001f38:    6b05        .k      LDR      r5,[r0,#0x30]
        0x00001f3a:    b22d        -.      SXTH     r5,r5
        0x00001f3c:    6b00        .k      LDR      r0,[r0,#0x30]
        0x00001f3e:    b206        ..      SXTH     r6,r0
        0x00001f40:    e019        ..      B        0x1f76 ; Inport_Plus_PWM + 286
        0x00001f42:    4812        .H      LDR      r0,[pc,#72] ; [0x1f8c] = 0x20000f4c
        0x00001f44:    6b01        .k      LDR      r1,[r0,#0x30]
        0x00001f46:    b209        ..      SXTH     r1,r1
        0x00001f48:    6b02        .k      LDR      r2,[r0,#0x30]
        0x00001f4a:    b212        ..      SXTH     r2,r2
        0x00001f4c:    6b03        .k      LDR      r3,[r0,#0x30]
        0x00001f4e:    b21b        ..      SXTH     r3,r3
        0x00001f50:    6b04        .k      LDR      r4,[r0,#0x30]
        0x00001f52:    b224        $.      SXTH     r4,r4
        0x00001f54:    6b05        .k      LDR      r5,[r0,#0x30]
        0x00001f56:    b22d        -.      SXTH     r5,r5
        0x00001f58:    6b00        .k      LDR      r0,[r0,#0x30]
        0x00001f5a:    b206        ..      SXTH     r6,r0
        0x00001f5c:    e00b        ..      B        0x1f76 ; Inport_Plus_PWM + 286
        0x00001f5e:    490c        .I      LDR      r1,[pc,#48] ; [0x1f90] = 0x20000204
        0x00001f60:    202c        ,       MOVS     r0,#0x2c
        0x00001f62:    5e08        .^      LDRSH    r0,[r1,r0]
        0x00001f64:    17c1        ..      ASRS     r1,r0,#31
        0x00001f66:    0f89        ..      LSRS     r1,r1,#30
        0x00001f68:    1808        ..      ADDS     r0,r1,r0
        0x00001f6a:    1081        ..      ASRS     r1,r0,#2
        0x00001f6c:    460a        .F      MOV      r2,r1
        0x00001f6e:    460b        .F      MOV      r3,r1
        0x00001f70:    460c        .F      MOV      r4,r1
        0x00001f72:    460d        .F      MOV      r5,r1
        0x00001f74:    460e        .F      MOV      r6,r1
        0x00001f76:    4807        .H      LDR      r0,[pc,#28] ; [0x1f94] = 0x40046080
        0x00001f78:    6241        Ab      STR      r1,[r0,#0x24]
        0x00001f7a:    6344        Dc      STR      r4,[r0,#0x34]
        0x00001f7c:    6282        .b      STR      r2,[r0,#0x28]
        0x00001f7e:    6385        .c      STR      r5,[r0,#0x38]
        0x00001f80:    4805        .H      LDR      r0,[pc,#20] ; [0x1f98] = 0x40046000
        0x00001f82:    6243        Cb      STR      r3,[r0,#0x24]
        0x00001f84:    6346        Fc      STR      r6,[r0,#0x34]
        0x00001f86:    bcf0        ..      POP      {r4-r7}
        0x00001f88:    4770        pG      BX       lr
    $d
        0x00001f8a:    0000        ..      DCW    0
        0x00001f8c:    20000f4c    L..     DCD    536874828
        0x00001f90:    20000204    ...     DCD    536871428
        0x00001f94:    40046080    .`.@    DCD    1074028672
        0x00001f98:    40046000    .`.@    DCD    1074028544
    $t
    i.LPF_Func
    LPF_Func
        0x00001f9c:    b5f8        ..      PUSH     {r3-r7,lr}
        0x00001f9e:    4841        AH      LDR      r0,[pc,#260] ; [0x20a4] = 0x20000010
        0x00001fa0:    4c41        AL      LDR      r4,[pc,#260] ; [0x20a8] = 0x20000064
        0x00001fa2:    7800        .x      LDRB     r0,[r0,#0]
        0x00001fa4:    2500        .%      MOVS     r5,#0
        0x00001fa6:    2807        .(      CMP      r0,#7
        0x00001fa8:    d000        ..      BEQ      0x1fac ; LPF_Func + 16
        0x00001faa:    8365        e.      STRH     r5,[r4,#0x1a]
        0x00001fac:    2801        .(      CMP      r0,#1
        0x00001fae:    d033        3.      BEQ      0x2018 ; LPF_Func + 124
        0x00001fb0:    2800        .(      CMP      r0,#0
        0x00001fb2:    d031        1.      BEQ      0x2018 ; LPF_Func + 124
        0x00001fb4:    483d        =H      LDR      r0,[pc,#244] ; [0x20ac] = 0x20000268
        0x00001fb6:    2114        .!      MOVS     r1,#0x14
        0x00001fb8:    6ec0        .n      LDR      r0,[r0,#0x6c]
        0x00001fba:    5e61        a^      LDRSH    r1,[r4,r1]
        0x00001fbc:    b202        ..      SXTH     r2,r0
        0x00001fbe:    2014        .       MOVS     r0,#0x14
        0x00001fc0:    f000f88e    ....    BL       LPF_General ; 0x20e0
        0x00001fc4:    82e0        ..      STRH     r0,[r4,#0x16]
        0x00001fc6:    4b3a        :K      LDR      r3,[pc,#232] ; [0x20b0] = 0x2000023a
        0x00001fc8:    221e        ."      MOVS     r2,#0x1e
        0x00001fca:    5e9a        .^      LDRSH    r2,[r3,r2]
        0x00001fcc:    212a        *!      MOVS     r1,#0x2a
        0x00001fce:    5e61        a^      LDRSH    r1,[r4,r1]
        0x00001fd0:    2014        .       MOVS     r0,#0x14
        0x00001fd2:    f000f885    ....    BL       LPF_General ; 0x20e0
        0x00001fd6:    8520         .      STRH     r0,[r4,#0x28]
        0x00001fd8:    221c        ."      MOVS     r2,#0x1c
        0x00001fda:    5e9a        .^      LDRSH    r2,[r3,r2]
        0x00001fdc:    212e        .!      MOVS     r1,#0x2e
        0x00001fde:    5e61        a^      LDRSH    r1,[r4,r1]
        0x00001fe0:    2014        .       MOVS     r0,#0x14
        0x00001fe2:    f000f87d    ..}.    BL       LPF_General ; 0x20e0
        0x00001fe6:    85a0        ..      STRH     r0,[r4,#0x2c]
        0x00001fe8:    2216        ."      MOVS     r2,#0x16
        0x00001fea:    5e9a        .^      LDRSH    r2,[r3,r2]
        0x00001fec:    2122        "!      MOVS     r1,#0x22
        0x00001fee:    5e61        a^      LDRSH    r1,[r4,r1]
        0x00001ff0:    2014        .       MOVS     r0,#0x14
        0x00001ff2:    f000f875    ..u.    BL       LPF_General ; 0x20e0
        0x00001ff6:    8420         .      STRH     r0,[r4,#0x20]
        0x00001ff8:    200c        .       MOVS     r0,#0xc
        0x00001ffa:    5e20         ^      LDRSH    r0,[r4,r0]
        0x00001ffc:    f7fefa7e    ..~.    BL       __aeabi_i2d ; 0x4fc
        0x00002000:    2200        ."      MOVS     r2,#0
        0x00002002:    4b2c        ,K      LDR      r3,[pc,#176] ; [0x20b4] = 0x40dfffc0
        0x00002004:    f7fef9ec    ....    BL       __aeabi_ddiv ; 0x3e0
        0x00002008:    2200        ."      MOVS     r2,#0
        0x0000200a:    4b2b        +K      LDR      r3,[pc,#172] ; [0x20b8] = 0x40b77000
        0x0000200c:    f7fef980    ....    BL       __aeabi_dmul ; 0x310
        0x00002010:    f7fefaba    ....    BL       __aeabi_d2uiz ; 0x588
        0x00002014:    8260        `.      STRH     r0,[r4,#0x12]
        0x00002016:    e000        ..      B        0x201a ; LPF_Func + 126
        0x00002018:    81a5        ..      STRH     r5,[r4,#0xc]
        0x0000201a:    4828        (H      LDR      r0,[pc,#160] ; [0x20bc] = 0x40049080
        0x0000201c:    6940        @i      LDR      r0,[r0,#0x14]
        0x0000201e:    4f28        (O      LDR      r7,[pc,#160] ; [0x20c0] = 0x200000f4
        0x00002020:    0500        ..      LSLS     r0,r0,#20
        0x00002022:    0c40        @.      LSRS     r0,r0,#17
        0x00002024:    8038        8.      STRH     r0,[r7,#0]
        0x00002026:    2200        ."      MOVS     r2,#0
        0x00002028:    2106        .!      MOVS     r1,#6
        0x0000202a:    5eba        .^      LDRSH    r2,[r7,r2]
        0x0000202c:    5e61        a^      LDRSH    r1,[r4,r1]
        0x0000202e:    2014        .       MOVS     r0,#0x14
        0x00002030:    f000f856    ..V.    BL       LPF_General ; 0x20e0
        0x00002034:    b286        ..      UXTH     r6,r0
        0x00002036:    80a6        ..      STRH     r6,[r4,#4]
        0x00002038:    4630        0F      MOV      r0,r6
        0x0000203a:    f7fefa73    ..s.    BL       __aeabi_ui2d ; 0x524
        0x0000203e:    4a21        !J      LDR      r2,[pc,#132] ; [0x20c4] = 0xcccccccd
        0x00002040:    4b21        !K      LDR      r3,[pc,#132] ; [0x20c8] = 0x4040cccc
        0x00002042:    f7fef965    ..e.    BL       __aeabi_dmul ; 0x310
        0x00002046:    220e        ."      MOVS     r2,#0xe
        0x00002048:    43d2        .C      MVNS     r2,r2
        0x0000204a:    f7fefa41    ..A.    BL       __ARM_scalbn ; 0x4d0
        0x0000204e:    f7fefa9b    ....    BL       __aeabi_d2uiz ; 0x588
        0x00002052:    8060        `.      STRH     r0,[r4,#2]
        0x00002054:    481d        .H      LDR      r0,[pc,#116] ; [0x20cc] = 0xffffcaab
        0x00002056:    4a1e        .J      LDR      r2,[pc,#120] ; [0x20d0] = 0x3185
        0x00002058:    1831        1.      ADDS     r1,r6,r0
        0x0000205a:    481e        .H      LDR      r0,[pc,#120] ; [0x20d4] = 0x20000000
        0x0000205c:    4291        .B      CMP      r1,r2
        0x0000205e:    d202        ..      BCS      0x2066 ; LPF_Func + 202
        0x00002060:    2101        .!      MOVS     r1,#1
        0x00002062:    7081        .p      STRB     r1,[r0,#2]
        0x00002064:    e000        ..      B        0x2068 ; LPF_Func + 204
        0x00002066:    7085        .p      STRB     r5,[r0,#2]
        0x00002068:    481b        .H      LDR      r0,[pc,#108] ; [0x20d8] = 0x40049040
        0x0000206a:    6840        @h      LDR      r0,[r0,#4]
        0x0000206c:    0500        ..      LSLS     r0,r0,#20
        0x0000206e:    0c40        @.      LSRS     r0,r0,#17
        0x00002070:    8078        x.      STRH     r0,[r7,#2]
        0x00002072:    4a1a        .J      LDR      r2,[pc,#104] ; [0x20dc] = 0x20000160
        0x00002074:    2118        .!      MOVS     r1,#0x18
        0x00002076:    5e51        Q^      LDRSH    r1,[r2,r1]
        0x00002078:    4288        .B      CMP      r0,r1
        0x0000207a:    dd02        ..      BLE      0x2082 ; LPF_Func + 230
        0x0000207c:    1a40        @.      SUBS     r0,r0,r1
        0x0000207e:    8078        x.      STRH     r0,[r7,#2]
        0x00002080:    e000        ..      B        0x2084 ; LPF_Func + 232
        0x00002082:    807d        }.      STRH     r5,[r7,#2]
        0x00002084:    2202        ."      MOVS     r2,#2
        0x00002086:    210a        .!      MOVS     r1,#0xa
        0x00002088:    5eba        .^      LDRSH    r2,[r7,r2]
        0x0000208a:    5e61        a^      LDRSH    r1,[r4,r1]
        0x0000208c:    2014        .       MOVS     r0,#0x14
        0x0000208e:    f000f827    ..'.    BL       LPF_General ; 0x20e0
        0x00002092:    b281        ..      UXTH     r1,r0
        0x00002094:    8121        !.      STRH     r1,[r4,#8]
        0x00002096:    88a0        ..      LDRH     r0,[r4,#4]
        0x00002098:    4348        HC      MULS     r0,r1,r0
        0x0000209a:    60b8        .`      STR      r0,[r7,#8]
        0x0000209c:    1300        ..      ASRS     r0,r0,#12
        0x0000209e:    8360        `.      STRH     r0,[r4,#0x1a]
        0x000020a0:    bdf8        ..      POP      {r3-r7,pc}
    $d
        0x000020a2:    0000        ..      DCW    0
        0x000020a4:    20000010    ...     DCD    536870928
        0x000020a8:    20000064    d..     DCD    536871012
        0x000020ac:    20000268    h..     DCD    536871528
        0x000020b0:    2000023a    :..     DCD    536871482
        0x000020b4:    40dfffc0    ...@    DCD    1088421824
        0x000020b8:    40b77000    .p.@    DCD    1085763584
        0x000020bc:    40049080    ...@    DCD    1074040960
        0x000020c0:    200000f4    ...     DCD    536871156
        0x000020c4:    cccccccd    ....    DCD    3435973837
        0x000020c8:    4040cccc    ..@@    DCD    1077988556
        0x000020cc:    ffffcaab    ....    DCD    4294953643
        0x000020d0:    00003185    .1..    DCD    12677
        0x000020d4:    20000000    ...     DCD    536870912
        0x000020d8:    40049040    @..@    DCD    1074040896
        0x000020dc:    20000160    `..     DCD    536871264
    $t
    i.LPF_General
    LPF_General
        0x000020e0:    1a89        ..      SUBS     r1,r1,r2
        0x000020e2:    4341        AC      MULS     r1,r0,r1
        0x000020e4:    13c8        ..      ASRS     r0,r1,#15
        0x000020e6:    1810        ..      ADDS     r0,r2,r0
        0x000020e8:    b200        ..      SXTH     r0,r0
        0x000020ea:    4770        pG      BX       lr
    i.MC_Control
    MC_Control
        0x000020ec:    b570        p.      PUSH     {r4-r6,lr}
        0x000020ee:    483b        ;H      LDR      r0,[pc,#236] ; [0x21dc] = 0x20000010
        0x000020f0:    7800        .x      LDRB     r0,[r0,#0]
        0x000020f2:    280c        .(      CMP      r0,#0xc
        0x000020f4:    d218        ..      BCS      0x2128 ; MC_Control + 60
        0x000020f6:    0001        ..      MOVS     r1,r0
        0x000020f8:    4479        yD      ADD      r1,r1,pc
        0x000020fa:    7909        .y      LDRB     r1,[r1,#4]
        0x000020fc:    1849        I.      ADDS     r1,r1,r1
        0x000020fe:    448f        .D      ADD      pc,pc,r1
    $d
        0x00002100:    271d1405    ...'    DCD    656217093
        0x00002104:    4643402a    *@CF    DCD    1178812458
        0x00002108:    6113504b    KP.a    DCD    1628655691
    $t
        0x0000210c:    f000f95a    ..Z.    BL       Motor_Ready ; 0x23c4
        0x00002110:    4833        3H      LDR      r0,[pc,#204] ; [0x21e0] = 0x20000180
        0x00002112:    7880        .x      LDRB     r0,[r0,#2]
        0x00002114:    2801        .(      CMP      r0,#1
        0x00002116:    d107        ..      BNE      0x2128 ; MC_Control + 60
        0x00002118:    4832        2H      LDR      r0,[pc,#200] ; [0x21e4] = 0x200000d0
        0x0000211a:    7b80        .{      LDRB     r0,[r0,#0xe]
        0x0000211c:    2801        .(      CMP      r0,#1
        0x0000211e:    d103        ..      BNE      0x2128 ; MC_Control + 60
        0x00002120:    492e        .I      LDR      r1,[pc,#184] ; [0x21dc] = 0x20000010
        0x00002122:    7008        .p      STRB     r0,[r1,#0]
        0x00002124:    f7feffda    ....    BL       FGOutput_Timer ; 0x10dc
        0x00002128:    bd70        p.      POP      {r4-r6,pc}
        0x0000212a:    f000f939    ..9.    BL       Motor_Init ; 0x23a0
        0x0000212e:    492b        +I      LDR      r1,[pc,#172] ; [0x21dc] = 0x20000010
        0x00002130:    2002        .       MOVS     r0,#2
        0x00002132:    7008        .p      STRB     r0,[r1,#0]
        0x00002134:    492c        ,I      LDR      r1,[pc,#176] ; [0x21e8] = 0x20000064
        0x00002136:    201e        .       MOVS     r0,#0x1e
        0x00002138:    64c8        .d      STR      r0,[r1,#0x4c]
        0x0000213a:    bd70        p.      POP      {r4-r6,pc}
        0x0000213c:    f000f8e6    ....    BL       Motor_Charge ; 0x230c
        0x00002140:    4829        )H      LDR      r0,[pc,#164] ; [0x21e8] = 0x20000064
        0x00002142:    6cc0        .l      LDR      r0,[r0,#0x4c]
        0x00002144:    2800        .(      CMP      r0,#0
        0x00002146:    d1f8        ..      BNE      0x213a ; MC_Control + 78
        0x00002148:    4924        $I      LDR      r1,[pc,#144] ; [0x21dc] = 0x20000010
        0x0000214a:    2003        .       MOVS     r0,#3
        0x0000214c:    7008        .p      STRB     r0,[r1,#0]
        0x0000214e:    bd70        p.      POP      {r4-r6,pc}
        0x00002150:    f000f95e    ..^.    BL       Motor_TailWind ; 0x2410
        0x00002154:    bd70        p.      POP      {r4-r6,pc}
        0x00002156:    4d25        %M      LDR      r5,[pc,#148] ; [0x21ec] = 0x20000f4c
        0x00002158:    2401        .$      MOVS     r4,#1
        0x0000215a:    63ac        .c      STR      r4,[r5,#0x38]
        0x0000215c:    f000fbe0    ....    BL       RIPD_GetRisingCurrentFunct ; 0x2920
        0x00002160:    6be8        .k      LDR      r0,[r5,#0x3c]
        0x00002162:    2800        .(      CMP      r0,#0
        0x00002164:    d0f6        ..      BEQ      0x2154 ; MC_Control + 104
        0x00002166:    f7fffd91    ....    BL       Init_ADC ; 0x1c8c
        0x0000216a:    491c        .I      LDR      r1,[pc,#112] ; [0x21dc] = 0x20000010
        0x0000216c:    2007        .       MOVS     r0,#7
        0x0000216e:    7008        .p      STRB     r0,[r1,#0]
        0x00002170:    4920         I      LDR      r1,[pc,#128] ; [0x21f4] = 0x2000023a
        0x00002172:    481f        .H      LDR      r0,[pc,#124] ; [0x21f0] = 0xaaa
        0x00002174:    8348        H.      STRH     r0,[r1,#0x1a]
        0x00002176:    4820         H      LDR      r0,[pc,#128] ; [0x21f8] = 0x200002c8
        0x00002178:    7284        .r      STRB     r4,[r0,#0xa]
        0x0000217a:    4920         I      LDR      r1,[pc,#128] ; [0x21fc] = 0x20000268
        0x0000217c:    2000        .       MOVS     r0,#0
        0x0000217e:    6588        .e      STR      r0,[r1,#0x58]
        0x00002180:    bd70        p.      POP      {r4-r6,pc}
        0x00002182:    f000f843    ..C.    BL       Motor_Align ; 0x220c
        0x00002186:    bd70        p.      POP      {r4-r6,pc}
        0x00002188:    f000f912    ....    BL       Motor_Open ; 0x23b0
        0x0000218c:    bd70        p.      POP      {r4-r6,pc}
        0x0000218e:    f7fefcd5    ....    BL       FOC_Algorithm ; 0xb3c
        0x00002192:    f000f92b    ..+.    BL       Motor_Stop ; 0x23ec
        0x00002196:    bd70        p.      POP      {r4-r6,pc}
        0x00002198:    f7feff84    ....    BL       Cancel_FGTimer ; 0x10a4
        0x0000219c:    f000f926    ..&.    BL       Motor_Stop ; 0x23ec
        0x000021a0:    bd70        p.      POP      {r4-r6,pc}
        0x000021a2:    4811        .H      LDR      r0,[pc,#68] ; [0x21e8] = 0x20000064
        0x000021a4:    6cc0        .l      LDR      r0,[r0,#0x4c]
        0x000021a6:    2800        .(      CMP      r0,#0
        0x000021a8:    d1fa        ..      BNE      0x21a0 ; MC_Control + 180
        0x000021aa:    f7feff7b    ..{.    BL       Cancel_FGTimer ; 0x10a4
        0x000021ae:    4915        .I      LDR      r1,[pc,#84] ; [0x2204] = 0x40046400
        0x000021b0:    4813        .H      LDR      r0,[pc,#76] ; [0x2200] = 0xffff
        0x000021b2:    6048        H`      STR      r0,[r1,#4]
        0x000021b4:    f000fa34    ..4.    BL       PORT_SixDrive_DisEnable ; 0x2620
        0x000021b8:    490a        .I      LDR      r1,[pc,#40] ; [0x21e4] = 0x200000d0
        0x000021ba:    2000        .       MOVS     r0,#0
        0x000021bc:    7388        .s      STRB     r0,[r1,#0xe]
        0x000021be:    4907        .I      LDR      r1,[pc,#28] ; [0x21dc] = 0x20000010
        0x000021c0:    7008        .p      STRB     r0,[r1,#0]
        0x000021c2:    bd70        p.      POP      {r4-r6,pc}
        0x000021c4:    f7fff82a    ..*.    BL       FaultProcess ; 0x121c
        0x000021c8:    f7feff6c    ..l.    BL       Cancel_FGTimer ; 0x10a4
        0x000021cc:    480e        .H      LDR      r0,[pc,#56] ; [0x2208] = 0x20000018
        0x000021ce:    7800        .x      LDRB     r0,[r0,#0]
        0x000021d0:    2800        .(      CMP      r0,#0
        0x000021d2:    d1f6        ..      BNE      0x21c2 ; MC_Control + 214
        0x000021d4:    4901        .I      LDR      r1,[pc,#4] ; [0x21dc] = 0x20000010
        0x000021d6:    7008        .p      STRB     r0,[r1,#0]
        0x000021d8:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x000021da:    0000        ..      DCW    0
        0x000021dc:    20000010    ...     DCD    536870928
        0x000021e0:    20000180    ...     DCD    536871296
        0x000021e4:    200000d0    ...     DCD    536871120
        0x000021e8:    20000064    d..     DCD    536871012
        0x000021ec:    20000f4c    L..     DCD    536874828
        0x000021f0:    00000aaa    ....    DCD    2730
        0x000021f4:    2000023a    :..     DCD    536871482
        0x000021f8:    200002c8    ...     DCD    536871624
        0x000021fc:    20000268    h..     DCD    536871528
        0x00002200:    0000ffff    ....    DCD    65535
        0x00002204:    40046400    .d.@    DCD    1074029568
        0x00002208:    20000018    ...     DCD    536870936
    $t
    i.Motor_Align
    Motor_Align
        0x0000220c:    b5f8        ..      PUSH     {r3-r7,lr}
        0x0000220e:    4d33        3M      LDR      r5,[pc,#204] ; [0x22dc] = 0x200002c8
        0x00002210:    2700        .'      MOVS     r7,#0
        0x00002212:    72af        .r      STRB     r7,[r5,#0xa]
        0x00002214:    4832        2H      LDR      r0,[pc,#200] ; [0x22e0] = 0x20000011
        0x00002216:    78c1        .x      LDRB     r1,[r0,#3]
        0x00002218:    2900        .)      CMP      r1,#0
        0x0000221a:    d101        ..      BNE      0x2220 ; Motor_Align + 20
