747lulu747/SAOZHAN_BRUASH/src/SDK-LIB/华芯第一版本硬件-非FPC/ROMAN-21DD - SDK - V0.1/out/SWM211.asm
        0x0000221c:    2101        .!      MOVS     r1,#1
        0x0000221e:    70c1        .p      STRB     r1,[r0,#3]
        0x00002220:    4c30        0L      LDR      r4,[pc,#192] ; [0x22e4] = 0x2000023a
        0x00002222:    8327        '.      STRH     r7,[r4,#0x18]
        0x00002224:    4620         F      MOV      r0,r4
        0x00002226:    f7fefc77    ..w.    BL       Clake_Cale ; 0xb18
        0x0000222a:    4e2f        /N      LDR      r6,[pc,#188] ; [0x22e8] = 0x200002a8
        0x0000222c:    89b0        ..      LDRH     r0,[r6,#0xc]
        0x0000222e:    84a0        ..      STRH     r0,[r4,#0x24]
        0x00002230:    4620         F      MOV      r0,r4
        0x00002232:    f000fcab    ....    BL       Sin_Cos_Cale ; 0x2b8c
        0x00002236:    4620         F      MOV      r0,r4
        0x00002238:    f7fefc4d    ..M.    BL       Park_Cale ; 0xad6
        0x0000223c:    f7fefc34    ..4.    BL       CurrentLoop ; 0xaa8
        0x00002240:    4620         F      MOV      r0,r4
        0x00002242:    f7fefc10    ....    BL       InvPark_Cale ; 0xa66
        0x00002246:    89a1        ..      LDRH     r1,[r4,#0xc]
        0x00002248:    4828        (H      LDR      r0,[pc,#160] ; [0x22ec] = 0x2000002c
        0x0000224a:    8001        ..      STRH     r1,[r0,#0]
        0x0000224c:    89e1        ..      LDRH     r1,[r4,#0xe]
        0x0000224e:    8041        A.      STRH     r1,[r0,#2]
        0x00002250:    4927        'I      LDR      r1,[pc,#156] ; [0x22f0] = 0x20000204
        0x00002252:    f7fefac1    ....    BL       mc_svpwmtrfm ; 0x7d8
        0x00002256:    4c27        'L      LDR      r4,[pc,#156] ; [0x22f4] = 0x20000064
        0x00002258:    4922        "I      LDR      r1,[pc,#136] ; [0x22e4] = 0x2000023a
        0x0000225a:    88a2        ..      LDRH     r2,[r4,#4]
        0x0000225c:    4824        $H      LDR      r0,[pc,#144] ; [0x22f0] = 0x20000204
        0x0000225e:    f7fefa69    ..i.    BL       mc_phasevoltcalc ; 0x734
        0x00002262:    f7fefd21    ..!.    BL       SMO_Observer ; 0xca8
        0x00002266:    8860        `.      LDRH     r0,[r4,#2]
        0x00002268:    281b        .(      CMP      r0,#0x1b
        0x0000226a:    d906        ..      BLS      0x227a ; Motor_Align + 110
        0x0000226c:    2030        0       MOVS     r0,#0x30
        0x0000226e:    5e20         ^      LDRSH    r0,[r4,r0]
        0x00002270:    2800        .(      CMP      r0,#0
        0x00002272:    da09        ..      BGE      0x2288 ; Motor_Align + 124
        0x00002274:    1c40        @.      ADDS     r0,r0,#1
        0x00002276:    8620         .      STRH     r0,[r4,#0x30]
        0x00002278:    e006        ..      B        0x2288 ; Motor_Align + 124
        0x0000227a:    2030        0       MOVS     r0,#0x30
        0x0000227c:    5e20         ^      LDRSH    r0,[r4,r0]
        0x0000227e:    491e        .I      LDR      r1,[pc,#120] ; [0x22f8] = 0xfffffbbc
        0x00002280:    4288        .B      CMP      r0,r1
        0x00002282:    dd01        ..      BLE      0x2288 ; Motor_Align + 124
        0x00002284:    1e40        @.      SUBS     r0,r0,#1
        0x00002286:    8620         .      STRH     r0,[r4,#0x30]
        0x00002288:    4816        .H      LDR      r0,[pc,#88] ; [0x22e4] = 0x2000023a
        0x0000228a:    8e21        !.      LDRH     r1,[r4,#0x30]
        0x0000228c:    8341        A.      STRH     r1,[r0,#0x1a]
        0x0000228e:    210a        .!      MOVS     r1,#0xa
        0x00002290:    5e71        q^      LDRSH    r1,[r6,r1]
        0x00002292:    6b60        `k      LDR      r0,[r4,#0x34]
        0x00002294:    4a19        .J      LDR      r2,[pc,#100] ; [0x22fc] = 0x1999
        0x00002296:    1a09        ..      SUBS     r1,r1,r0
        0x00002298:    4351        QC      MULS     r1,r2,r1
        0x0000229a:    13c9        ..      ASRS     r1,r1,#15
        0x0000229c:    1808        ..      ADDS     r0,r1,r0
        0x0000229e:    6360        `c      STR      r0,[r4,#0x34]
        0x000022a0:    b200        ..      SXTH     r0,r0
        0x000022a2:    f7fefeae    ....    BL       Abs_F15 ; 0x1002
        0x000022a6:    2851        Q(      CMP      r0,#0x51
        0x000022a8:    d902        ..      BLS      0x22b0 ; Motor_Align + 164
        0x000022aa:    6ce0        .l      LDR      r0,[r4,#0x4c]
        0x000022ac:    2800        .(      CMP      r0,#0
        0x000022ae:    dc06        ..      BGT      0x22be ; Motor_Align + 178
        0x000022b0:    6be1        .k      LDR      r1,[r4,#0x3c]
        0x000022b2:    6ba0        .k      LDR      r0,[r4,#0x38]
        0x000022b4:    4288        .B      CMP      r0,r1
        0x000022b6:    dd02        ..      BLE      0x22be ; Motor_Align + 178
        0x000022b8:    63a7        .c      STR      r7,[r4,#0x38]
        0x000022ba:    2001        .       MOVS     r0,#1
        0x000022bc:    8660        `.      STRH     r0,[r4,#0x32]
        0x000022be:    8e60        `.      LDRH     r0,[r4,#0x32]
        0x000022c0:    2801        .(      CMP      r0,#1
        0x000022c2:    d109        ..      BNE      0x22d8 ; Motor_Align + 204
        0x000022c4:    490e        .I      LDR      r1,[pc,#56] ; [0x2300] = 0x20000010
        0x000022c6:    2007        .       MOVS     r0,#7
        0x000022c8:    7008        .p      STRB     r0,[r1,#0]
        0x000022ca:    4806        .H      LDR      r0,[pc,#24] ; [0x22e4] = 0x2000023a
        0x000022cc:    490d        .I      LDR      r1,[pc,#52] ; [0x2304] = 0x666
        0x000022ce:    8341        A.      STRH     r1,[r0,#0x1a]
        0x000022d0:    2001        .       MOVS     r0,#1
        0x000022d2:    72a8        .r      STRB     r0,[r5,#0xa]
        0x000022d4:    480c        .H      LDR      r0,[pc,#48] ; [0x2308] = 0x20000268
        0x000022d6:    6587        .e      STR      r7,[r0,#0x58]
        0x000022d8:    bdf8        ..      POP      {r3-r7,pc}
    $d
        0x000022da:    0000        ..      DCW    0
        0x000022dc:    200002c8    ...     DCD    536871624
        0x000022e0:    20000011    ...     DCD    536870929
        0x000022e4:    2000023a    :..     DCD    536871482
        0x000022e8:    200002a8    ...     DCD    536871592
        0x000022ec:    2000002c    ,..     DCD    536870956
        0x000022f0:    20000204    ...     DCD    536871428
        0x000022f4:    20000064    d..     DCD    536871012
        0x000022f8:    fffffbbc    ....    DCD    4294966204
        0x000022fc:    00001999    ....    DCD    6553
        0x00002300:    20000010    ...     DCD    536870928
        0x00002304:    00000666    f...    DCD    1638
        0x00002308:    20000268    h..     DCD    536871528
    $t
    i.Motor_Charge
    Motor_Charge
        0x0000230c:    b470        p.      PUSH     {r4-r6}
        0x0000230e:    491d        .I      LDR      r1,[pc,#116] ; [0x2384] = 0x20000011
        0x00002310:    2201        ."      MOVS     r2,#1
        0x00002312:    784c        Lx      LDRB     r4,[r1,#1]
        0x00002314:    4b1c        .K      LDR      r3,[pc,#112] ; [0x2388] = 0x40046400
        0x00002316:    481d        .H      LDR      r0,[pc,#116] ; [0x238c] = 0x200000a4
        0x00002318:    2c00        .,      CMP      r4,#0
        0x0000231a:    d104        ..      BNE      0x2326 ; Motor_Charge + 26
        0x0000231c:    704a        Jp      STRB     r2,[r1,#1]
        0x0000231e:    2100        .!      MOVS     r1,#0
        0x00002320:    8141        A.      STRH     r1,[r0,#0xa]
        0x00002322:    491b        .I      LDR      r1,[pc,#108] ; [0x2390] = 0xffff
        0x00002324:    6059        Y`      STR      r1,[r3,#4]
        0x00002326:    491b        .I      LDR      r1,[pc,#108] ; [0x2394] = 0x20000064
        0x00002328:    2502        .%      MOVS     r5,#2
        0x0000232a:    6cc9        .l      LDR      r1,[r1,#0x4c]
        0x0000232c:    291e        .)      CMP      r1,#0x1e
        0x0000232e:    da10        ..      BGE      0x2352 ; Motor_Charge + 70
        0x00002330:    8944        D.      LDRH     r4,[r0,#0xa]
        0x00002332:    2c00        .,      CMP      r4,#0
        0x00002334:    d10d        ..      BNE      0x2352 ; Motor_Charge + 70
        0x00002336:    8142        B.      STRH     r2,[r0,#0xa]
        0x00002338:    22ff        ."      MOVS     r2,#0xff
        0x0000233a:    4c17        .L      LDR      r4,[pc,#92] ; [0x2398] = 0x40046080
        0x0000233c:    321a        .2      ADDS     r2,r2,#0x1a
        0x0000233e:    6262        bb      STR      r2,[r4,#0x24]
        0x00002340:    62a2        .b      STR      r2,[r4,#0x28]
        0x00002342:    4e16        .N      LDR      r6,[pc,#88] ; [0x239c] = 0x40046000
        0x00002344:    6272        rb      STR      r2,[r6,#0x24]
        0x00002346:    6362        bc      STR      r2,[r4,#0x34]
        0x00002348:    63a2        .c      STR      r2,[r4,#0x38]
        0x0000234a:    6372        rc      STR      r2,[r6,#0x34]
        0x0000234c:    685a        Zh      LDR      r2,[r3,#4]
        0x0000234e:    43aa        .C      BICS     r2,r2,r5
        0x00002350:    605a        Z`      STR      r2,[r3,#4]
        0x00002352:    2914        .)      CMP      r1,#0x14
        0x00002354:    dc08        ..      BGT      0x2368 ; Motor_Charge + 92
        0x00002356:    8942        B.      LDRH     r2,[r0,#0xa]
        0x00002358:    2a01        .*      CMP      r2,#1
        0x0000235a:    d105        ..      BNE      0x2368 ; Motor_Charge + 92
        0x0000235c:    8145        E.      STRH     r5,[r0,#0xa]
        0x0000235e:    685a        Zh      LDR      r2,[r3,#4]
        0x00002360:    2401        .$      MOVS     r4,#1
        0x00002362:    0264        d.      LSLS     r4,r4,#9
        0x00002364:    43a2        .C      BICS     r2,r2,r4
        0x00002366:    605a        Z`      STR      r2,[r3,#4]
        0x00002368:    290a        .)      CMP      r1,#0xa
        0x0000236a:    dc08        ..      BGT      0x237e ; Motor_Charge + 114
        0x0000236c:    8941        A.      LDRH     r1,[r0,#0xa]
        0x0000236e:    2902        .)      CMP      r1,#2
        0x00002370:    d105        ..      BNE      0x237e ; Motor_Charge + 114
        0x00002372:    2103        .!      MOVS     r1,#3
        0x00002374:    8141        A.      STRH     r1,[r0,#0xa]
        0x00002376:    6858        Xh      LDR      r0,[r3,#4]
        0x00002378:    0840        @.      LSRS     r0,r0,#1
        0x0000237a:    0040        @.      LSLS     r0,r0,#1
        0x0000237c:    6058        X`      STR      r0,[r3,#4]
        0x0000237e:    bc70        p.      POP      {r4-r6}
        0x00002380:    4770        pG      BX       lr
    $d
        0x00002382:    0000        ..      DCW    0
        0x00002384:    20000011    ...     DCD    536870929
        0x00002388:    40046400    .d.@    DCD    1074029568
        0x0000238c:    200000a4    ...     DCD    536871076
        0x00002390:    0000ffff    ....    DCD    65535
        0x00002394:    20000064    d..     DCD    536871012
        0x00002398:    40046080    .`.@    DCD    1074028672
        0x0000239c:    40046000    .`.@    DCD    1074028544
    $t
    i.Motor_Init
    Motor_Init
        0x000023a0:    b510        ..      PUSH     {r4,lr}
        0x000023a2:    f000f975    ..u.    BL       PORT_SixDrive_Enable ; 0x2690
        0x000023a6:    f001f919    ....    BL       VariablesPreInit ; 0x35dc
        0x000023aa:    f7feff09    ....    BL       FOC_Init ; 0x11c0
        0x000023ae:    bd10        ..      POP      {r4,pc}
    i.Motor_Open
    Motor_Open
        0x000023b0:    4803        .H      LDR      r0,[pc,#12] ; [0x23c0] = 0x20000011
        0x000023b2:    7941        Ay      LDRB     r1,[r0,#5]
        0x000023b4:    2900        .)      CMP      r1,#0
        0x000023b6:    d101        ..      BNE      0x23bc ; Motor_Open + 12
        0x000023b8:    2101        .!      MOVS     r1,#1
        0x000023ba:    7141        Aq      STRB     r1,[r0,#5]
        0x000023bc:    4770        pG      BX       lr
    $d
        0x000023be:    0000        ..      DCW    0
        0x000023c0:    20000011    ...     DCD    536870929
    $t
    i.Motor_Ready
    Motor_Ready
        0x000023c4:    b510        ..      PUSH     {r4,lr}
        0x000023c6:    4806        .H      LDR      r0,[pc,#24] ; [0x23e0] = 0x20000011
        0x000023c8:    7801        .x      LDRB     r1,[r0,#0]
        0x000023ca:    2900        .)      CMP      r1,#0
        0x000023cc:    d104        ..      BNE      0x23d8 ; Motor_Ready + 20
        0x000023ce:    2101        .!      MOVS     r1,#1
        0x000023d0:    7001        .p      STRB     r1,[r0,#0]
        0x000023d2:    4905        .I      LDR      r1,[pc,#20] ; [0x23e8] = 0x40046400
        0x000023d4:    4803        .H      LDR      r0,[pc,#12] ; [0x23e4] = 0xffff
        0x000023d6:    6048        H`      STR      r0,[r1,#4]
        0x000023d8:    f7fff9f4    ....    BL       GetCurrentOffset ; 0x17c4
        0x000023dc:    bd10        ..      POP      {r4,pc}
    $d
        0x000023de:    0000        ..      DCW    0
        0x000023e0:    20000011    ...     DCD    536870929
        0x000023e4:    0000ffff    ....    DCD    65535
        0x000023e8:    40046400    .d.@    DCD    1074029568
    $t
    i.Motor_Stop
    Motor_Stop
        0x000023ec:    4804        .H      LDR      r0,[pc,#16] ; [0x2400] = 0x200000d0
        0x000023ee:    7b80        .{      LDRB     r0,[r0,#0xe]
        0x000023f0:    2800        .(      CMP      r0,#0
        0x000023f2:    d104        ..      BNE      0x23fe ; Motor_Stop + 18
        0x000023f4:    4903        .I      LDR      r1,[pc,#12] ; [0x2404] = 0x20000010
        0x000023f6:    7008        .p      STRB     r0,[r1,#0]
        0x000023f8:    4904        .I      LDR      r1,[pc,#16] ; [0x240c] = 0x40046400
        0x000023fa:    4803        .H      LDR      r0,[pc,#12] ; [0x2408] = 0xffff
        0x000023fc:    6048        H`      STR      r0,[r1,#4]
        0x000023fe:    4770        pG      BX       lr
    $d
        0x00002400:    200000d0    ...     DCD    536871120
        0x00002404:    20000010    ...     DCD    536870928
        0x00002408:    0000ffff    ....    DCD    65535
        0x0000240c:    40046400    .d.@    DCD    1074029568
    $t
    i.Motor_TailWind
    Motor_TailWind
        0x00002410:    b510        ..      PUSH     {r4,lr}
        0x00002412:    4c0a        .L      LDR      r4,[pc,#40] ; [0x243c] = 0x20000011
        0x00002414:    7920         y      LDRB     r0,[r4,#4]
        0x00002416:    2800        .(      CMP      r0,#0
        0x00002418:    d103        ..      BNE      0x2422 ; Motor_TailWind + 18
        0x0000241a:    2001        .       MOVS     r0,#1
        0x0000241c:    7120         q      STRB     r0,[r4,#4]
        0x0000241e:    f000ffc1    ....    BL       TailWindDetectInit ; 0x33a4
        0x00002422:    7920         y      LDRB     r0,[r4,#4]
        0x00002424:    2801        .(      CMP      r0,#1
        0x00002426:    d107        ..      BNE      0x2438 ; Motor_TailWind + 40
        0x00002428:    f7fefbda    ....    BL       mcTailWind_Handle ; 0xbe0
        0x0000242c:    f7fefeaa    ....    BL       FOCTailWindTimeLimit ; 0x1184
        0x00002430:    f000fff8    ....    BL       TailWindSpeedDetect ; 0x3424
        0x00002434:    f7fefea2    ....    BL       FOCTailWindDealwith ; 0x117c
        0x00002438:    bd10        ..      POP      {r4,pc}
    $d
        0x0000243a:    0000        ..      DCW    0
        0x0000243c:    20000011    ...     DCD    536870929
    $t
    i.MotorcontrolInit
    MotorcontrolInit
        0x00002440:    b510        ..      PUSH     {r4,lr}
        0x00002442:    212e        .!      MOVS     r1,#0x2e
        0x00002444:    481d        .H      LDR      r0,[pc,#116] ; [0x24bc] = 0x2000019c
        0x00002446:    f7fdfea6    ....    BL       __aeabi_memclr ; 0x196
        0x0000244a:    210c        .!      MOVS     r1,#0xc
        0x0000244c:    481c        .H      LDR      r0,[pc,#112] ; [0x24c0] = 0x200001d8
        0x0000244e:    f7fdfea2    ....    BL       __aeabi_memclr ; 0x196
        0x00002452:    210e        .!      MOVS     r1,#0xe
        0x00002454:    481b        .H      LDR      r0,[pc,#108] ; [0x24c4] = 0x200001ca
        0x00002456:    f7fdfe9e    ....    BL       __aeabi_memclr ; 0x196
        0x0000245a:    481b        .H      LDR      r0,[pc,#108] ; [0x24c8] = 0x200000e8
        0x0000245c:    2400        .$      MOVS     r4,#0
        0x0000245e:    6004        .`      STR      r4,[r0,#0]
        0x00002460:    6044        D`      STR      r4,[r0,#4]
        0x00002462:    6084        .`      STR      r4,[r0,#8]
        0x00002464:    2107        .!      MOVS     r1,#7
        0x00002466:    4819        .H      LDR      r0,[pc,#100] ; [0x24cc] = 0x20000011
        0x00002468:    f7fdfe95    ....    BL       __aeabi_memclr ; 0x196
        0x0000246c:    216c        l!      MOVS     r1,#0x6c
        0x0000246e:    4818        .H      LDR      r0,[pc,#96] ; [0x24d0] = 0x20000064
        0x00002470:    f7fdfe91    ....    BL       __aeabi_memclr ; 0x196
        0x00002474:    4817        .H      LDR      r0,[pc,#92] ; [0x24d4] = 0x200000f4
        0x00002476:    6004        .`      STR      r4,[r0,#0]
        0x00002478:    6044        D`      STR      r4,[r0,#4]
        0x0000247a:    6084        .`      STR      r4,[r0,#8]
        0x0000247c:    60c4        .`      STR      r4,[r0,#0xc]
        0x0000247e:    6104        .a      STR      r4,[r0,#0x10]
        0x00002480:    4815        .H      LDR      r0,[pc,#84] ; [0x24d8] = 0x20000160
        0x00002482:    6004        .`      STR      r4,[r0,#0]
        0x00002484:    6084        .`      STR      r4,[r0,#8]
        0x00002486:    6104        .a      STR      r4,[r0,#0x10]
        0x00002488:    6184        .a      STR      r4,[r0,#0x18]
        0x0000248a:    6204        .b      STR      r4,[r0,#0x20]
        0x0000248c:    4913        .I      LDR      r1,[pc,#76] ; [0x24dc] = 0x3fff
        0x0000248e:    6041        A`      STR      r1,[r0,#4]
        0x00002490:    60c1        .`      STR      r1,[r0,#0xc]
        0x00002492:    6141        Aa      STR      r1,[r0,#0x14]
        0x00002494:    61c1        .a      STR      r1,[r0,#0x1c]
        0x00002496:    2116        .!      MOVS     r1,#0x16
        0x00002498:    4811        .H      LDR      r0,[pc,#68] ; [0x24e0] = 0x200000d0
        0x0000249a:    f7fdfe7c    ..|.    BL       __aeabi_memclr ; 0x196
        0x0000249e:    2158        X!      MOVS     r1,#0x58
        0x000024a0:    4810        .H      LDR      r0,[pc,#64] ; [0x24e4] = 0x20000108
        0x000024a2:    f7fdfe78    ..x.    BL       __aeabi_memclr ; 0x196
        0x000024a6:    4a10        .J      LDR      r2,[pc,#64] ; [0x24e8] = 0x20000004
        0x000024a8:    490d        .I      LDR      r1,[pc,#52] ; [0x24e0] = 0x200000d0
        0x000024aa:    202b        +       MOVS     r0,#0x2b
        0x000024ac:    80c8        ..      STRH     r0,[r1,#6]
        0x000024ae:    8108        ..      STRH     r0,[r1,#8]
        0x000024b0:    2002        .       MOVS     r0,#2
        0x000024b2:    8188        ..      STRH     r0,[r1,#0xc]
        0x000024b4:    7054        Tp      STRB     r4,[r2,#1]
        0x000024b6:    7014        .p      STRB     r4,[r2,#0]
        0x000024b8:    bd10        ..      POP      {r4,pc}
    $d
        0x000024ba:    0000        ..      DCW    0
        0x000024bc:    2000019c    ...     DCD    536871324
        0x000024c0:    200001d8    ...     DCD    536871384
        0x000024c4:    200001ca    ...     DCD    536871370
        0x000024c8:    200000e8    ...     DCD    536871144
        0x000024cc:    20000011    ...     DCD    536870929
        0x000024d0:    20000064    d..     DCD    536871012
        0x000024d4:    200000f4    ...     DCD    536871156
        0x000024d8:    20000160    `..     DCD    536871264
        0x000024dc:    00003fff    .?..    DCD    16383
        0x000024e0:    200000d0    ...     DCD    536871120
        0x000024e4:    20000108    ...     DCD    536871176
        0x000024e8:    20000004    ...     DCD    536870916
    $t
    i.PI_Init
    PI_Init
        0x000024ec:    b410        ..      PUSH     {r4}
        0x000024ee:    491d        .I      LDR      r1,[pc,#116] ; [0x2564] = 0x200002dc
        0x000024f0:    2000        .       MOVS     r0,#0
        0x000024f2:    6688        .f      STR      r0,[r1,#0x68]
        0x000024f4:    66c8        .f      STR      r0,[r1,#0x6c]
        0x000024f6:    6708        .g      STR      r0,[r1,#0x70]
        0x000024f8:    6748        Hg      STR      r0,[r1,#0x74]
        0x000024fa:    6788        .g      STR      r0,[r1,#0x78]
        0x000024fc:    67c8        .g      STR      r0,[r1,#0x7c]
        0x000024fe:    491a        .I      LDR      r1,[pc,#104] ; [0x2568] = 0x2000035c
        0x00002500:    6008        .`      STR      r0,[r1,#0]
        0x00002502:    6048        H`      STR      r0,[r1,#4]
        0x00002504:    6088        .`      STR      r0,[r1,#8]
        0x00002506:    60c8        .`      STR      r0,[r1,#0xc]
        0x00002508:    6108        .a      STR      r0,[r1,#0x10]
        0x0000250a:    6148        Ha      STR      r0,[r1,#0x14]
        0x0000250c:    3980        .9      SUBS     r1,r1,#0x80
        0x0000250e:    6008        .`      STR      r0,[r1,#0]
        0x00002510:    6048        H`      STR      r0,[r1,#4]
        0x00002512:    6088        .`      STR      r0,[r1,#8]
        0x00002514:    60c8        .`      STR      r0,[r1,#0xc]
        0x00002516:    6208        .b      STR      r0,[r1,#0x20]
        0x00002518:    6248        Hb      STR      r0,[r1,#0x24]
        0x0000251a:    6288        .b      STR      r0,[r1,#0x28]
        0x0000251c:    62c8        .b      STR      r0,[r1,#0x2c]
        0x0000251e:    6308        .c      STR      r0,[r1,#0x30]
        0x00002520:    6348        Hc      STR      r0,[r1,#0x34]
        0x00002522:    6488        .d      STR      r0,[r1,#0x48]
        0x00002524:    64c8        .d      STR      r0,[r1,#0x4c]
        0x00002526:    6508        .e      STR      r0,[r1,#0x50]
        0x00002528:    6548        He      STR      r0,[r1,#0x54]
        0x0000252a:    6588        .e      STR      r0,[r1,#0x58]
        0x0000252c:    65c8        .e      STR      r0,[r1,#0x5c]
        0x0000252e:    6608        .f      STR      r0,[r1,#0x60]
        0x00002530:    6648        Hf      STR      r0,[r1,#0x64]
        0x00002532:    490f        .I      LDR      r1,[pc,#60] ; [0x2570] = 0x2000032c
        0x00002534:    4b0d        .K      LDR      r3,[pc,#52] ; [0x256c] = 0xfff
        0x00002536:    818b        ..      STRH     r3,[r1,#0xc]
        0x00002538:    22ff        ."      MOVS     r2,#0xff
        0x0000253a:    3248        H2      ADDS     r2,r2,#0x48
        0x0000253c:    81ca        ..      STRH     r2,[r1,#0xe]
        0x0000253e:    4c0d        .L      LDR      r4,[pc,#52] ; [0x2574] = 0x3fff
        0x00002540:    824c        L.      STRH     r4,[r1,#0x12]
        0x00002542:    8288        ..      STRH     r0,[r1,#0x14]
        0x00002544:    480c        .H      LDR      r0,[pc,#48] ; [0x2578] = 0x20000304
        0x00002546:    6103        .a      STR      r3,[r0,#0x10]
        0x00002548:    6142        Ba      STR      r2,[r0,#0x14]
        0x0000254a:    490c        .I      LDR      r1,[pc,#48] ; [0x257c] = 0x7332
        0x0000254c:    6181        .a      STR      r1,[r0,#0x18]
        0x0000254e:    4249        IB      RSBS     r1,r1,#0
        0x00002550:    61c1        .a      STR      r1,[r0,#0x1c]
        0x00002552:    3828        (8      SUBS     r0,r0,#0x28
        0x00002554:    6103        .a      STR      r3,[r0,#0x10]
        0x00002556:    6142        Ba      STR      r2,[r0,#0x14]
