747lulu747/SAOZHAN_BRUASH/src/SDK-LIB/华芯第一版本硬件-非FPC/ROMAN-21DD - SDK - V0.1/out/SWM211.asm
        0x00002558:    4909        .I      LDR      r1,[pc,#36] ; [0x2580] = 0x3332
        0x0000255a:    6181        .a      STR      r1,[r0,#0x18]
        0x0000255c:    4249        IB      RSBS     r1,r1,#0
        0x0000255e:    61c1        .a      STR      r1,[r0,#0x1c]
        0x00002560:    bc10        ..      POP      {r4}
        0x00002562:    4770        pG      BX       lr
    $d
        0x00002564:    200002dc    ...     DCD    536871644
        0x00002568:    2000035c    \..     DCD    536871772
        0x0000256c:    00000fff    ....    DCD    4095
        0x00002570:    2000032c    ,..     DCD    536871724
        0x00002574:    00003fff    .?..    DCD    16383
        0x00002578:    20000304    ...     DCD    536871684
        0x0000257c:    00007332    2s..    DCD    29490
        0x00002580:    00003332    23..    DCD    13106
    $t
    i.PLLInit
    PLLInit
        0x00002584:    480d        .H      LDR      r0,[pc,#52] ; [0x25bc] = 0x400aa000
        0x00002586:    2201        ."      MOVS     r2,#1
        0x00002588:    6002        .`      STR      r2,[r0,#0]
        0x0000258a:    480d        .H      LDR      r0,[pc,#52] ; [0x25c0] = 0x400aa040
        0x0000258c:    6801        .h      LDR      r1,[r0,#0]
        0x0000258e:    2302        .#      MOVS     r3,#2
        0x00002590:    4319        .C      ORRS     r1,r1,r3
        0x00002592:    6001        .`      STR      r1,[r0,#0]
        0x00002594:    6841        Ah      LDR      r1,[r0,#4]
        0x00002596:    4b0b        .K      LDR      r3,[pc,#44] ; [0x25c4] = 0xfce0fe00
        0x00002598:    4019        .@      ANDS     r1,r1,r3
        0x0000259a:    6041        A`      STR      r1,[r0,#4]
        0x0000259c:    6841        Ah      LDR      r1,[r0,#4]
        0x0000259e:    4b0a        .K      LDR      r3,[pc,#40] ; [0x25c8] = 0x3002d
        0x000025a0:    4319        .C      ORRS     r1,r1,r3
        0x000025a2:    6041        A`      STR      r1,[r0,#4]
        0x000025a4:    6801        .h      LDR      r1,[r0,#0]
        0x000025a6:    2304        .#      MOVS     r3,#4
        0x000025a8:    4399        .C      BICS     r1,r1,r3
        0x000025aa:    6001        .`      STR      r1,[r0,#0]
        0x000025ac:    68c1        .h      LDR      r1,[r0,#0xc]
        0x000025ae:    2900        .)      CMP      r1,#0
        0x000025b0:    d0fc        ..      BEQ      0x25ac ; PLLInit + 40
        0x000025b2:    6801        .h      LDR      r1,[r0,#0]
        0x000025b4:    4311        .C      ORRS     r1,r1,r2
        0x000025b6:    6001        .`      STR      r1,[r0,#0]
        0x000025b8:    4770        pG      BX       lr
    $d
        0x000025ba:    0000        ..      DCW    0
        0x000025bc:    400aa000    ...@    DCD    1074438144
        0x000025c0:    400aa040    @..@    DCD    1074438208
        0x000025c4:    fce0fe00    ....    DCD    4242603520
        0x000025c8:    0003002d    -...    DCD    196653
    $t
    i.PORT_Init
    PORT_Init
        0x000025cc:    b470        p.      PUSH     {r4-r6}
        0x000025ce:    250f        .%      MOVS     r5,#0xf
        0x000025d0:    2908        .)      CMP      r1,#8
        0x000025d2:    d209        ..      BCS      0x25e8 ; PORT_Init + 28
        0x000025d4:    6806        .h      LDR      r6,[r0,#0]
        0x000025d6:    008c        ..      LSLS     r4,r1,#2
        0x000025d8:    40a5        .@      LSLS     r5,r5,r4
        0x000025da:    43ae        .C      BICS     r6,r6,r5
        0x000025dc:    6006        .`      STR      r6,[r0,#0]
        0x000025de:    6805        .h      LDR      r5,[r0,#0]
        0x000025e0:    40a2        .@      LSLS     r2,r2,r4
        0x000025e2:    4315        .C      ORRS     r5,r5,r2
        0x000025e4:    6005        .`      STR      r5,[r0,#0]
        0x000025e6:    e00a        ..      B        0x25fe ; PORT_Init + 50
        0x000025e8:    6846        Fh      LDR      r6,[r0,#4]
        0x000025ea:    460c        .F      MOV      r4,r1
        0x000025ec:    3c08        .<      SUBS     r4,r4,#8
        0x000025ee:    00a4        ..      LSLS     r4,r4,#2
        0x000025f0:    40a5        .@      LSLS     r5,r5,r4
        0x000025f2:    43ae        .C      BICS     r6,r6,r5
        0x000025f4:    6046        F`      STR      r6,[r0,#4]
        0x000025f6:    6845        Eh      LDR      r5,[r0,#4]
        0x000025f8:    40a2        .@      LSLS     r2,r2,r4
        0x000025fa:    4315        .C      ORRS     r5,r5,r2
        0x000025fc:    6045        E`      STR      r5,[r0,#4]
        0x000025fe:    2403        .$      MOVS     r4,#3
        0x00002600:    0224        $.      LSLS     r4,r4,#8
        0x00002602:    2201        ."      MOVS     r2,#1
        0x00002604:    408a        .@      LSLS     r2,r2,r1
        0x00002606:    1900        ..      ADDS     r0,r0,r4
        0x00002608:    2b00        .+      CMP      r3,#0
        0x0000260a:    d004        ..      BEQ      0x2616 ; PORT_Init + 74
        0x0000260c:    6801        .h      LDR      r1,[r0,#0]
        0x0000260e:    4311        .C      ORRS     r1,r1,r2
        0x00002610:    6001        .`      STR      r1,[r0,#0]
        0x00002612:    bc70        p.      POP      {r4-r6}
        0x00002614:    4770        pG      BX       lr
        0x00002616:    6801        .h      LDR      r1,[r0,#0]
        0x00002618:    4391        .C      BICS     r1,r1,r2
        0x0000261a:    6001        .`      STR      r1,[r0,#0]
        0x0000261c:    bc70        p.      POP      {r4-r6}
        0x0000261e:    4770        pG      BX       lr
    i.PORT_SixDrive_DisEnable
    PORT_SixDrive_DisEnable
        0x00002620:    b530        0.      PUSH     {r4,r5,lr}
        0x00002622:    b083        ..      SUB      sp,sp,#0xc
        0x00002624:    2400        .$      MOVS     r4,#0
        0x00002626:    4d19        .M      LDR      r5,[pc,#100] ; [0x268c] = 0x40004800
        0x00002628:    9400        ..      STR      r4,[sp,#0]
        0x0000262a:    2301        .#      MOVS     r3,#1
        0x0000262c:    4622        "F      MOV      r2,r4
        0x0000262e:    4621        !F      MOV      r1,r4
        0x00002630:    4628        (F      MOV      r0,r5
        0x00002632:    9401        ..      STR      r4,[sp,#4]
        0x00002634:    f7fff856    ..V.    BL       GPIO_Init ; 0x16e4
        0x00002638:    2301        .#      MOVS     r3,#1
        0x0000263a:    9400        ..      STR      r4,[sp,#0]
        0x0000263c:    2200        ."      MOVS     r2,#0
        0x0000263e:    4619        .F      MOV      r1,r3
        0x00002640:    4628        (F      MOV      r0,r5
        0x00002642:    9401        ..      STR      r4,[sp,#4]
        0x00002644:    f7fff84e    ..N.    BL       GPIO_Init ; 0x16e4
        0x00002648:    9400        ..      STR      r4,[sp,#0]
        0x0000264a:    2301        .#      MOVS     r3,#1
        0x0000264c:    2200        ."      MOVS     r2,#0
        0x0000264e:    2102        .!      MOVS     r1,#2
        0x00002650:    4628        (F      MOV      r0,r5
        0x00002652:    9401        ..      STR      r4,[sp,#4]
        0x00002654:    f7fff846    ..F.    BL       GPIO_Init ; 0x16e4
        0x00002658:    9400        ..      STR      r4,[sp,#0]
        0x0000265a:    2301        .#      MOVS     r3,#1
        0x0000265c:    2200        ."      MOVS     r2,#0
        0x0000265e:    2103        .!      MOVS     r1,#3
        0x00002660:    4628        (F      MOV      r0,r5
        0x00002662:    9401        ..      STR      r4,[sp,#4]
        0x00002664:    f7fff83e    ..>.    BL       GPIO_Init ; 0x16e4
        0x00002668:    9400        ..      STR      r4,[sp,#0]
        0x0000266a:    2301        .#      MOVS     r3,#1
        0x0000266c:    2200        ."      MOVS     r2,#0
        0x0000266e:    2104        .!      MOVS     r1,#4
        0x00002670:    4628        (F      MOV      r0,r5
        0x00002672:    9401        ..      STR      r4,[sp,#4]
        0x00002674:    f7fff836    ..6.    BL       GPIO_Init ; 0x16e4
        0x00002678:    9400        ..      STR      r4,[sp,#0]
        0x0000267a:    2301        .#      MOVS     r3,#1
        0x0000267c:    2200        ."      MOVS     r2,#0
        0x0000267e:    2105        .!      MOVS     r1,#5
        0x00002680:    4628        (F      MOV      r0,r5
        0x00002682:    9401        ..      STR      r4,[sp,#4]
        0x00002684:    f7fff82e    ....    BL       GPIO_Init ; 0x16e4
        0x00002688:    b003        ..      ADD      sp,sp,#0xc
        0x0000268a:    bd30        0.      POP      {r4,r5,pc}
    $d
        0x0000268c:    40004800    .H.@    DCD    1073760256
    $t
    i.PORT_SixDrive_Enable
    PORT_SixDrive_Enable
        0x00002690:    b510        ..      PUSH     {r4,lr}
        0x00002692:    4c13        .L      LDR      r4,[pc,#76] ; [0x26e0] = 0x400a0000
        0x00002694:    2300        .#      MOVS     r3,#0
        0x00002696:    2203        ."      MOVS     r2,#3
        0x00002698:    2105        .!      MOVS     r1,#5
        0x0000269a:    4620         F      MOV      r0,r4
        0x0000269c:    f7ffff96    ....    BL       PORT_Init ; 0x25cc
        0x000026a0:    2202        ."      MOVS     r2,#2
        0x000026a2:    2300        .#      MOVS     r3,#0
        0x000026a4:    4611        .F      MOV      r1,r2
        0x000026a6:    4620         F      MOV      r0,r4
        0x000026a8:    f7ffff90    ....    BL       PORT_Init ; 0x25cc
        0x000026ac:    2300        .#      MOVS     r3,#0
        0x000026ae:    2203        ."      MOVS     r2,#3
        0x000026b0:    2104        .!      MOVS     r1,#4
        0x000026b2:    4620         F      MOV      r0,r4
        0x000026b4:    f7ffff8a    ....    BL       PORT_Init ; 0x25cc
        0x000026b8:    2300        .#      MOVS     r3,#0
        0x000026ba:    2204        ."      MOVS     r2,#4
        0x000026bc:    2101        .!      MOVS     r1,#1
        0x000026be:    4620         F      MOV      r0,r4
        0x000026c0:    f7ffff84    ....    BL       PORT_Init ; 0x25cc
        0x000026c4:    2300        .#      MOVS     r3,#0
        0x000026c6:    2202        ."      MOVS     r2,#2
        0x000026c8:    2103        .!      MOVS     r1,#3
        0x000026ca:    4620         F      MOV      r0,r4
        0x000026cc:    f7ffff7e    ..~.    BL       PORT_Init ; 0x25cc
        0x000026d0:    2300        .#      MOVS     r3,#0
        0x000026d2:    2204        ."      MOVS     r2,#4
        0x000026d4:    4619        .F      MOV      r1,r3
        0x000026d6:    4620         F      MOV      r0,r4
        0x000026d8:    f7ffff78    ..x.    BL       PORT_Init ; 0x25cc
        0x000026dc:    bd10        ..      POP      {r4,pc}
    $d
        0x000026de:    0000        ..      DCW    0
        0x000026e0:    400a0000    ...@    DCD    1074397184
    $t
    i.PWM_CmpTrigger
    PWM_CmpTrigger
        0x000026e4:    b430        0.      PUSH     {r4,r5}
        0x000026e6:    9c03        ..      LDR      r4,[sp,#0xc]
        0x000026e8:    9b02        ..      LDR      r3,[sp,#8]
        0x000026ea:    2501        .%      MOVS     r5,#1
        0x000026ec:    042d        -.      LSLS     r5,r5,#16
        0x000026ee:    0712        ..      LSLS     r2,r2,#28
        0x000026f0:    1949        I.      ADDS     r1,r1,r5
        0x000026f2:    430a        .C      ORRS     r2,r2,r1
        0x000026f4:    0459        Y.      LSLS     r1,r3,#17
        0x000026f6:    430a        .C      ORRS     r2,r2,r1
        0x000026f8:    2103        .!      MOVS     r1,#3
        0x000026fa:    0749        I.      LSLS     r1,r1,#29
        0x000026fc:    430a        .C      ORRS     r2,r2,r1
        0x000026fe:    6542        Be      STR      r2,[r0,#0x54]
        0x00002700:    6584        .e      STR      r4,[r0,#0x58]
        0x00002702:    bc30        0.      POP      {r4,r5}
        0x00002704:    4770        pG      BX       lr
        0x00002706:    0000        ..      MOVS     r0,r0
    i.PWM_Init
    PWM_Init
        0x00002708:    b410        ..      PUSH     {r4}
        0x0000270a:    2201        ."      MOVS     r2,#1
        0x0000270c:    0792        ..      LSLS     r2,r2,#30
        0x0000270e:    6893        .h      LDR      r3,[r2,#8]
        0x00002710:    1494        ..      ASRS     r4,r2,#18
        0x00002712:    4323        #C      ORRS     r3,r3,r4
        0x00002714:    6093        .`      STR      r3,[r2,#8]
        0x00002716:    884b        K.      LDRH     r3,[r1,#2]
        0x00002718:    780a        .x      LDRB     r2,[r1,#0]
        0x0000271a:    1e5b        [.      SUBS     r3,r3,#1
        0x0000271c:    019b        ..      LSLS     r3,r3,#6
        0x0000271e:    2404        .$      MOVS     r4,#4
        0x00002720:    4323        #C      ORRS     r3,r3,r4
        0x00002722:    431a        .C      ORRS     r2,r2,r3
        0x00002724:    6002        .`      STR      r2,[r0,#0]
        0x00002726:    7b0a        .{      LDRB     r2,[r1,#0xc]
        0x00002728:    2a00        .*      CMP      r2,#0
        0x0000272a:    d001        ..      BEQ      0x2730 ; PWM_Init + 40
        0x0000272c:    2201        ."      MOVS     r2,#1
        0x0000272e:    e000        ..      B        0x2732 ; PWM_Init + 42
        0x00002730:    2200        ."      MOVS     r2,#0
        0x00002732:    7d8b        .}      LDRB     r3,[r1,#0x16]
        0x00002734:    2b00        .+      CMP      r3,#0
        0x00002736:    d001        ..      BEQ      0x273c ; PWM_Init + 52
        0x00002738:    2301        .#      MOVS     r3,#1
        0x0000273a:    e000        ..      B        0x273e ; PWM_Init + 54
        0x0000273c:    2300        .#      MOVS     r3,#0
        0x0000273e:    005b        [.      LSLS     r3,r3,#1
        0x00002740:    431a        .C      ORRS     r2,r2,r3
        0x00002742:    7b4b        K{      LDRB     r3,[r1,#0xd]
        0x00002744:    2b00        .+      CMP      r3,#0
        0x00002746:    d001        ..      BEQ      0x274c ; PWM_Init + 68
        0x00002748:    2301        .#      MOVS     r3,#1
        0x0000274a:    e000        ..      B        0x274e ; PWM_Init + 70
        0x0000274c:    2300        .#      MOVS     r3,#0
        0x0000274e:    009b        ..      LSLS     r3,r3,#2
        0x00002750:    431a        .C      ORRS     r2,r2,r3
        0x00002752:    7dcb        .}      LDRB     r3,[r1,#0x17]
        0x00002754:    2b00        .+      CMP      r3,#0
        0x00002756:    d001        ..      BEQ      0x275c ; PWM_Init + 84
        0x00002758:    2301        .#      MOVS     r3,#1
        0x0000275a:    e000        ..      B        0x275e ; PWM_Init + 86
        0x0000275c:    2300        .#      MOVS     r3,#0
        0x0000275e:    00db        ..      LSLS     r3,r3,#3
        0x00002760:    431a        .C      ORRS     r2,r2,r3
        0x00002762:    7b8b        .{      LDRB     r3,[r1,#0xe]
        0x00002764:    2b00        .+      CMP      r3,#0
        0x00002766:    d001        ..      BEQ      0x276c ; PWM_Init + 100
        0x00002768:    2301        .#      MOVS     r3,#1
        0x0000276a:    e000        ..      B        0x276e ; PWM_Init + 102
        0x0000276c:    2300        .#      MOVS     r3,#0
        0x0000276e:    011b        ..      LSLS     r3,r3,#4
        0x00002770:    431a        .C      ORRS     r2,r2,r3
        0x00002772:    7e0b        .~      LDRB     r3,[r1,#0x18]
        0x00002774:    2b00        .+      CMP      r3,#0
        0x00002776:    d001        ..      BEQ      0x277c ; PWM_Init + 116
        0x00002778:    2301        .#      MOVS     r3,#1
        0x0000277a:    e000        ..      B        0x277e ; PWM_Init + 118
        0x0000277c:    2300        .#      MOVS     r3,#0
        0x0000277e:    015b        [.      LSLS     r3,r3,#5
        0x00002780:    431a        .C      ORRS     r2,r2,r3
        0x00002782:    7bcb        .{      LDRB     r3,[r1,#0xf]
        0x00002784:    2b00        .+      CMP      r3,#0
        0x00002786:    d001        ..      BEQ      0x278c ; PWM_Init + 132
        0x00002788:    2301        .#      MOVS     r3,#1
        0x0000278a:    e000        ..      B        0x278e ; PWM_Init + 134
        0x0000278c:    2300        .#      MOVS     r3,#0
        0x0000278e:    019b        ..      LSLS     r3,r3,#6
        0x00002790:    431a        .C      ORRS     r2,r2,r3
        0x00002792:    7e4b        K~      LDRB     r3,[r1,#0x19]
        0x00002794:    2b00        .+      CMP      r3,#0
        0x00002796:    d001        ..      BEQ      0x279c ; PWM_Init + 148
        0x00002798:    2301        .#      MOVS     r3,#1
        0x0000279a:    e000        ..      B        0x279e ; PWM_Init + 150
        0x0000279c:    2300        .#      MOVS     r3,#0
        0x0000279e:    01db        ..      LSLS     r3,r3,#7
        0x000027a0:    431a        .C      ORRS     r2,r2,r3
        0x000027a2:    6042        B`      STR      r2,[r0,#4]
        0x000027a4:    888a        ..      LDRH     r2,[r1,#4]
        0x000027a6:    1e52        R.      SUBS     r2,r2,#1
        0x000027a8:    6202        .b      STR      r2,[r0,#0x20]
        0x000027aa:    88ca        ..      LDRH     r2,[r1,#6]
        0x000027ac:    6242        Bb      STR      r2,[r0,#0x24]
        0x000027ae:    890a        ..      LDRH     r2,[r1,#8]
        0x000027b0:    6342        Bc      STR      r2,[r0,#0x34]
        0x000027b2:    894a        J.      LDRH     r2,[r1,#0xa]
        0x000027b4:    62c2        .b      STR      r2,[r0,#0x2c]
        0x000027b6:    8a0a        ..      LDRH     r2,[r1,#0x10]
        0x000027b8:    6282        .b      STR      r2,[r0,#0x28]
        0x000027ba:    8a4a        J.      LDRH     r2,[r1,#0x12]
        0x000027bc:    6382        .c      STR      r2,[r0,#0x38]
        0x000027be:    8a8a        ..      LDRH     r2,[r1,#0x14]
        0x000027c0:    6302        .c      STR      r2,[r0,#0x30]
        0x000027c2:    4b29        )K      LDR      r3,[pc,#164] ; [0x2868] = 0x40046400
        0x000027c4:    223f        ?"      MOVS     r2,#0x3f
        0x000027c6:    60da        .`      STR      r2,[r3,#0xc]
        0x000027c8:    6742        Bg      STR      r2,[r0,#0x74]
        0x000027ca:    7e8a        .~      LDRB     r2,[r1,#0x1a]
        0x000027cc:    2a00        .*      CMP      r2,#0
        0x000027ce:    d001        ..      BEQ      0x27d4 ; PWM_Init + 204
        0x000027d0:    2201        ."      MOVS     r2,#1
        0x000027d2:    e000        ..      B        0x27d6 ; PWM_Init + 206
        0x000027d4:    2200        ."      MOVS     r2,#0
        0x000027d6:    7ecb        .~      LDRB     r3,[r1,#0x1b]
        0x000027d8:    2b00        .+      CMP      r3,#0
        0x000027da:    d001        ..      BEQ      0x27e0 ; PWM_Init + 216
        0x000027dc:    2301        .#      MOVS     r3,#1
        0x000027de:    e000        ..      B        0x27e2 ; PWM_Init + 218
        0x000027e0:    2300        .#      MOVS     r3,#0
        0x000027e2:    005b        [.      LSLS     r3,r3,#1
        0x000027e4:    431a        .C      ORRS     r2,r2,r3
        0x000027e6:    7f0b        ..      LDRB     r3,[r1,#0x1c]
        0x000027e8:    2b00        .+      CMP      r3,#0
        0x000027ea:    d001        ..      BEQ      0x27f0 ; PWM_Init + 232
        0x000027ec:    2301        .#      MOVS     r3,#1
        0x000027ee:    e000        ..      B        0x27f2 ; PWM_Init + 234
        0x000027f0:    2300        .#      MOVS     r3,#0
        0x000027f2:    009b        ..      LSLS     r3,r3,#2
        0x000027f4:    431a        .C      ORRS     r2,r2,r3
        0x000027f6:    7f4b        K.      LDRB     r3,[r1,#0x1d]
        0x000027f8:    2b00        .+      CMP      r3,#0
        0x000027fa:    d001        ..      BEQ      0x2800 ; PWM_Init + 248
        0x000027fc:    2301        .#      MOVS     r3,#1
        0x000027fe:    e000        ..      B        0x2802 ; PWM_Init + 250
        0x00002800:    2300        .#      MOVS     r3,#0
        0x00002802:    011b        ..      LSLS     r3,r3,#4
        0x00002804:    431a        .C      ORRS     r2,r2,r3
        0x00002806:    7f8b        ..      LDRB     r3,[r1,#0x1e]
        0x00002808:    2b00        .+      CMP      r3,#0
        0x0000280a:    d001        ..      BEQ      0x2810 ; PWM_Init + 264
        0x0000280c:    2301        .#      MOVS     r3,#1
        0x0000280e:    e000        ..      B        0x2812 ; PWM_Init + 266
        0x00002810:    2300        .#      MOVS     r3,#0
        0x00002812:    00db        ..      LSLS     r3,r3,#3
        0x00002814:    431a        .C      ORRS     r2,r2,r3
        0x00002816:    7fcb        ..      LDRB     r3,[r1,#0x1f]
        0x00002818:    2b00        .+      CMP      r3,#0
        0x0000281a:    d001        ..      BEQ      0x2820 ; PWM_Init + 280
        0x0000281c:    2301        .#      MOVS     r3,#1
        0x0000281e:    e000        ..      B        0x2822 ; PWM_Init + 282
        0x00002820:    2300        .#      MOVS     r3,#0
        0x00002822:    015b        [.      LSLS     r3,r3,#5
        0x00002824:    431a        .C      ORRS     r2,r2,r3
        0x00002826:    6702        .g      STR      r2,[r0,#0x70]
        0x00002828:    7e8a        .~      LDRB     r2,[r1,#0x1a]
        0x0000282a:    2a00        .*      CMP      r2,#0
        0x0000282c:    d10e        ..      BNE      0x284c ; PWM_Init + 324
        0x0000282e:    7eca        .~      LDRB     r2,[r1,#0x1b]
        0x00002830:    2a00        .*      CMP      r2,#0
        0x00002832:    d10b        ..      BNE      0x284c ; PWM_Init + 324
        0x00002834:    7f0a        ..      LDRB     r2,[r1,#0x1c]
        0x00002836:    2a00        .*      CMP      r2,#0
        0x00002838:    d108        ..      BNE      0x284c ; PWM_Init + 324
        0x0000283a:    7f4a        J.      LDRB     r2,[r1,#0x1d]
        0x0000283c:    2a00        .*      CMP      r2,#0
        0x0000283e:    d105        ..      BNE      0x284c ; PWM_Init + 324
        0x00002840:    7f8a        ..      LDRB     r2,[r1,#0x1e]
        0x00002842:    2a00        .*      CMP      r2,#0
        0x00002844:    d102        ..      BNE      0x284c ; PWM_Init + 324
        0x00002846:    7fc9        ..      LDRB     r1,[r1,#0x1f]
        0x00002848:    2900        .)      CMP      r1,#0
        0x0000284a:    d007        ..      BEQ      0x285c ; PWM_Init + 340
        0x0000284c:    4907        .I      LDR      r1,[pc,#28] ; [0x286c] = 0xbffba000
        0x0000284e:    1840        @.      ADDS     r0,r0,r1
        0x00002850:    4907        .I      LDR      r1,[pc,#28] ; [0x2870] = 0xe000e100
        0x00002852:    d005        ..      BEQ      0x2860 ; PWM_Init + 344
        0x00002854:    2880        .(      CMP      r0,#0x80
        0x00002856:    d101        ..      BNE      0x285c ; PWM_Init + 340
        0x00002858:    2010        .       MOVS     r0,#0x10
        0x0000285a:    6008        .`      STR      r0,[r1,#0]
        0x0000285c:    bc10        ..      POP      {r4}
        0x0000285e:    4770        pG      BX       lr
        0x00002860:    2080        .       MOVS     r0,#0x80
        0x00002862:    6008        .`      STR      r0,[r1,#0]
        0x00002864:    bc10        ..      POP      {r4}
        0x00002866:    4770        pG      BX       lr
    $d
        0x00002868:    40046400    .d.@    DCD    1074029568
        0x0000286c:    bffba000    ....    DCD    3220938752
        0x00002870:    e000e100    ....    DCD    3758153984
    $t
    i.PWM_IntClr
    PWM_IntClr
        0x00002874:    6741        Ag      STR      r1,[r0,#0x74]
        0x00002876:    4770        pG      BX       lr
    i.PWM_Start
    PWM_Start
        0x00002878:    4902        .I      LDR      r1,[pc,#8] ; [0x2884] = 0x40046400
        0x0000287a:    680a        .h      LDR      r2,[r1,#0]
