747lulu747/SAOZHAN_BRUASH/src/SDK-LIB/华芯第一版本硬件-非FPC/ROMAN-21DD - SDK - V0.1/out/SWM211.asm
        0x0000287c:    4302        .C      ORRS     r2,r2,r0
        0x0000287e:    600a        .`      STR      r2,[r1,#0]
        0x00002880:    4770        pG      BX       lr
    $d
        0x00002882:    0000        ..      DCW    0
        0x00002884:    40046400    .d.@    DCD    1074029568
    $t
    i.RIPD_Angle_Out
    RIPD_Angle_Out
        0x00002888:    4b19        .K      LDR      r3,[pc,#100] ; [0x28f0] = 0x20000f4c
        0x0000288a:    4a18        .J      LDR      r2,[pc,#96] ; [0x28ec] = 0x2aa8
        0x0000288c:    665a        Zf      STR      r2,[r3,#0x64]
        0x0000288e:    280d        .(      CMP      r0,#0xd
        0x00002890:    d222        ".      BCS      0x28d8 ; RIPD_Angle_Out + 80
        0x00002892:    0003        ..      MOVS     r3,r0
        0x00002894:    447b        {D      ADD      r3,r3,pc
        0x00002896:    791b        .y      LDRB     r3,[r3,#4]
        0x00002898:    18db        ..      ADDS     r3,r3,r3
        0x0000289a:    449f        .D      ADD      pc,pc,r3
    $d
        0x0000289c:    0a08061d    ....    DCD    168298013
        0x000028a0:    12100e0c    ....    DCD    303042060
        0x000028a4:    1a181614    ....    DCD    437786132
        0x000028a8:    001c        ..      DCW    28
    $t
        0x000028aa:    4912        .I      LDR      r1,[pc,#72] ; [0x28f4] = 0xd548
        0x000028ac:    e014        ..      B        0x28d8 ; RIPD_Angle_Out + 80
        0x000028ae:    4912        .I      LDR      r1,[pc,#72] ; [0x28f8] = 0xbff4
        0x000028b0:    e012        ..      B        0x28d8 ; RIPD_Angle_Out + 80
        0x000028b2:    4912        .I      LDR      r1,[pc,#72] ; [0x28fc] = 0xaaa0
        0x000028b4:    e010        ..      B        0x28d8 ; RIPD_Angle_Out + 80
        0x000028b6:    4912        .I      LDR      r1,[pc,#72] ; [0x2900] = 0x954c
        0x000028b8:    e00e        ..      B        0x28d8 ; RIPD_Angle_Out + 80
        0x000028ba:    4912        .I      LDR      r1,[pc,#72] ; [0x2904] = 0x7ff8
        0x000028bc:    e00c        ..      B        0x28d8 ; RIPD_Angle_Out + 80
        0x000028be:    4912        .I      LDR      r1,[pc,#72] ; [0x2908] = 0x6aa4
        0x000028c0:    e00a        ..      B        0x28d8 ; RIPD_Angle_Out + 80
        0x000028c2:    4912        .I      LDR      r1,[pc,#72] ; [0x290c] = 0x5550
        0x000028c4:    e008        ..      B        0x28d8 ; RIPD_Angle_Out + 80
        0x000028c6:    4912        .I      LDR      r1,[pc,#72] ; [0x2910] = 0x3ffc
        0x000028c8:    e006        ..      B        0x28d8 ; RIPD_Angle_Out + 80
        0x000028ca:    4611        .F      MOV      r1,r2
        0x000028cc:    e004        ..      B        0x28d8 ; RIPD_Angle_Out + 80
        0x000028ce:    4911        .I      LDR      r1,[pc,#68] ; [0x2914] = 0xfff0
        0x000028d0:    e002        ..      B        0x28d8 ; RIPD_Angle_Out + 80
        0x000028d2:    4911        .I      LDR      r1,[pc,#68] ; [0x2918] = 0xea9c
        0x000028d4:    e000        ..      B        0x28d8 ; RIPD_Angle_Out + 80
        0x000028d6:    4907        .I      LDR      r1,[pc,#28] ; [0x28f4] = 0xd548
        0x000028d8:    4a05        .J      LDR      r2,[pc,#20] ; [0x28f0] = 0x20000f4c
        0x000028da:    6011        .`      STR      r1,[r2,#0]
        0x000028dc:    6811        .h      LDR      r1,[r2,#0]
        0x000028de:    480f        .H      LDR      r0,[pc,#60] ; [0x291c] = 0x200002a8
        0x000028e0:    8181        ..      STRH     r1,[r0,#0xc]
        0x000028e2:    6811        .h      LDR      r1,[r2,#0]
        0x000028e4:    81c1        ..      STRH     r1,[r0,#0xe]
        0x000028e6:    2001        .       MOVS     r0,#1
        0x000028e8:    63d0        .c      STR      r0,[r2,#0x3c]
        0x000028ea:    4770        pG      BX       lr
    $d
        0x000028ec:    00002aa8    .*..    DCD    10920
        0x000028f0:    20000f4c    L..     DCD    536874828
        0x000028f4:    0000d548    H...    DCD    54600
        0x000028f8:    0000bff4    ....    DCD    49140
        0x000028fc:    0000aaa0    ....    DCD    43680
        0x00002900:    0000954c    L...    DCD    38220
        0x00002904:    00007ff8    ....    DCD    32760
        0x00002908:    00006aa4    .j..    DCD    27300
        0x0000290c:    00005550    PU..    DCD    21840
        0x00002910:    00003ffc    .?..    DCD    16380
        0x00002914:    0000fff0    ....    DCD    65520
        0x00002918:    0000ea9c    ....    DCD    60060
        0x0000291c:    200002a8    ...     DCD    536871592
    $t
    i.RIPD_GetRisingCurrentFunct
    RIPD_GetRisingCurrentFunct
        0x00002920:    b5f8        ..      PUSH     {r3-r7,lr}
        0x00002922:    4c62        bL      LDR      r4,[pc,#392] ; [0x2aac] = 0x20000f8c
        0x00002924:    88e0        ..      LDRH     r0,[r4,#6]
        0x00002926:    2500        .%      MOVS     r5,#0
        0x00002928:    2601        .&      MOVS     r6,#1
        0x0000292a:    2800        .(      CMP      r0,#0
        0x0000292c:    d138        8.      BNE      0x29a0 ; RIPD_GetRisingCurrentFunct + 128
        0x0000292e:    8a60        `.      LDRH     r0,[r4,#0x12]
        0x00002930:    1c40        @.      ADDS     r0,r0,#1
        0x00002932:    8260        `.      STRH     r0,[r4,#0x12]
        0x00002934:    2112        .!      MOVS     r1,#0x12
        0x00002936:    5e61        a^      LDRSH    r1,[r4,r1]
        0x00002938:    207d        }       MOVS     r0,#0x7d
        0x0000293a:    00c0        ..      LSLS     r0,r0,#3
        0x0000293c:    4281        .B      CMP      r1,r0
        0x0000293e:    db04        ..      BLT      0x294a ; RIPD_GetRisingCurrentFunct + 42
        0x00002940:    8125        %.      STRH     r5,[r4,#8]
        0x00002942:    8265        e.      STRH     r5,[r4,#0x12]
        0x00002944:    80e6        ..      STRH     r6,[r4,#6]
        0x00002946:    80a6        ..      STRH     r6,[r4,#4]
        0x00002948:    e02a        *.      B        0x29a0 ; RIPD_GetRisingCurrentFunct + 128
        0x0000294a:    2112        .!      MOVS     r1,#0x12
        0x0000294c:    5e61        a^      LDRSH    r1,[r4,r1]
        0x0000294e:    2964        d)      CMP      r1,#0x64
        0x00002950:    da03        ..      BGE      0x295a ; RIPD_GetRisingCurrentFunct + 58
        0x00002952:    2000        .       MOVS     r0,#0
        0x00002954:    f7fffa80    ....    BL       Inport_Plus_PWM ; 0x1e58
        0x00002958:    e022        ".      B        0x29a0 ; RIPD_GetRisingCurrentFunct + 128
        0x0000295a:    2112        .!      MOVS     r1,#0x12
        0x0000295c:    5e61        a^      LDRSH    r1,[r4,r1]
        0x0000295e:    2964        d)      CMP      r1,#0x64
        0x00002960:    db07        ..      BLT      0x2972 ; RIPD_GetRisingCurrentFunct + 82
        0x00002962:    2112        .!      MOVS     r1,#0x12
        0x00002964:    5e61        a^      LDRSH    r1,[r4,r1]
        0x00002966:    296e        n)      CMP      r1,#0x6e
        0x00002968:    da03        ..      BGE      0x2972 ; RIPD_GetRisingCurrentFunct + 82
        0x0000296a:    2001        .       MOVS     r0,#1
        0x0000296c:    f7fffa74    ..t.    BL       Inport_Plus_PWM ; 0x1e58
        0x00002970:    e016        ..      B        0x29a0 ; RIPD_GetRisingCurrentFunct + 128
        0x00002972:    2112        .!      MOVS     r1,#0x12
        0x00002974:    5e61        a^      LDRSH    r1,[r4,r1]
        0x00002976:    296e        n)      CMP      r1,#0x6e
        0x00002978:    db07        ..      BLT      0x298a ; RIPD_GetRisingCurrentFunct + 106
        0x0000297a:    2112        .!      MOVS     r1,#0x12
        0x0000297c:    5e61        a^      LDRSH    r1,[r4,r1]
        0x0000297e:    2978        x)      CMP      r1,#0x78
        0x00002980:    da03        ..      BGE      0x298a ; RIPD_GetRisingCurrentFunct + 106
        0x00002982:    2004        .       MOVS     r0,#4
        0x00002984:    f7fffa68    ..h.    BL       Inport_Plus_PWM ; 0x1e58
        0x00002988:    e00a        ..      B        0x29a0 ; RIPD_GetRisingCurrentFunct + 128
        0x0000298a:    2112        .!      MOVS     r1,#0x12
        0x0000298c:    5e61        a^      LDRSH    r1,[r4,r1]
        0x0000298e:    2978        x)      CMP      r1,#0x78
        0x00002990:    db06        ..      BLT      0x29a0 ; RIPD_GetRisingCurrentFunct + 128
        0x00002992:    2112        .!      MOVS     r1,#0x12
        0x00002994:    5e61        a^      LDRSH    r1,[r4,r1]
        0x00002996:    4281        .B      CMP      r1,r0
        0x00002998:    da02        ..      BGE      0x29a0 ; RIPD_GetRisingCurrentFunct + 128
        0x0000299a:    2000        .       MOVS     r0,#0
        0x0000299c:    f7fffa5c    ..\.    BL       Inport_Plus_PWM ; 0x1e58
        0x000029a0:    2004        .       MOVS     r0,#4
        0x000029a2:    5e20         ^      LDRSH    r0,[r4,r0]
        0x000029a4:    2806        .(      CMP      r0,#6
        0x000029a6:    dc64        d.      BGT      0x2a72 ; RIPD_GetRisingCurrentFunct + 338
        0x000029a8:    88e0        ..      LDRH     r0,[r4,#6]
        0x000029aa:    2800        .(      CMP      r0,#0
        0x000029ac:    d061        a.      BEQ      0x2a72 ; RIPD_GetRisingCurrentFunct + 338
        0x000029ae:    8920         .      LDRH     r0,[r4,#8]
        0x000029b0:    4f3f        ?O      LDR      r7,[pc,#252] ; [0x2ab0] = 0x20000f4c
        0x000029b2:    2800        .(      CMP      r0,#0
        0x000029b4:    d117        ..      BNE      0x29e6 ; RIPD_GetRisingCurrentFunct + 198
        0x000029b6:    2103        .!      MOVS     r1,#3
        0x000029b8:    483e        >H      LDR      r0,[pc,#248] ; [0x2ab4] = 0x40004000
        0x000029ba:    f7fefefd    ....    BL       GPIO_InvBit ; 0x17b8
        0x000029be:    2004        .       MOVS     r0,#4
        0x000029c0:    5e20         ^      LDRSH    r0,[r4,r0]
        0x000029c2:    f7fffa49    ..I.    BL       Inport_Plus_PWM ; 0x1e58
        0x000029c6:    2112        .!      MOVS     r1,#0x12
        0x000029c8:    5e61        a^      LDRSH    r1,[r4,r1]
        0x000029ca:    2004        .       MOVS     r0,#4
        0x000029cc:    5e20         ^      LDRSH    r0,[r4,r0]
        0x000029ce:    f7feff85    ....    BL       IN_Count ; 0x18dc
        0x000029d2:    8a60        `.      LDRH     r0,[r4,#0x12]
        0x000029d4:    1c40        @.      ADDS     r0,r0,#1
        0x000029d6:    8260        `.      STRH     r0,[r4,#0x12]
        0x000029d8:    2012        .       MOVS     r0,#0x12
        0x000029da:    5e20         ^      LDRSH    r0,[r4,r0]
        0x000029dc:    6d79        ym      LDR      r1,[r7,#0x54]
        0x000029de:    4288        .B      CMP      r0,r1
        0x000029e0:    d901        ..      BLS      0x29e6 ; RIPD_GetRisingCurrentFunct + 198
        0x000029e2:    8126        &.      STRH     r6,[r4,#8]
        0x000029e4:    8265        e.      STRH     r5,[r4,#0x12]
        0x000029e6:    8960        `.      LDRH     r0,[r4,#0xa]
        0x000029e8:    2800        .(      CMP      r0,#0
        0x000029ea:    d10f        ..      BNE      0x2a0c ; RIPD_GetRisingCurrentFunct + 236
        0x000029ec:    8920         .      LDRH     r0,[r4,#8]
        0x000029ee:    2801        .(      CMP      r0,#1
        0x000029f0:    d10c        ..      BNE      0x2a0c ; RIPD_GetRisingCurrentFunct + 236
        0x000029f2:    2008        .       MOVS     r0,#8
        0x000029f4:    f7fffa30    ..0.    BL       Inport_Plus_PWM ; 0x1e58
        0x000029f8:    8a60        `.      LDRH     r0,[r4,#0x12]
        0x000029fa:    1c40        @.      ADDS     r0,r0,#1
        0x000029fc:    8260        `.      STRH     r0,[r4,#0x12]
        0x000029fe:    2012        .       MOVS     r0,#0x12
        0x00002a00:    5e20         ^      LDRSH    r0,[r4,r0]
        0x00002a02:    6db9        .m      LDR      r1,[r7,#0x58]
        0x00002a04:    4288        .B      CMP      r0,r1
        0x00002a06:    d901        ..      BLS      0x2a0c ; RIPD_GetRisingCurrentFunct + 236
        0x00002a08:    8166        f.      STRH     r6,[r4,#0xa]
        0x00002a0a:    8265        e.      STRH     r5,[r4,#0x12]
        0x00002a0c:    89a0        ..      LDRH     r0,[r4,#0xc]
        0x00002a0e:    2800        .(      CMP      r0,#0
        0x00002a10:    d115        ..      BNE      0x2a3e ; RIPD_GetRisingCurrentFunct + 286
        0x00002a12:    8960        `.      LDRH     r0,[r4,#0xa]
        0x00002a14:    2801        .(      CMP      r0,#1
        0x00002a16:    d112        ..      BNE      0x2a3e ; RIPD_GetRisingCurrentFunct + 286
        0x00002a18:    88a0        ..      LDRH     r0,[r4,#4]
        0x00002a1a:    1cc0        ..      ADDS     r0,r0,#3
        0x00002a1c:    b200        ..      SXTH     r0,r0
        0x00002a1e:    2806        .(      CMP      r0,#6
        0x00002a20:    dd01        ..      BLE      0x2a26 ; RIPD_GetRisingCurrentFunct + 262
        0x00002a22:    1f80        ..      SUBS     r0,r0,#6
        0x00002a24:    b200        ..      SXTH     r0,r0
        0x00002a26:    f7fffa17    ....    BL       Inport_Plus_PWM ; 0x1e58
        0x00002a2a:    8a60        `.      LDRH     r0,[r4,#0x12]
        0x00002a2c:    1c40        @.      ADDS     r0,r0,#1
        0x00002a2e:    8260        `.      STRH     r0,[r4,#0x12]
        0x00002a30:    2012        .       MOVS     r0,#0x12
        0x00002a32:    5e20         ^      LDRSH    r0,[r4,r0]
        0x00002a34:    6df9        .m      LDR      r1,[r7,#0x5c]
        0x00002a36:    4288        .B      CMP      r0,r1
        0x00002a38:    d901        ..      BLS      0x2a3e ; RIPD_GetRisingCurrentFunct + 286
        0x00002a3a:    81a6        ..      STRH     r6,[r4,#0xc]
        0x00002a3c:    8265        e.      STRH     r5,[r4,#0x12]
        0x00002a3e:    89e0        ..      LDRH     r0,[r4,#0xe]
        0x00002a40:    2800        .(      CMP      r0,#0
        0x00002a42:    d116        ..      BNE      0x2a72 ; RIPD_GetRisingCurrentFunct + 338
        0x00002a44:    89a0        ..      LDRH     r0,[r4,#0xc]
        0x00002a46:    2801        .(      CMP      r0,#1
        0x00002a48:    d113        ..      BNE      0x2a72 ; RIPD_GetRisingCurrentFunct + 338
        0x00002a4a:    2000        .       MOVS     r0,#0
        0x00002a4c:    f7fffa04    ....    BL       Inport_Plus_PWM ; 0x1e58
        0x00002a50:    8a60        `.      LDRH     r0,[r4,#0x12]
        0x00002a52:    1c40        @.      ADDS     r0,r0,#1
        0x00002a54:    8260        `.      STRH     r0,[r4,#0x12]
        0x00002a56:    2012        .       MOVS     r0,#0x12
        0x00002a58:    5e20         ^      LDRSH    r0,[r4,r0]
        0x00002a5a:    6e39        9n      LDR      r1,[r7,#0x60]
        0x00002a5c:    4288        .B      CMP      r0,r1
        0x00002a5e:    d908        ..      BLS      0x2a72 ; RIPD_GetRisingCurrentFunct + 338
        0x00002a60:    81e6        ..      STRH     r6,[r4,#0xe]
        0x00002a62:    8265        e.      STRH     r5,[r4,#0x12]
        0x00002a64:    88a0        ..      LDRH     r0,[r4,#4]
        0x00002a66:    1c40        @.      ADDS     r0,r0,#1
        0x00002a68:    80a0        ..      STRH     r0,[r4,#4]
        0x00002a6a:    8125        %.      STRH     r5,[r4,#8]
        0x00002a6c:    8165        e.      STRH     r5,[r4,#0xa]
        0x00002a6e:    81a5        ..      STRH     r5,[r4,#0xc]
        0x00002a70:    81e5        ..      STRH     r5,[r4,#0xe]
        0x00002a72:    2004        .       MOVS     r0,#4
        0x00002a74:    5e20         ^      LDRSH    r0,[r4,r0]
        0x00002a76:    2806        .(      CMP      r0,#6
        0x00002a78:    dd0a        ..      BLE      0x2a90 ; RIPD_GetRisingCurrentFunct + 368
        0x00002a7a:    8a60        `.      LDRH     r0,[r4,#0x12]
        0x00002a7c:    1c40        @.      ADDS     r0,r0,#1
        0x00002a7e:    8260        `.      STRH     r0,[r4,#0x12]
        0x00002a80:    2112        .!      MOVS     r1,#0x12
        0x00002a82:    5e61        a^      LDRSH    r1,[r4,r1]
        0x00002a84:    480c        .H      LDR      r0,[pc,#48] ; [0x2ab8] = 0x5dc
        0x00002a86:    4281        .B      CMP      r1,r0
        0x00002a88:    db03        ..      BLT      0x2a92 ; RIPD_GetRisingCurrentFunct + 370
        0x00002a8a:    8265        e.      STRH     r5,[r4,#0x12]
        0x00002a8c:    80a6        ..      STRH     r6,[r4,#4]
        0x00002a8e:    80e5        ..      STRH     r5,[r4,#6]
        0x00002a90:    bdf8        ..      POP      {r3-r7,pc}
        0x00002a92:    2212        ."      MOVS     r2,#0x12
        0x00002a94:    5ea2        .^      LDRSH    r2,[r4,r2]
        0x00002a96:    217d        }!      MOVS     r1,#0x7d
        0x00002a98:    00c9        ..      LSLS     r1,r1,#3
        0x00002a9a:    428a        .B      CMP      r2,r1
        0x00002a9c:    ddf8        ..      BLE      0x2a90 ; RIPD_GetRisingCurrentFunct + 368
        0x00002a9e:    2112        .!      MOVS     r1,#0x12
        0x00002aa0:    5e61        a^      LDRSH    r1,[r4,r1]
        0x00002aa2:    4281        .B      CMP      r1,r0
        0x00002aa4:    daf4        ..      BGE      0x2a90 ; RIPD_GetRisingCurrentFunct + 368
        0x00002aa6:    f7feff4d    ..M.    BL       IPD_SlopCount ; 0x1944
        0x00002aaa:    bdf8        ..      POP      {r3-r7,pc}
    $d
        0x00002aac:    20000f8c    ...     DCD    536874892
        0x00002ab0:    20000f4c    L..     DCD    536874828
        0x00002ab4:    40004000    .@.@    DCD    1073758208
        0x00002ab8:    000005dc    ....    DCD    1500
    $t
    i.SMO_TailWindDealwith
    SMO_TailWindDealwith
        0x00002abc:    b5f8        ..      PUSH     {r3-r7,lr}
        0x00002abe:    4925        %I      LDR      r1,[pc,#148] ; [0x2b54] = 0x200001e4
        0x00002ac0:    4d26        &M      LDR      r5,[pc,#152] ; [0x2b5c] = 0x20000268
        0x00002ac2:    7908        .y      LDRB     r0,[r1,#4]
        0x00002ac4:    462c        ,F      MOV      r4,r5
        0x00002ac6:    2600        .&      MOVS     r6,#0
        0x00002ac8:    4f23        #O      LDR      r7,[pc,#140] ; [0x2b58] = 0x20000010
        0x00002aca:    3460        `4      ADDS     r4,r4,#0x60
        0x00002acc:    2800        .(      CMP      r0,#0
        0x00002ace:    d102        ..      BNE      0x2ad6 ; SMO_TailWindDealwith + 26
        0x00002ad0:    7c4a        J|      LDRB     r2,[r1,#0x11]
        0x00002ad2:    2a04        .*      CMP      r2,#4
        0x00002ad4:    d802        ..      BHI      0x2adc ; SMO_TailWindDealwith + 32
        0x00002ad6:    7c09        .|      LDRB     r1,[r1,#0x10]
        0x00002ad8:    2900        .)      CMP      r1,#0
        0x00002ada:    d00a        ..      BEQ      0x2af2 ; SMO_TailWindDealwith + 54
        0x00002adc:    f7fffd06    ....    BL       PI_Init ; 0x24ec
        0x00002ae0:    2007        .       MOVS     r0,#7
        0x00002ae2:    7038        8p      STRB     r0,[r7,#0]
        0x00002ae4:    491f        .I      LDR      r1,[pc,#124] ; [0x2b64] = 0x2000023a
        0x00002ae6:    481e        .H      LDR      r0,[pc,#120] ; [0x2b60] = 0x666
        0x00002ae8:    8348        H.      STRH     r0,[r1,#0x1a]
        0x00002aea:    2001        .       MOVS     r0,#1
        0x00002aec:    72a0        .r      STRB     r0,[r4,#0xa]
        0x00002aee:    65ae        .e      STR      r6,[r5,#0x58]
        0x00002af0:    bdf8        ..      POP      {r3-r7,pc}
        0x00002af2:    4a18        .J      LDR      r2,[pc,#96] ; [0x2b54] = 0x200001e4
        0x00002af4:    2801        .(      CMP      r0,#1
        0x00002af6:    8851        Q.      LDRH     r1,[r2,#2]
        0x00002af8:    79d2        .y      LDRB     r2,[r2,#7]
        0x00002afa:    d121        !.      BNE      0x2b40 ; SMO_TailWindDealwith + 132
        0x00002afc:    2901        .)      CMP      r1,#1
        0x00002afe:    d91f        ..      BLS      0x2b40 ; SMO_TailWindDealwith + 132
        0x00002b00:    2a03        .*      CMP      r2,#3
        0x00002b02:    d31d        ..      BCC      0x2b40 ; SMO_TailWindDealwith + 132
        0x00002b04:    2187        .!      MOVS     r1,#0x87
        0x00002b06:    4818        .H      LDR      r0,[pc,#96] ; [0x2b68] = 0x20000064
        0x00002b08:    43c9        .C      MVNS     r1,r1
        0x00002b0a:    8601        ..      STRH     r1,[r0,#0x30]
        0x00002b0c:    21ff        .!      MOVS     r1,#0xff
        0x00002b0e:    31f5        .1      ADDS     r1,r1,#0xf5
        0x00002b10:    63c1        .c      STR      r1,[r0,#0x3c]
        0x00002b12:    4916        .I      LDR      r1,[pc,#88] ; [0x2b6c] = 0x4e20
        0x00002b14:    64c1        .d      STR      r1,[r0,#0x4c]
        0x00002b16:    2005        .       MOVS     r0,#5
        0x00002b18:    7038        8p      STRB     r0,[r7,#0]
        0x00002b1a:    4815        .H      LDR      r0,[pc,#84] ; [0x2b70] = 0x1803010
        0x00002b1c:    6328        (c      STR      r0,[r5,#0x30]
        0x00002b1e:    4815        .H      LDR      r0,[pc,#84] ; [0x2b74] = 0x3b18d0
        0x00002b20:    6368        hc      STR      r0,[r5,#0x34]
        0x00002b22:    4815        .H      LDR      r0,[pc,#84] ; [0x2b78] = 0x19a2a92
        0x00002b24:    63e8        .c      STR      r0,[r5,#0x3c]
        0x00002b26:    4815        .H      LDR      r0,[pc,#84] ; [0x2b7c] = 0x12187
        0x00002b28:    6428        (d      STR      r0,[r5,#0x40]
        0x00002b2a:    4916        .I      LDR      r1,[pc,#88] ; [0x2b84] = 0x20000304
        0x00002b2c:    4814        .H      LDR      r0,[pc,#80] ; [0x2b80] = 0xfff
        0x00002b2e:    6108        .a      STR      r0,[r1,#0x10]
        0x00002b30:    22ff        ."      MOVS     r2,#0xff
        0x00002b32:    3248        H2      ADDS     r2,r2,#0x48
        0x00002b34:    614a        Ja      STR      r2,[r1,#0x14]
        0x00002b36:    4914        .I      LDR      r1,[pc,#80] ; [0x2b88] = 0x200002dc
        0x00002b38:    6108        .a      STR      r0,[r1,#0x10]
        0x00002b3a:    614a        Ja      STR      r2,[r1,#0x14]
        0x00002b3c:    74a6        .t      STRB     r6,[r4,#0x12]
        0x00002b3e:    bdf8        ..      POP      {r3-r7,pc}
        0x00002b40:    2800        .(      CMP      r0,#0
        0x00002b42:    d1fc        ..      BNE      0x2b3e ; SMO_TailWindDealwith + 130
        0x00002b44:    2996        .)      CMP      r1,#0x96
        0x00002b46:    d9fa        ..      BLS      0x2b3e ; SMO_TailWindDealwith + 130
        0x00002b48:    2a02        .*      CMP      r2,#2
        0x00002b4a:    d3f8        ..      BCC      0x2b3e ; SMO_TailWindDealwith + 130
        0x00002b4c:    f7fefaec    ....    BL       FOCCloseLoopStart ; 0x1128
        0x00002b50:    bdf8        ..      POP      {r3-r7,pc}
    $d
        0x00002b52:    0000        ..      DCW    0
        0x00002b54:    200001e4    ...     DCD    536871396
        0x00002b58:    20000010    ...     DCD    536870928
        0x00002b5c:    20000268    h..     DCD    536871528
        0x00002b60:    00000666    f...    DCD    1638
        0x00002b64:    2000023a    :..     DCD    536871482
        0x00002b68:    20000064    d..     DCD    536871012
        0x00002b6c:    00004e20     N..    DCD    20000
        0x00002b70:    01803010    .0..    DCD    25178128
        0x00002b74:    003b18d0    ..;.    DCD    3872976
        0x00002b78:    019a2a92    .*..    DCD    26880658
        0x00002b7c:    00012187    .!..    DCD    74119
        0x00002b80:    00000fff    ....    DCD    4095
        0x00002b84:    20000304    ...     DCD    536871684
        0x00002b88:    200002dc    ...     DCD    536871644
    $t
    i.Sin_Cos_Cale
    Sin_Cos_Cale
        0x00002b8c:    b410        ..      PUSH     {r4}
        0x00002b8e:    2124        $!      MOVS     r1,#0x24
