747lulu747/SAOZHAN_BRUASH/src/SDK-LIB/华芯第一版本硬件-非FPC/ROMAN-21DD - SDK - V0.1/out/SWM211.asm
        0x00002b90:    5e41        A^      LDRSH    r1,[r0,r1]
        0x00002b92:    1189        ..      ASRS     r1,r1,#6
        0x00002b94:    2203        ."      MOVS     r2,#3
        0x00002b96:    0212        ..      LSLS     r2,r2,#8
        0x00002b98:    400a        .@      ANDS     r2,r2,r1
        0x00002b9a:    4b1c        .K      LDR      r3,[pc,#112] ; [0x2c0c] = 0x3bd0
        0x00002b9c:    24ff        .$      MOVS     r4,#0xff
        0x00002b9e:    2a00        .*      CMP      r2,#0
        0x00002ba0:    d013        ..      BEQ      0x2bca ; Sin_Cos_Cale + 62
        0x00002ba2:    3aff        .:      SUBS     r2,r2,#0xff
        0x00002ba4:    3a01        .:      SUBS     r2,#1
        0x00002ba6:    d01a        ..      BEQ      0x2bde ; Sin_Cos_Cale + 82
        0x00002ba8:    3aff        .:      SUBS     r2,r2,#0xff
        0x00002baa:    3a01        .:      SUBS     r2,#1
        0x00002bac:    d022        ".      BEQ      0x2bf4 ; Sin_Cos_Cale + 104
        0x00002bae:    3aff        .:      SUBS     r2,r2,#0xff
        0x00002bb0:    3a01        .:      SUBS     r2,#1
        0x00002bb2:    d108        ..      BNE      0x2bc6 ; Sin_Cos_Cale + 58
        0x00002bb4:    b2c9        ..      UXTB     r1,r1
        0x00002bb6:    1a62        b.      SUBS     r2,r4,r1
        0x00002bb8:    0052        R.      LSLS     r2,r2,#1
        0x00002bba:    5a9a        .Z      LDRH     r2,[r3,r2]
        0x00002bbc:    4252        RB      RSBS     r2,r2,#0
        0x00002bbe:    8402        ..      STRH     r2,[r0,#0x20]
        0x00002bc0:    0049        I.      LSLS     r1,r1,#1
        0x00002bc2:    5a59        YZ      LDRH     r1,[r3,r1]
        0x00002bc4:    8441        A.      STRH     r1,[r0,#0x22]
        0x00002bc6:    bc10        ..      POP      {r4}
        0x00002bc8:    4770        pG      BX       lr
        0x00002bca:    b2c9        ..      UXTB     r1,r1
        0x00002bcc:    004a        J.      LSLS     r2,r1,#1
        0x00002bce:    5a9a        .Z      LDRH     r2,[r3,r2]
        0x00002bd0:    8402        ..      STRH     r2,[r0,#0x20]
        0x00002bd2:    1a61        a.      SUBS     r1,r4,r1
        0x00002bd4:    0049        I.      LSLS     r1,r1,#1
        0x00002bd6:    5a59        YZ      LDRH     r1,[r3,r1]
        0x00002bd8:    8441        A.      STRH     r1,[r0,#0x22]
        0x00002bda:    bc10        ..      POP      {r4}
        0x00002bdc:    4770        pG      BX       lr
        0x00002bde:    b2c9        ..      UXTB     r1,r1
        0x00002be0:    1a62        b.      SUBS     r2,r4,r1
        0x00002be2:    0052        R.      LSLS     r2,r2,#1
        0x00002be4:    5a9a        .Z      LDRH     r2,[r3,r2]
        0x00002be6:    8402        ..      STRH     r2,[r0,#0x20]
        0x00002be8:    0049        I.      LSLS     r1,r1,#1
        0x00002bea:    5a59        YZ      LDRH     r1,[r3,r1]
        0x00002bec:    4249        IB      RSBS     r1,r1,#0
        0x00002bee:    8441        A.      STRH     r1,[r0,#0x22]
        0x00002bf0:    bc10        ..      POP      {r4}
        0x00002bf2:    4770        pG      BX       lr
        0x00002bf4:    b2c9        ..      UXTB     r1,r1
        0x00002bf6:    004a        J.      LSLS     r2,r1,#1
        0x00002bf8:    5a9a        .Z      LDRH     r2,[r3,r2]
        0x00002bfa:    4252        RB      RSBS     r2,r2,#0
        0x00002bfc:    8402        ..      STRH     r2,[r0,#0x20]
        0x00002bfe:    1a61        a.      SUBS     r1,r4,r1
        0x00002c00:    0049        I.      LSLS     r1,r1,#1
        0x00002c02:    5a59        YZ      LDRH     r1,[r3,r1]
        0x00002c04:    4249        IB      RSBS     r1,r1,#0
        0x00002c06:    8441        A.      STRH     r1,[r0,#0x22]
        0x00002c08:    bc10        ..      POP      {r4}
        0x00002c0a:    4770        pG      BX       lr
    $d
        0x00002c0c:    00003bd0    .;..    DCD    15312
    $t
    i.SingleR_ADCInject_Deal
    SingleR_ADCInject_Deal
        0x00002c10:    b510        ..      PUSH     {r4,lr}
        0x00002c12:    4824        $H      LDR      r0,[pc,#144] ; [0x2ca4] = 0x200000f4
        0x00002c14:    4c24        $L      LDR      r4,[pc,#144] ; [0x2ca8] = 0x40049000
        0x00002c16:    8982        ..      LDRH     r2,[r0,#0xc]
        0x00002c18:    2a00        .*      CMP      r2,#0
        0x00002c1a:    d018        ..      BEQ      0x2c4e ; SingleR_ADCInject_Deal + 62
        0x00002c1c:    4923        #I      LDR      r1,[pc,#140] ; [0x2cac] = 0x400490c0
        0x00002c1e:    4b24        $K      LDR      r3,[pc,#144] ; [0x2cb0] = 0xf000ffff
        0x00002c20:    2a01        .*      CMP      r2,#1
        0x00002c22:    d01b        ..      BEQ      0x2c5c ; SingleR_ADCInject_Deal + 76
        0x00002c24:    2a02        .*      CMP      r2,#2
        0x00002c26:    d111        ..      BNE      0x2c4c ; SingleR_ADCInject_Deal + 60
        0x00002c28:    2200        ."      MOVS     r2,#0
        0x00002c2a:    8182        ..      STRH     r2,[r0,#0xc]
        0x00002c2c:    6908        .i      LDR      r0,[r1,#0x10]
        0x00002c2e:    4018        .@      ANDS     r0,r0,r3
        0x00002c30:    6108        .a      STR      r0,[r1,#0x10]
        0x00002c32:    6908        .i      LDR      r0,[r1,#0x10]
        0x00002c34:    2201        ."      MOVS     r2,#1
        0x00002c36:    0492        ..      LSLS     r2,r2,#18
        0x00002c38:    4310        .C      ORRS     r0,r0,r2
        0x00002c3a:    6108        .a      STR      r0,[r1,#0x10]
        0x00002c3c:    6908        .i      LDR      r0,[r1,#0x10]
        0x00002c3e:    0b00        ..      LSRS     r0,r0,#12
        0x00002c40:    0300        ..      LSLS     r0,r0,#12
        0x00002c42:    6108        .a      STR      r0,[r1,#0x10]
        0x00002c44:    6908        .i      LDR      r0,[r1,#0x10]
        0x00002c46:    2204        ."      MOVS     r2,#4
        0x00002c48:    4310        .C      ORRS     r0,r0,r2
        0x00002c4a:    6108        .a      STR      r0,[r1,#0x10]
        0x00002c4c:    bd10        ..      POP      {r4,pc}
        0x00002c4e:    2101        .!      MOVS     r1,#1
        0x00002c50:    8181        ..      STRH     r1,[r0,#0xc]
        0x00002c52:    6b61        ak      LDR      r1,[r4,#0x34]
        0x00002c54:    0509        ..      LSLS     r1,r1,#20
        0x00002c56:    0c49        I.      LSRS     r1,r1,#17
        0x00002c58:    8201        ..      STRH     r1,[r0,#0x10]
        0x00002c5a:    bd10        ..      POP      {r4,pc}
        0x00002c5c:    2202        ."      MOVS     r2,#2
        0x00002c5e:    8182        ..      STRH     r2,[r0,#0xc]
        0x00002c60:    6b62        bk      LDR      r2,[r4,#0x34]
        0x00002c62:    0512        ..      LSLS     r2,r2,#20
        0x00002c64:    0c52        R.      LSRS     r2,r2,#17
        0x00002c66:    81c2        ..      STRH     r2,[r0,#0xe]
        0x00002c68:    6908        .i      LDR      r0,[r1,#0x10]
        0x00002c6a:    4018        .@      ANDS     r0,r0,r3
        0x00002c6c:    6108        .a      STR      r0,[r1,#0x10]
        0x00002c6e:    6908        .i      LDR      r0,[r1,#0x10]
        0x00002c70:    2261        a"      MOVS     r2,#0x61
        0x00002c72:    0492        ..      LSLS     r2,r2,#18
        0x00002c74:    4310        .C      ORRS     r0,r0,r2
        0x00002c76:    6108        .a      STR      r0,[r1,#0x10]
        0x00002c78:    6908        .i      LDR      r0,[r1,#0x10]
        0x00002c7a:    0b00        ..      LSRS     r0,r0,#12
        0x00002c7c:    0300        ..      LSLS     r0,r0,#12
        0x00002c7e:    6108        .a      STR      r0,[r1,#0x10]
        0x00002c80:    6908        .i      LDR      r0,[r1,#0x10]
        0x00002c82:    1412        ..      ASRS     r2,r2,#16
        0x00002c84:    4310        .C      ORRS     r0,r0,r2
        0x00002c86:    6108        .a      STR      r0,[r1,#0x10]
        0x00002c88:    6820         h      LDR      r0,[r4,#0]
        0x00002c8a:    2107        .!      MOVS     r1,#7
        0x00002c8c:    0389        ..      LSLS     r1,r1,#14
        0x00002c8e:    4388        .C      BICS     r0,r0,r1
        0x00002c90:    6020         `      STR      r0,[r4,#0]
        0x00002c92:    4620         F      MOV      r0,r4
        0x00002c94:    f7fef9b2    ....    BL       ADC_Start ; 0xffc
        0x00002c98:    6820         h      LDR      r0,[r4,#0]
        0x00002c9a:    2101        .!      MOVS     r1,#1
        0x00002c9c:    0389        ..      LSLS     r1,r1,#14
        0x00002c9e:    4308        .C      ORRS     r0,r0,r1
        0x00002ca0:    6020         `      STR      r0,[r4,#0]
        0x00002ca2:    bd10        ..      POP      {r4,pc}
    $d
        0x00002ca4:    200000f4    ...     DCD    536871156
        0x00002ca8:    40049000    ...@    DCD    1074040832
        0x00002cac:    400490c0    ...@    DCD    1074041024
        0x00002cb0:    f000ffff    ....    DCD    4026597375
    $t
    i.SingleR_Get_PhaseCurrent
    SingleR_Get_PhaseCurrent
        0x00002cb4:    b430        0.      PUSH     {r4,r5}
        0x00002cb6:    4827        'H      LDR      r0,[pc,#156] ; [0x2d54] = 0x20000204
        0x00002cb8:    2324        $#      MOVS     r3,#0x24
        0x00002cba:    5ec3        .^      LDRSH    r3,[r0,r3]
        0x00002cbc:    4826        &H      LDR      r0,[pc,#152] ; [0x2d58] = 0x20000160
        0x00002cbe:    4c28        (L      LDR      r4,[pc,#160] ; [0x2d60] = 0x200000f4
        0x00002cc0:    8b01        ..      LDRH     r1,[r0,#0x18]
        0x00002cc2:    89e5        ..      LDRH     r5,[r4,#0xe]
        0x00002cc4:    8a24        $.      LDRH     r4,[r4,#0x10]
        0x00002cc6:    1b48        H.      SUBS     r0,r1,r5
        0x00002cc8:    1a61        a.      SUBS     r1,r4,r1
        0x00002cca:    4a24        $J      LDR      r2,[pc,#144] ; [0x2d5c] = 0x2000023a
        0x00002ccc:    b200        ..      SXTH     r0,r0
        0x00002cce:    b209        ..      SXTH     r1,r1
        0x00002cd0:    2b07        .+      CMP      r3,#7
        0x00002cd2:    d20f        ..      BCS      0x2cf4 ; SingleR_Get_PhaseCurrent + 64
        0x00002cd4:    001c        ..      MOVS     r4,r3
        0x00002cd6:    447c        |D      ADD      r4,r4,pc
        0x00002cd8:    7924        $y      LDRB     r4,[r4,#4]
        0x00002cda:    1924        $.      ADDS     r4,r4,r4
        0x00002cdc:    44a7        .D      ADD      pc,pc,r4
    $d
        0x00002cde:    030a        ..      DCW    778
        0x00002ce0:    271e150c    ...'    DCD    656282892
        0x00002ce4:    0030        0.      DCW    48
    $t
        0x00002ce6:    80d0        ..      STRH     r0,[r2,#6]
        0x00002ce8:    8091        ..      STRH     r1,[r2,#4]
        0x00002cea:    8890        ..      LDRH     r0,[r2,#4]
        0x00002cec:    88d1        ..      LDRH     r1,[r2,#6]
        0x00002cee:    1840        @.      ADDS     r0,r0,r1
        0x00002cf0:    4240        @B      RSBS     r0,r0,#0
        0x00002cf2:    8050        P.      STRH     r0,[r2,#2]
        0x00002cf4:    bc30        0.      POP      {r4,r5}
        0x00002cf6:    4770        pG      BX       lr
        0x00002cf8:    8090        ..      STRH     r0,[r2,#4]
        0x00002cfa:    8051        Q.      STRH     r1,[r2,#2]
        0x00002cfc:    8850        P.      LDRH     r0,[r2,#2]
        0x00002cfe:    8891        ..      LDRH     r1,[r2,#4]
        0x00002d00:    1840        @.      ADDS     r0,r0,r1
        0x00002d02:    4240        @B      RSBS     r0,r0,#0
        0x00002d04:    80d0        ..      STRH     r0,[r2,#6]
        0x00002d06:    bc30        0.      POP      {r4,r5}
        0x00002d08:    4770        pG      BX       lr
        0x00002d0a:    80d0        ..      STRH     r0,[r2,#6]
        0x00002d0c:    8051        Q.      STRH     r1,[r2,#2]
        0x00002d0e:    8850        P.      LDRH     r0,[r2,#2]
        0x00002d10:    88d1        ..      LDRH     r1,[r2,#6]
        0x00002d12:    1840        @.      ADDS     r0,r0,r1
        0x00002d14:    4240        @B      RSBS     r0,r0,#0
        0x00002d16:    8090        ..      STRH     r0,[r2,#4]
        0x00002d18:    bc30        0.      POP      {r4,r5}
        0x00002d1a:    4770        pG      BX       lr
        0x00002d1c:    8050        P.      STRH     r0,[r2,#2]
        0x00002d1e:    80d1        ..      STRH     r1,[r2,#6]
        0x00002d20:    8850        P.      LDRH     r0,[r2,#2]
        0x00002d22:    88d1        ..      LDRH     r1,[r2,#6]
        0x00002d24:    1840        @.      ADDS     r0,r0,r1
        0x00002d26:    4240        @B      RSBS     r0,r0,#0
        0x00002d28:    8090        ..      STRH     r0,[r2,#4]
        0x00002d2a:    bc30        0.      POP      {r4,r5}
        0x00002d2c:    4770        pG      BX       lr
        0x00002d2e:    8050        P.      STRH     r0,[r2,#2]
        0x00002d30:    8091        ..      STRH     r1,[r2,#4]
        0x00002d32:    8850        P.      LDRH     r0,[r2,#2]
        0x00002d34:    8891        ..      LDRH     r1,[r2,#4]
        0x00002d36:    1840        @.      ADDS     r0,r0,r1
        0x00002d38:    4240        @B      RSBS     r0,r0,#0
        0x00002d3a:    80d0        ..      STRH     r0,[r2,#6]
        0x00002d3c:    bc30        0.      POP      {r4,r5}
        0x00002d3e:    4770        pG      BX       lr
        0x00002d40:    8090        ..      STRH     r0,[r2,#4]
        0x00002d42:    80d1        ..      STRH     r1,[r2,#6]
        0x00002d44:    8890        ..      LDRH     r0,[r2,#4]
        0x00002d46:    88d1        ..      LDRH     r1,[r2,#6]
        0x00002d48:    1840        @.      ADDS     r0,r0,r1
        0x00002d4a:    4240        @B      RSBS     r0,r0,#0
        0x00002d4c:    8050        P.      STRH     r0,[r2,#2]
        0x00002d4e:    bc30        0.      POP      {r4,r5}
        0x00002d50:    4770        pG      BX       lr
    $d
        0x00002d52:    0000        ..      DCW    0
        0x00002d54:    20000204    ...     DCD    536871428
        0x00002d58:    20000160    `..     DCD    536871264
        0x00002d5c:    2000023a    :..     DCD    536871482
        0x00002d60:    200000f4    ...     DCD    536871156
    $t
    i.SoftwareInit
    SoftwareInit
        0x00002d64:    b510        ..      PUSH     {r4,lr}
        0x00002d66:    f7fffb6b    ..k.    BL       MotorcontrolInit ; 0x2440
        0x00002d6a:    4903        .I      LDR      r1,[pc,#12] ; [0x2d78] = 0x20000010
        0x00002d6c:    2000        .       MOVS     r0,#0
        0x00002d6e:    7008        .p      STRB     r0,[r1,#0]
        0x00002d70:    4902        .I      LDR      r1,[pc,#8] ; [0x2d7c] = 0x20000018
        0x00002d72:    7008        .p      STRB     r0,[r1,#0]
        0x00002d74:    bd10        ..      POP      {r4,pc}
    $d
        0x00002d76:    0000        ..      DCW    0
        0x00002d78:    20000010    ...     DCD    536870928
        0x00002d7c:    20000018    ...     DCD    536870936
    $t
    i.SpeedMode_Control
    SpeedMode_Control
        0x00002d80:    b570        p.      PUSH     {r4-r6,lr}
        0x00002d82:    4c17        .L      LDR      r4,[pc,#92] ; [0x2de0] = 0x200000d0
        0x00002d84:    2501        .%      MOVS     r5,#1
        0x00002d86:    73a5        .s      STRB     r5,[r4,#0xe]
        0x00002d88:    4816        .H      LDR      r0,[pc,#88] ; [0x2de4] = 0x20000006
        0x00002d8a:    8800        ..      LDRH     r0,[r0,#0]
        0x00002d8c:    f7fdfbca    ....    BL       __aeabi_ui2d ; 0x524
        0x00002d90:    2200        ."      MOVS     r2,#0
        0x00002d92:    4b15        .K      LDR      r3,[pc,#84] ; [0x2de8] = 0x40b77000
        0x00002d94:    f7fdfb24    ..$.    BL       __aeabi_ddiv ; 0x3e0
        0x00002d98:    2200        ."      MOVS     r2,#0
        0x00002d9a:    4b14        .K      LDR      r3,[pc,#80] ; [0x2dec] = 0x40dfffc0
        0x00002d9c:    f7fdfab8    ....    BL       __aeabi_dmul ; 0x310
        0x00002da0:    f7fdfbce    ....    BL       __aeabi_d2iz ; 0x540
        0x00002da4:    8020         .      STRH     r0,[r4,#0]
        0x00002da6:    7be0        .{      LDRB     r0,[r4,#0xf]
        0x00002da8:    2100        .!      MOVS     r1,#0
        0x00002daa:    2801        .(      CMP      r0,#1
        0x00002dac:    d005        ..      BEQ      0x2dba ; SpeedMode_Control + 58
        0x00002dae:    8261        a.      STRH     r1,[r4,#0x12]
        0x00002db0:    7c20         |      LDRB     r0,[r4,#0x10]
        0x00002db2:    2801        .(      CMP      r0,#1
        0x00002db4:    d00c        ..      BEQ      0x2dd0 ; SpeedMode_Control + 80
        0x00002db6:    82a1        ..      STRH     r1,[r4,#0x14]
        0x00002db8:    bd70        p.      POP      {r4-r6,pc}
        0x00002dba:    8a60        `.      LDRH     r0,[r4,#0x12]
        0x00002dbc:    22ff        ."      MOVS     r2,#0xff
        0x00002dbe:    32f5        .2      ADDS     r2,r2,#0xf5
        0x00002dc0:    4290        .B      CMP      r0,r2
        0x00002dc2:    d202        ..      BCS      0x2dca ; SpeedMode_Control + 74
        0x00002dc4:    1c40        @.      ADDS     r0,r0,#1
        0x00002dc6:    8260        `.      STRH     r0,[r4,#0x12]
        0x00002dc8:    e7f2        ..      B        0x2db0 ; SpeedMode_Control + 48
        0x00002dca:    73a1        .s      STRB     r1,[r4,#0xe]
        0x00002dcc:    8261        a.      STRH     r1,[r4,#0x12]
        0x00002dce:    e7ef        ..      B        0x2db0 ; SpeedMode_Control + 48
        0x00002dd0:    8aa0        ..      LDRH     r0,[r4,#0x14]
        0x00002dd2:    2864        d(      CMP      r0,#0x64
        0x00002dd4:    d202        ..      BCS      0x2ddc ; SpeedMode_Control + 92
        0x00002dd6:    1c40        @.      ADDS     r0,r0,#1
        0x00002dd8:    82a0        ..      STRH     r0,[r4,#0x14]
        0x00002dda:    bd70        p.      POP      {r4-r6,pc}
        0x00002ddc:    73a5        .s      STRB     r5,[r4,#0xe]
        0x00002dde:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x00002de0:    200000d0    ...     DCD    536871120
        0x00002de4:    20000006    ...     DCD    536870918
        0x00002de8:    40b77000    .p.@    DCD    1085763584
        0x00002dec:    40dfffc0    ...@    DCD    1088421824
    $t
    i.Speed_response
    Speed_response
        0x00002df0:    b5f8        ..      PUSH     {r3-r7,lr}
        0x00002df2:    4821        !H      LDR      r0,[pc,#132] ; [0x2e78] = 0x20000010
        0x00002df4:    7800        .x      LDRB     r0,[r0,#0]
        0x00002df6:    2807        .(      CMP      r0,#7
        0x00002df8:    d001        ..      BEQ      0x2dfe ; Speed_response + 14
        0x00002dfa:    2808        .(      CMP      r0,#8
        0x00002dfc:    d120         .      BNE      0x2e40 ; Speed_response + 80
        0x00002dfe:    4c1f        .L      LDR      r4,[pc,#124] ; [0x2e7c] = 0x20000064
        0x00002e00:    4e1f        .N      LDR      r6,[pc,#124] ; [0x2e80] = 0x2000032c
        0x00002e02:    8821        !.      LDRH     r1,[r4,#0]
        0x00002e04:    4d1f        .M      LDR      r5,[pc,#124] ; [0x2e84] = 0x200000d0
        0x00002e06:    4820         H      LDR      r0,[pc,#128] ; [0x2e88] = 0x200000a4
        0x00002e08:    2900        .)      CMP      r1,#0
        0x00002e0a:    d01a        ..      BEQ      0x2e42 ; Speed_response + 82
        0x00002e0c:    2901        .)      CMP      r1,#1
        0x00002e0e:    d117        ..      BNE      0x2e40 ; Speed_response + 80
        0x00002e10:    88c1        ..      LDRH     r1,[r0,#6]
        0x00002e12:    1c49        I.      ADDS     r1,r1,#1
        0x00002e14:    b289        ..      UXTH     r1,r1
        0x00002e16:    80c1        ..      STRH     r1,[r0,#6]
        0x00002e18:    290a        .)      CMP      r1,#0xa
        0x00002e1a:    d911        ..      BLS      0x2e40 ; Speed_response + 80
        0x00002e1c:    2700        .'      MOVS     r7,#0
        0x00002e1e:    80c7        ..      STRH     r7,[r0,#6]
        0x00002e20:    302c        ,0      ADDS     r0,r0,#0x2c
        0x00002e22:    f000fe7d    ..}.    BL       mc_ramp ; 0x3b20
        0x00002e26:    7ba8        .{      LDRB     r0,[r5,#0xe]
        0x00002e28:    2800        .(      CMP      r0,#0
        0x00002e2a:    d022        ".      BEQ      0x2e72 ; Speed_response + 130
        0x00002e2c:    88a8        ..      LDRH     r0,[r5,#4]
        0x00002e2e:    89a1        ..      LDRH     r1,[r4,#0xc]
        0x00002e30:    1a40        @.      SUBS     r0,r0,r1
        0x00002e32:    b200        ..      SXTH     r0,r0
        0x00002e34:    4631        1F      MOV      r1,r6
        0x00002e36:    f000fc91    ....    BL       mc_ControllerPI ; 0x375c
        0x00002e3a:    4814        .H      LDR      r0,[pc,#80] ; [0x2e8c] = 0x2000023a
        0x00002e3c:    8af1        ..      LDRH     r1,[r6,#0x16]
        0x00002e3e:    8341        A.      STRH     r1,[r0,#0x1a]
        0x00002e40:    bdf8        ..      POP      {r3-r7,pc}
        0x00002e42:    210c        .!      MOVS     r1,#0xc
        0x00002e44:    5e61        a^      LDRSH    r1,[r4,r1]
        0x00002e46:    4a12        .J      LDR      r2,[pc,#72] ; [0x2e90] = 0x333
        0x00002e48:    4291        .B      CMP      r1,r2
        0x00002e4a:    ddf9        ..      BLE      0x2e40 ; Speed_response + 80
        0x00002e4c:    2201        ."      MOVS     r2,#1
        0x00002e4e:    8022        ".      STRH     r2,[r4,#0]
        0x00002e50:    4b11        .K      LDR      r3,[pc,#68] ; [0x2e98] = 0x20000304
        0x00002e52:    4a10        .J      LDR      r2,[pc,#64] ; [0x2e94] = 0xfff
        0x00002e54:    611a        .a      STR      r2,[r3,#0x10]
        0x00002e56:    24ff        .$      MOVS     r4,#0xff
        0x00002e58:    3448        H4      ADDS     r4,r4,#0x48
        0x00002e5a:    615c        \a      STR      r4,[r3,#0x14]
        0x00002e5c:    4b0f        .K      LDR      r3,[pc,#60] ; [0x2e9c] = 0x200002dc
        0x00002e5e:    611a        .a      STR      r2,[r3,#0x10]
        0x00002e60:    615c        \a      STR      r4,[r3,#0x14]
        0x00002e62:    80a9        ..      STRH     r1,[r5,#4]
        0x00002e64:    490e        .I      LDR      r1,[pc,#56] ; [0x2ea0] = 0x888
        0x00002e66:    82f1        ..      STRH     r1,[r6,#0x16]
        0x00002e68:    4a08        .J      LDR      r2,[pc,#32] ; [0x2e8c] = 0x2000023a
        0x00002e6a:    8351        Q.      STRH     r1,[r2,#0x1a]
        0x00002e6c:    210a        .!      MOVS     r1,#0xa
        0x00002e6e:    80c1        ..      STRH     r1,[r0,#6]
        0x00002e70:    bdf8        ..      POP      {r3-r7,pc}
        0x00002e72:    802f        /.      STRH     r7,[r5,#0]
        0x00002e74:    bdf8        ..      POP      {r3-r7,pc}
    $d
        0x00002e76:    0000        ..      DCW    0
        0x00002e78:    20000010    ...     DCD    536870928
        0x00002e7c:    20000064    d..     DCD    536871012
        0x00002e80:    2000032c    ,..     DCD    536871724
        0x00002e84:    200000d0    ...     DCD    536871120
        0x00002e88:    200000a4    ...     DCD    536871076
        0x00002e8c:    2000023a    :..     DCD    536871482
        0x00002e90:    00000333    3...    DCD    819
        0x00002e94:    00000fff    ....    DCD    4095
        0x00002e98:    20000304    ...     DCD    536871684
        0x00002e9c:    200002dc    ...     DCD    536871644
        0x00002ea0:    00000888    ....    DCD    2184
    $t
    i.SysTick_Handler
    SysTick_Handler
        0x00002ea4:    b510        ..      PUSH     {r4,lr}
        0x00002ea6:    f7fff879    ..y.    BL       LPF_Func ; 0x1f9c
        0x00002eaa:    f7fef9bf    ....    BL       Fault_Detection ; 0x122c
        0x00002eae:    f7fef8af    ....    BL       Base_1ms_TIM ; 0x1010
