747lulu747/SAOZHAN_BRUASH/src/SDK-LIB/华芯第一版本硬件-非FPC/ROMAN-21DD - SDK - V0.1/out/SWM211.asm
        0x00002eb2:    f7ffff9d    ....    BL       Speed_response ; 0x2df0
        0x00002eb6:    f7ffff63    ..c.    BL       SpeedMode_Control ; 0x2d80
        0x00002eba:    bd10        ..      POP      {r4,pc}
    i.SystemCoreClockUpdate
    SystemCoreClockUpdate
        0x00002ebc:    b570        p.      PUSH     {r4-r6,lr}
        0x00002ebe:    2501        .%      MOVS     r5,#1
        0x00002ec0:    07ad        ..      LSLS     r5,r5,#30
        0x00002ec2:    6828        (h      LDR      r0,[r5,#0]
        0x00002ec4:    491a        .I      LDR      r1,[pc,#104] ; [0x2f30] = 0xb71b00
        0x00002ec6:    4c1b        .L      LDR      r4,[pc,#108] ; [0x2f34] = 0x2000005c
        0x00002ec8:    07c0        ..      LSLS     r0,r0,#31
        0x00002eca:    d001        ..      BEQ      0x2ed0 ; SystemCoreClockUpdate + 20
        0x00002ecc:    6021        !`      STR      r1,[r4,#0]
        0x00002ece:    e028        (.      B        0x2f22 ; SystemCoreClockUpdate + 102
        0x00002ed0:    6828        (h      LDR      r0,[r5,#0]
        0x00002ed2:    06c0        ..      LSLS     r0,r0,#27
        0x00002ed4:    0f40        @.      LSRS     r0,r0,#29
        0x00002ed6:    d007        ..      BEQ      0x2ee8 ; SystemCoreClockUpdate + 44
        0x00002ed8:    4a17        .J      LDR      r2,[pc,#92] ; [0x2f38] = 0xf42400
        0x00002eda:    2801        .(      CMP      r0,#1
        0x00002edc:    d008        ..      BEQ      0x2ef0 ; SystemCoreClockUpdate + 52
        0x00002ede:    2803        .(      CMP      r0,#3
        0x00002ee0:    d016        ..      BEQ      0x2f10 ; SystemCoreClockUpdate + 84
        0x00002ee2:    2804        .(      CMP      r0,#4
        0x00002ee4:    d117        ..      BNE      0x2f16 ; SystemCoreClockUpdate + 90
        0x00002ee6:    e015        ..      B        0x2f14 ; SystemCoreClockUpdate + 88
        0x00002ee8:    207d        }       MOVS     r0,#0x7d
        0x00002eea:    0200        ..      LSLS     r0,r0,#8
        0x00002eec:    6020         `      STR      r0,[r4,#0]
        0x00002eee:    e012        ..      B        0x2f16 ; SystemCoreClockUpdate + 90
        0x00002ef0:    4812        .H      LDR      r0,[pc,#72] ; [0x2f3c] = 0x400aa040
        0x00002ef2:    6800        .h      LDR      r0,[r0,#0]
        0x00002ef4:    0780        ..      LSLS     r0,r0,#30
        0x00002ef6:    d501        ..      BPL      0x2efc ; SystemCoreClockUpdate + 64
        0x00002ef8:    6021        !`      STR      r1,[r4,#0]
        0x00002efa:    e000        ..      B        0x2efe ; SystemCoreClockUpdate + 66
        0x00002efc:    6022        "`      STR      r2,[r4,#0]
        0x00002efe:    2103        .!      MOVS     r1,#3
        0x00002f00:    6820         h      LDR      r0,[r4,#0]
        0x00002f02:    f7fdf917    ....    BL       __aeabi_uidiv ; 0x134
        0x00002f06:    21b4        .!      MOVS     r1,#0xb4
        0x00002f08:    4348        HC      MULS     r0,r1,r0
        0x00002f0a:    08c0        ..      LSRS     r0,r0,#3
        0x00002f0c:    6020         `      STR      r0,[r4,#0]
        0x00002f0e:    e002        ..      B        0x2f16 ; SystemCoreClockUpdate + 90
        0x00002f10:    6022        "`      STR      r2,[r4,#0]
        0x00002f12:    e000        ..      B        0x2f16 ; SystemCoreClockUpdate + 90
        0x00002f14:    6021        !`      STR      r1,[r4,#0]
        0x00002f16:    6828        (h      LDR      r0,[r5,#0]
        0x00002f18:    0780        ..      LSLS     r0,r0,#30
        0x00002f1a:    d502        ..      BPL      0x2f22 ; SystemCoreClockUpdate + 102
        0x00002f1c:    6820         h      LDR      r0,[r4,#0]
        0x00002f1e:    08c0        ..      LSRS     r0,r0,#3
        0x00002f20:    6020         `      STR      r0,[r4,#0]
        0x00002f22:    4907        .I      LDR      r1,[pc,#28] ; [0x2f40] = 0xf4240
        0x00002f24:    6820         h      LDR      r0,[r4,#0]
        0x00002f26:    f7fdf905    ....    BL       __aeabi_uidiv ; 0x134
        0x00002f2a:    6060        ``      STR      r0,[r4,#4]
        0x00002f2c:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x00002f2e:    0000        ..      DCW    0
        0x00002f30:    00b71b00    ....    DCD    12000000
        0x00002f34:    2000005c    \..     DCD    536871004
        0x00002f38:    00f42400    .$..    DCD    16000000
        0x00002f3c:    400aa040    @..@    DCD    1074438208
        0x00002f40:    000f4240    @B..    DCD    1000000
    $t
    i.SystemInit
    SystemInit
        0x00002f44:    b510        ..      PUSH     {r4,lr}
        0x00002f46:    2001        .       MOVS     r0,#1
        0x00002f48:    0780        ..      LSLS     r0,r0,#30
        0x00002f4a:    6881        .h      LDR      r1,[r0,#8]
        0x00002f4c:    1142        B.      ASRS     r2,r0,#5
        0x00002f4e:    4311        .C      ORRS     r1,r1,r2
        0x00002f50:    6081        .`      STR      r1,[r0,#8]
        0x00002f52:    4c22        "L      LDR      r4,[pc,#136] ; [0x2fdc] = 0x40000080
        0x00002f54:    69e0        .i      LDR      r0,[r4,#0x1c]
        0x00002f56:    0f40        @.      LSRS     r0,r0,#29
        0x00002f58:    2805        .(      CMP      r0,#5
        0x00002f5a:    d104        ..      BNE      0x2f66 ; SystemInit + 34
        0x00002f5c:    69e0        .i      LDR      r0,[r4,#0x1c]
        0x00002f5e:    4920         I      LDR      r1,[pc,#128] ; [0x2fe0] = 0x400aa000
        0x00002f60:    00c0        ..      LSLS     r0,r0,#3
        0x00002f62:    08c0        ..      LSRS     r0,r0,#3
        0x00002f64:    6088        .`      STR      r0,[r1,#8]
        0x00002f66:    205a        Z       MOVS     r0,#0x5a
        0x00002f68:    f7fefba0    ....    BL       Flash_Param_at_xMHz ; 0x16ac
        0x00002f6c:    2000        .       MOVS     r0,#0
        0x00002f6e:    f000fe0f    ....    BL       switchToPLL ; 0x3b90
        0x00002f72:    f7ffffa3    ....    BL       SystemCoreClockUpdate ; 0x2ebc
        0x00002f76:    481c        .H      LDR      r0,[pc,#112] ; [0x2fe8] = 0x2000005c
        0x00002f78:    491a        .I      LDR      r1,[pc,#104] ; [0x2fe4] = 0xf4240
        0x00002f7a:    6800        .h      LDR      r0,[r0,#0]
        0x00002f7c:    f7fdf8da    ....    BL       __aeabi_uidiv ; 0x134
        0x00002f80:    f7fefb94    ....    BL       Flash_Param_at_xMHz ; 0x16ac
        0x00002f84:    2105        .!      MOVS     r1,#5
        0x00002f86:    4819        .H      LDR      r0,[pc,#100] ; [0x2fec] = 0x4004a000
        0x00002f88:    0409        ..      LSLS     r1,r1,#16
        0x00002f8a:    60c1        .`      STR      r1,[r0,#0xc]
        0x00002f8c:    bf00        ..      NOP      
        0x00002f8e:    bf00        ..      NOP      
        0x00002f90:    bf00        ..      NOP      
        0x00002f92:    bf00        ..      NOP      
        0x00002f94:    bf00        ..      NOP      
        0x00002f96:    bf00        ..      NOP      
        0x00002f98:    bf00        ..      NOP      
        0x00002f9a:    2103        .!      MOVS     r1,#3
        0x00002f9c:    0409        ..      LSLS     r1,r1,#16
        0x00002f9e:    60c1        .`      STR      r1,[r0,#0xc]
        0x00002fa0:    4813        .H      LDR      r0,[pc,#76] ; [0x2ff0] = 0x400a0100
        0x00002fa2:    6901        .i      LDR      r1,[r0,#0x10]
        0x00002fa4:    2205        ."      MOVS     r2,#5
        0x00002fa6:    0312        ..      LSLS     r2,r2,#12
        0x00002fa8:    4391        .C      BICS     r1,r1,r2
        0x00002faa:    6101        .a      STR      r1,[r0,#0x10]
        0x00002fac:    4811        .H      LDR      r0,[pc,#68] ; [0x2ff4] = 0x400aa040
        0x00002fae:    6b41        Ak      LDR      r1,[r0,#0x34]
        0x00002fb0:    0909        ..      LSRS     r1,r1,#4
        0x00002fb2:    0109        ..      LSLS     r1,r1,#4
        0x00002fb4:    6341        Ac      STR      r1,[r0,#0x34]
        0x00002fb6:    6b41        Ak      LDR      r1,[r0,#0x34]
        0x00002fb8:    68e2        .h      LDR      r2,[r4,#0xc]
        0x00002fba:    0712        ..      LSLS     r2,r2,#28
        0x00002fbc:    0f12        ..      LSRS     r2,r2,#28
        0x00002fbe:    4311        .C      ORRS     r1,r1,r2
        0x00002fc0:    6341        Ac      STR      r1,[r0,#0x34]
        0x00002fc2:    6b41        Ak      LDR      r1,[r0,#0x34]
        0x00002fc4:    220f        ."      MOVS     r2,#0xf
        0x00002fc6:    0512        ..      LSLS     r2,r2,#20
        0x00002fc8:    4391        .C      BICS     r1,r1,r2
        0x00002fca:    6341        Ac      STR      r1,[r0,#0x34]
        0x00002fcc:    6b41        Ak      LDR      r1,[r0,#0x34]
        0x00002fce:    68e2        .h      LDR      r2,[r4,#0xc]
        0x00002fd0:    0312        ..      LSLS     r2,r2,#12
        0x00002fd2:    0f12        ..      LSRS     r2,r2,#28
        0x00002fd4:    0512        ..      LSLS     r2,r2,#20
        0x00002fd6:    4311        .C      ORRS     r1,r1,r2
        0x00002fd8:    6341        Ac      STR      r1,[r0,#0x34]
        0x00002fda:    bd10        ..      POP      {r4,pc}
    $d
        0x00002fdc:    40000080    ...@    DCD    1073741952
        0x00002fe0:    400aa000    ...@    DCD    1074438144
        0x00002fe4:    000f4240    @B..    DCD    1000000
        0x00002fe8:    2000005c    \..     DCD    536871004
        0x00002fec:    4004a000    ...@    DCD    1074044928
        0x00002ff0:    400a0100    ...@    DCD    1074397440
        0x00002ff4:    400aa040    @..@    DCD    1074438208
    $t
    i.TIMR0_Handler
    TIMR0_Handler
        0x00002ff8:    b570        p.      PUSH     {r4-r6,lr}
        0x00002ffa:    4814        .H      LDR      r0,[pc,#80] ; [0x304c] = 0x20000128
        0x00002ffc:    4d14        .M      LDR      r5,[pc,#80] ; [0x3050] = 0x40046800
        0x00002ffe:    7f00        ..      LDRB     r0,[r0,#0x1c]
        0x00003000:    2601        .&      MOVS     r6,#1
        0x00003002:    2801        .(      CMP      r0,#1
        0x00003004:    d01f        ..      BEQ      0x3046 ; TIMR0_Handler + 78
        0x00003006:    4628        (F      MOV      r0,r5
        0x00003008:    f000f865    ..e.    BL       TIMR_IC_CaptureH_INTStat ; 0x30d6
        0x0000300c:    4c11        .L      LDR      r4,[pc,#68] ; [0x3054] = 0x20000108
        0x0000300e:    2800        .(      CMP      r0,#0
        0x00003010:    d007        ..      BEQ      0x3022 ; TIMR0_Handler + 42
        0x00003012:    4628        (F      MOV      r0,r5
        0x00003014:    f000f86a    ..j.    BL       TIMR_IC_GetCaptureH ; 0x30ec
        0x00003018:    6020         `      STR      r0,[r4,#0]
        0x0000301a:    4628        (F      MOV      r0,r5
        0x0000301c:    f000f858    ..X.    BL       TIMR_IC_CaptureH_INTClr ; 0x30d0
        0x00003020:    e00b        ..      B        0x303a ; TIMR0_Handler + 66
        0x00003022:    4628        (F      MOV      r0,r5
        0x00003024:    f000f85e    ..^.    BL       TIMR_IC_CaptureL_INTStat ; 0x30e4
        0x00003028:    2800        .(      CMP      r0,#0
        0x0000302a:    d006        ..      BEQ      0x303a ; TIMR0_Handler + 66
        0x0000302c:    4628        (F      MOV      r0,r5
        0x0000302e:    f000f85f    .._.    BL       TIMR_IC_GetCaptureL ; 0x30f0
        0x00003032:    6060        ``      STR      r0,[r4,#4]
        0x00003034:    4628        (F      MOV      r0,r5
        0x00003036:    f000f852    ..R.    BL       TIMR_IC_CaptureL_INTClr ; 0x30de
        0x0000303a:    6861        ah      LDR      r1,[r4,#4]
        0x0000303c:    6820         h      LDR      r0,[r4,#0]
        0x0000303e:    1840        @.      ADDS     r0,r0,r1
        0x00003040:    6320         c      STR      r0,[r4,#0x30]
        0x00003042:    4805        .H      LDR      r0,[pc,#20] ; [0x3058] = 0x20000148
        0x00003044:    8106        ..      STRH     r6,[r0,#8]
        0x00003046:    616e        na      STR      r6,[r5,#0x14]
        0x00003048:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x0000304a:    0000        ..      DCW    0
        0x0000304c:    20000128    (..     DCD    536871208
        0x00003050:    40046800    .h.@    DCD    1074030592
        0x00003054:    20000108    ...     DCD    536871176
        0x00003058:    20000148    H..     DCD    536871240
    $t
    i.TIMR1_Handler
    TIMR1_Handler
        0x0000305c:    b570        p.      PUSH     {r4-r6,lr}
        0x0000305e:    4817        .H      LDR      r0,[pc,#92] ; [0x30bc] = 0x20000128
        0x00003060:    4d17        .M      LDR      r5,[pc,#92] ; [0x30c0] = 0x40046840
        0x00003062:    7f00        ..      LDRB     r0,[r0,#0x1c]
        0x00003064:    2801        .(      CMP      r0,#1
        0x00003066:    d024        $.      BEQ      0x30b2 ; TIMR1_Handler + 86
        0x00003068:    4628        (F      MOV      r0,r5
        0x0000306a:    f000f834    ..4.    BL       TIMR_IC_CaptureH_INTStat ; 0x30d6
        0x0000306e:    4c15        .L      LDR      r4,[pc,#84] ; [0x30c4] = 0x20000108
        0x00003070:    2800        .(      CMP      r0,#0
        0x00003072:    d007        ..      BEQ      0x3084 ; TIMR1_Handler + 40
        0x00003074:    4628        (F      MOV      r0,r5
        0x00003076:    f000f839    ..9.    BL       TIMR_IC_GetCaptureH ; 0x30ec
        0x0000307a:    6020         `      STR      r0,[r4,#0]
        0x0000307c:    4628        (F      MOV      r0,r5
        0x0000307e:    f000f827    ..'.    BL       TIMR_IC_CaptureH_INTClr ; 0x30d0
        0x00003082:    e00b        ..      B        0x309c ; TIMR1_Handler + 64
        0x00003084:    4628        (F      MOV      r0,r5
        0x00003086:    f000f82d    ..-.    BL       TIMR_IC_CaptureL_INTStat ; 0x30e4
        0x0000308a:    2800        .(      CMP      r0,#0
        0x0000308c:    d006        ..      BEQ      0x309c ; TIMR1_Handler + 64
        0x0000308e:    4628        (F      MOV      r0,r5
        0x00003090:    f000f82e    ....    BL       TIMR_IC_GetCaptureL ; 0x30f0
        0x00003094:    6060        ``      STR      r0,[r4,#4]
        0x00003096:    4628        (F      MOV      r0,r5
        0x00003098:    f000f821    ..!.    BL       TIMR_IC_CaptureL_INTClr ; 0x30de
        0x0000309c:    6861        ah      LDR      r1,[r4,#4]
        0x0000309e:    6820         h      LDR      r0,[r4,#0]
        0x000030a0:    1840        @.      ADDS     r0,r0,r1
        0x000030a2:    6320         c      STR      r0,[r4,#0x30]
        0x000030a4:    4628        (F      MOV      r0,r5
        0x000030a6:    f000f811    ....    BL       TIMR_GetCurValue ; 0x30cc
        0x000030aa:    6120         a      STR      r0,[r4,#0x10]
        0x000030ac:    4806        .H      LDR      r0,[pc,#24] ; [0x30c8] = 0x20000148
        0x000030ae:    2101        .!      MOVS     r1,#1
        0x000030b0:    8101        ..      STRH     r1,[r0,#8]
        0x000030b2:    4628        (F      MOV      r0,r5
        0x000030b4:    f000f81e    ....    BL       TIMR_INTClr ; 0x30f4
        0x000030b8:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x000030ba:    0000        ..      DCW    0
        0x000030bc:    20000128    (..     DCD    536871208
        0x000030c0:    40046840    @h.@    DCD    1074030656
        0x000030c4:    20000108    ...     DCD    536871176
        0x000030c8:    20000148    H..     DCD    536871240
    $t
    i.TIMR_GetCurValue
    TIMR_GetCurValue
        0x000030cc:    6840        @h      LDR      r0,[r0,#4]
        0x000030ce:    4770        pG      BX       lr
    i.TIMR_IC_CaptureH_INTClr
    TIMR_IC_CaptureH_INTClr
        0x000030d0:    2110        .!      MOVS     r1,#0x10
        0x000030d2:    6141        Aa      STR      r1,[r0,#0x14]
        0x000030d4:    4770        pG      BX       lr
    i.TIMR_IC_CaptureH_INTStat
    TIMR_IC_CaptureH_INTStat
        0x000030d6:    6940        @i      LDR      r0,[r0,#0x14]
        0x000030d8:    06c0        ..      LSLS     r0,r0,#27
        0x000030da:    0fc0        ..      LSRS     r0,r0,#31
        0x000030dc:    4770        pG      BX       lr
    i.TIMR_IC_CaptureL_INTClr
    TIMR_IC_CaptureL_INTClr
        0x000030de:    2108        .!      MOVS     r1,#8
        0x000030e0:    6141        Aa      STR      r1,[r0,#0x14]
        0x000030e2:    4770        pG      BX       lr
    i.TIMR_IC_CaptureL_INTStat
    TIMR_IC_CaptureL_INTStat
        0x000030e4:    6940        @i      LDR      r0,[r0,#0x14]
        0x000030e6:    0700        ..      LSLS     r0,r0,#28
        0x000030e8:    0fc0        ..      LSRS     r0,r0,#31
        0x000030ea:    4770        pG      BX       lr
    i.TIMR_IC_GetCaptureH
    TIMR_IC_GetCaptureH
        0x000030ec:    6ac0        .j      LDR      r0,[r0,#0x2c]
        0x000030ee:    4770        pG      BX       lr
    i.TIMR_IC_GetCaptureL
    TIMR_IC_GetCaptureL
        0x000030f0:    6a80        .j      LDR      r0,[r0,#0x28]
        0x000030f2:    4770        pG      BX       lr
    i.TIMR_INTClr
    TIMR_INTClr
        0x000030f4:    2101        .!      MOVS     r1,#1
        0x000030f6:    6141        Aa      STR      r1,[r0,#0x14]
        0x000030f8:    4770        pG      BX       lr
        0x000030fa:    0000        ..      MOVS     r0,r0
    i.TIMR_Init
    TIMR_Init
        0x000030fc:    b5ff        ..      PUSH     {r0-r7,lr}
        0x000030fe:    9d09        ..      LDR      r5,[sp,#0x24]
        0x00003100:    4604        .F      MOV      r4,r0
        0x00003102:    460f        .F      MOV      r7,r1
        0x00003104:    4941        AI      LDR      r1,[pc,#260] ; [0x320c] = 0x40046800
        0x00003106:    4e42        BN      LDR      r6,[pc,#264] ; [0x3210] = 0x40048800
        0x00003108:    04c8        ..      LSLS     r0,r1,#19
        0x0000310a:    428c        .B      CMP      r4,r1
        0x0000310c:    d005        ..      BEQ      0x311a ; TIMR_Init + 30
        0x0000310e:    4941        AI      LDR      r1,[pc,#260] ; [0x3214] = 0x40046840
        0x00003110:    428c        .B      CMP      r4,r1
        0x00003112:    d002        ..      BEQ      0x311a ; TIMR_Init + 30
        0x00003114:    4940        @I      LDR      r1,[pc,#256] ; [0x3218] = 0x40046880
        0x00003116:    428c        .B      CMP      r4,r1
        0x00003118:    d10f        ..      BNE      0x313a ; TIMR_Init + 62
        0x0000311a:    6881        .h      LDR      r1,[r0,#8]
        0x0000311c:    2201        ."      MOVS     r2,#1
        0x0000311e:    02d2        ..      LSLS     r2,r2,#11
        0x00003120:    4311        .C      ORRS     r1,r1,r2
        0x00003122:    6081        .`      STR      r1,[r0,#8]
        0x00003124:    4620         F      MOV      r0,r4
        0x00003126:    f000f8f7    ....    BL       TIMR_Stop ; 0x3318
        0x0000312a:    68a0        .h      LDR      r0,[r4,#8]
        0x0000312c:    0900        ..      LSRS     r0,r0,#4
        0x0000312e:    0100        ..      LSLS     r0,r0,#4
        0x00003130:    60a0        .`      STR      r0,[r4,#8]
        0x00003132:    68a0        .h      LDR      r0,[r4,#8]
        0x00003134:    4338        8C      ORRS     r0,r0,r7
        0x00003136:    60a0        .`      STR      r0,[r4,#8]
        0x00003138:    e016        ..      B        0x3168 ; TIMR_Init + 108
        0x0000313a:    42b4        .B      CMP      r4,r6
        0x0000313c:    d008        ..      BEQ      0x3150 ; TIMR_Init + 84
        0x0000313e:    4937        7I      LDR      r1,[pc,#220] ; [0x321c] = 0x40048840
        0x00003140:    428c        .B      CMP      r4,r1
        0x00003142:    d005        ..      BEQ      0x3150 ; TIMR_Init + 84
        0x00003144:    4936        6I      LDR      r1,[pc,#216] ; [0x3220] = 0x40048880
        0x00003146:    428c        .B      CMP      r4,r1
        0x00003148:    d002        ..      BEQ      0x3150 ; TIMR_Init + 84
        0x0000314a:    4936        6I      LDR      r1,[pc,#216] ; [0x3224] = 0x400488c0
        0x0000314c:    428c        .B      CMP      r4,r1
        0x0000314e:    d10b        ..      BNE      0x3168 ; TIMR_Init + 108
        0x00003150:    68c1        .h      LDR      r1,[r0,#0xc]
        0x00003152:    2201        ."      MOVS     r2,#1
        0x00003154:    0592        ..      LSLS     r2,r2,#22
        0x00003156:    4311        .C      ORRS     r1,r1,r2
        0x00003158:    60c1        .`      STR      r1,[r0,#0xc]
        0x0000315a:    4620         F      MOV      r0,r4
        0x0000315c:    f000f8dc    ....    BL       TIMR_Stop ; 0x3318
        0x00003160:    2f08        ./      CMP      r7,#8
        0x00003162:    d101        ..      BNE      0x3168 ; TIMR_Init + 108
        0x00003164:    2008        .       MOVS     r0,#8
        0x00003166:    60a0        .`      STR      r0,[r4,#8]
        0x00003168:    9802        ..      LDR      r0,[sp,#8]
        0x0000316a:    1e40        @.      SUBS     r0,r0,#1
        0x0000316c:    6320         c      STR      r0,[r4,#0x30]
        0x0000316e:    9803        ..      LDR      r0,[sp,#0xc]
        0x00003170:    1e40        @.      SUBS     r0,r0,#1
        0x00003172:    6020         `      STR      r0,[r4,#0]
        0x00003174:    2001        .       MOVS     r0,#1
        0x00003176:    6160        `a      STR      r0,[r4,#0x14]
        0x00003178:    2d00        .-      CMP      r5,#0
        0x0000317a:    d003        ..      BEQ      0x3184 ; TIMR_Init + 136
        0x0000317c:    6921        !i      LDR      r1,[r4,#0x10]
        0x0000317e:    4301        .C      ORRS     r1,r1,r0
        0x00003180:    6121        !a      STR      r1,[r4,#0x10]
        0x00003182:    e003        ..      B        0x318c ; TIMR_Init + 144
        0x00003184:    6920         i      LDR      r0,[r4,#0x10]
        0x00003186:    0840        @.      LSRS     r0,r0,#1
        0x00003188:    0040        @.      LSLS     r0,r0,#1
        0x0000318a:    6120         a      STR      r0,[r4,#0x10]
        0x0000318c:    1ba0        ..      SUBS     r0,r4,r6
        0x0000318e:    4926        &I      LDR      r1,[pc,#152] ; [0x3228] = 0xe000e100
        0x00003190:    42b4        .B      CMP      r4,r6
        0x00003192:    d026        &.      BEQ      0x31e2 ; TIMR_Init + 230
        0x00003194:    dc0c        ..      BGT      0x31b0 ; TIMR_Init + 180
        0x00003196:    4825        %H      LDR      r0,[pc,#148] ; [0x322c] = 0xbffb9800
        0x00003198:    1820         .      ADDS     r0,r4,r0
        0x0000319a:    d016        ..      BEQ      0x31ca ; TIMR_Init + 206
        0x0000319c:    2840        @(      CMP      r0,#0x40
        0x0000319e:    d01a        ..      BEQ      0x31d6 ; TIMR_Init + 218
        0x000031a0:    2880        .(      CMP      r0,#0x80
        0x000031a2:    d103        ..      BNE      0x31ac ; TIMR_Init + 176
        0x000031a4:    2d00        .-      CMP      r5,#0
        0x000031a6:    d001        ..      BEQ      0x31ac ; TIMR_Init + 176
        0x000031a8:    0500        ..      LSLS     r0,r0,#20
        0x000031aa:    6008        .`      STR      r0,[r1,#0]
        0x000031ac:    b004        ..      ADD      sp,sp,#0x10
        0x000031ae:    bdf0        ..      POP      {r4-r7,pc}
        0x000031b0:    2840        @(      CMP      r0,#0x40
        0x000031b2:    d01d        ..      BEQ      0x31f0 ; TIMR_Init + 244
        0x000031b4:    2880        .(      CMP      r0,#0x80
        0x000031b6:    d022        ".      BEQ      0x31fe ; TIMR_Init + 258
        0x000031b8:    28c0        .(      CMP      r0,#0xc0
        0x000031ba:    d1f7        ..      BNE      0x31ac ; TIMR_Init + 176
        0x000031bc:    2d00        .-      CMP      r5,#0
        0x000031be:    d0f5        ..      BEQ      0x31ac ; TIMR_Init + 176
        0x000031c0:    2001        .       MOVS     r0,#1
        0x000031c2:    04c0        ..      LSLS     r0,r0,#19
