747lulu747/SAOZHAN_BRUASH/src/SDK-LIB/华芯第一版本硬件-非FPC/ROMAN-21DD - SDK - V0.1/out/SWM211.asm
        0x000031c4:    6008        .`      STR      r0,[r1,#0]
        0x000031c6:    b004        ..      ADD      sp,sp,#0x10
        0x000031c8:    bdf0        ..      POP      {r4-r7,pc}
        0x000031ca:    2d00        .-      CMP      r5,#0
        0x000031cc:    d0fb        ..      BEQ      0x31c6 ; TIMR_Init + 202
        0x000031ce:    2002        .       MOVS     r0,#2
        0x000031d0:    6008        .`      STR      r0,[r1,#0]
        0x000031d2:    b004        ..      ADD      sp,sp,#0x10
        0x000031d4:    bdf0        ..      POP      {r4-r7,pc}
        0x000031d6:    2d00        .-      CMP      r5,#0
        0x000031d8:    d0fb        ..      BEQ      0x31d2 ; TIMR_Init + 214
        0x000031da:    2020                MOVS     r0,#0x20
        0x000031dc:    6008        .`      STR      r0,[r1,#0]
        0x000031de:    b004        ..      ADD      sp,sp,#0x10
        0x000031e0:    bdf0        ..      POP      {r4-r7,pc}
        0x000031e2:    2d00        .-      CMP      r5,#0
        0x000031e4:    d0fb        ..      BEQ      0x31de ; TIMR_Init + 226
        0x000031e6:    2001        .       MOVS     r0,#1
        0x000031e8:    0400        ..      LSLS     r0,r0,#16
        0x000031ea:    6008        .`      STR      r0,[r1,#0]
        0x000031ec:    b004        ..      ADD      sp,sp,#0x10
        0x000031ee:    bdf0        ..      POP      {r4-r7,pc}
        0x000031f0:    2d00        .-      CMP      r5,#0
        0x000031f2:    d0fb        ..      BEQ      0x31ec ; TIMR_Init + 240
        0x000031f4:    2001        .       MOVS     r0,#1
        0x000031f6:    0440        @.      LSLS     r0,r0,#17
        0x000031f8:    6008        .`      STR      r0,[r1,#0]
        0x000031fa:    b004        ..      ADD      sp,sp,#0x10
        0x000031fc:    bdf0        ..      POP      {r4-r7,pc}
        0x000031fe:    2d00        .-      CMP      r5,#0
        0x00003200:    d0fb        ..      BEQ      0x31fa ; TIMR_Init + 254
        0x00003202:    2001        .       MOVS     r0,#1
        0x00003204:    0480        ..      LSLS     r0,r0,#18
        0x00003206:    6008        .`      STR      r0,[r1,#0]
        0x00003208:    b004        ..      ADD      sp,sp,#0x10
        0x0000320a:    bdf0        ..      POP      {r4-r7,pc}
    $d
        0x0000320c:    40046800    .h.@    DCD    1074030592
        0x00003210:    40048800    ...@    DCD    1074038784
        0x00003214:    40046840    @h.@    DCD    1074030656
        0x00003218:    40046880    .h.@    DCD    1074030720
        0x0000321c:    40048840    @..@    DCD    1074038848
        0x00003220:    40048880    ...@    DCD    1074038912
        0x00003224:    400488c0    ...@    DCD    1074038976
        0x00003228:    e000e100    ....    DCD    3758153984
        0x0000322c:    bffb9800    ....    DCD    3220936704
    $t
    i.TIMR_OC_Init
    TIMR_OC_Init
        0x00003230:    6201        .b      STR      r1,[r0,#0x20]
        0x00003232:    2102        .!      MOVS     r1,#2
        0x00003234:    2b00        .+      CMP      r3,#0
        0x00003236:    d003        ..      BEQ      0x3240 ; TIMR_OC_Init + 16
        0x00003238:    69c3        .i      LDR      r3,[r0,#0x1c]
        0x0000323a:    430b        .C      ORRS     r3,r3,r1
        0x0000323c:    61c3        .a      STR      r3,[r0,#0x1c]
        0x0000323e:    e002        ..      B        0x3246 ; TIMR_OC_Init + 22
        0x00003240:    69c3        .i      LDR      r3,[r0,#0x1c]
        0x00003242:    438b        .C      BICS     r3,r3,r1
        0x00003244:    61c3        .a      STR      r3,[r0,#0x1c]
        0x00003246:    6141        Aa      STR      r1,[r0,#0x14]
        0x00003248:    2a00        .*      CMP      r2,#0
        0x0000324a:    d003        ..      BEQ      0x3254 ; TIMR_OC_Init + 36
        0x0000324c:    6903        .i      LDR      r3,[r0,#0x10]
        0x0000324e:    430b        .C      ORRS     r3,r3,r1
        0x00003250:    6103        .a      STR      r3,[r0,#0x10]
        0x00003252:    e002        ..      B        0x325a ; TIMR_OC_Init + 42
        0x00003254:    6903        .i      LDR      r3,[r0,#0x10]
        0x00003256:    438b        .C      BICS     r3,r3,r1
        0x00003258:    6103        .a      STR      r3,[r0,#0x10]
        0x0000325a:    4b0b        .K      LDR      r3,[pc,#44] ; [0x3288] = 0xbffb9800
        0x0000325c:    18c0        ..      ADDS     r0,r0,r3
        0x0000325e:    4b0b        .K      LDR      r3,[pc,#44] ; [0x328c] = 0xe000e100
        0x00003260:    d008        ..      BEQ      0x3274 ; TIMR_OC_Init + 68
        0x00003262:    2840        @(      CMP      r0,#0x40
        0x00003264:    d00a        ..      BEQ      0x327c ; TIMR_OC_Init + 76
        0x00003266:    2880        .(      CMP      r0,#0x80
        0x00003268:    d103        ..      BNE      0x3272 ; TIMR_OC_Init + 66
        0x0000326a:    2a00        .*      CMP      r2,#0
        0x0000326c:    d001        ..      BEQ      0x3272 ; TIMR_OC_Init + 66
        0x0000326e:    0500        ..      LSLS     r0,r0,#20
        0x00003270:    6018        .`      STR      r0,[r3,#0]
        0x00003272:    4770        pG      BX       lr
        0x00003274:    2a00        .*      CMP      r2,#0
        0x00003276:    d0fc        ..      BEQ      0x3272 ; TIMR_OC_Init + 66
        0x00003278:    6019        .`      STR      r1,[r3,#0]
        0x0000327a:    4770        pG      BX       lr
        0x0000327c:    2a00        .*      CMP      r2,#0
        0x0000327e:    d0fc        ..      BEQ      0x327a ; TIMR_OC_Init + 74
        0x00003280:    2020                MOVS     r0,#0x20
        0x00003282:    6018        .`      STR      r0,[r3,#0]
        0x00003284:    4770        pG      BX       lr
    $d
        0x00003286:    0000        ..      DCW    0
        0x00003288:    bffb9800    ....    DCD    3220936704
        0x0000328c:    e000e100    ....    DCD    3758153984
    $t
    i.TIMR_Start
    TIMR_Start
        0x00003290:    b470        p.      PUSH     {r4-r6}
        0x00003292:    4a1d        .J      LDR      r2,[pc,#116] ; [0x3308] = 0x40048800
        0x00003294:    2401        .$      MOVS     r4,#1
        0x00003296:    1a81        ..      SUBS     r1,r0,r2
        0x00003298:    2502        .%      MOVS     r5,#2
        0x0000329a:    2604        .&      MOVS     r6,#4
        0x0000329c:    4b1b        .K      LDR      r3,[pc,#108] ; [0x330c] = 0x40048c40
        0x0000329e:    4290        .B      CMP      r0,r2
        0x000032a0:    d023        #.      BEQ      0x32ea ; TIMR_Start + 90
        0x000032a2:    dc0c        ..      BGT      0x32be ; TIMR_Start + 46
        0x000032a4:    491a        .I      LDR      r1,[pc,#104] ; [0x3310] = 0xbffb9800
        0x000032a6:    1840        @.      ADDS     r0,r0,r1
        0x000032a8:    491a        .I      LDR      r1,[pc,#104] ; [0x3314] = 0x40046c40
        0x000032aa:    d014        ..      BEQ      0x32d6 ; TIMR_Start + 70
        0x000032ac:    2840        @(      CMP      r0,#0x40
        0x000032ae:    d017        ..      BEQ      0x32e0 ; TIMR_Start + 80
        0x000032b0:    2880        .(      CMP      r0,#0x80
        0x000032b2:    d102        ..      BNE      0x32ba ; TIMR_Start + 42
        0x000032b4:    6808        .h      LDR      r0,[r1,#0]
        0x000032b6:    4330        0C      ORRS     r0,r0,r6
        0x000032b8:    6008        .`      STR      r0,[r1,#0]
        0x000032ba:    bc70        p.      POP      {r4-r6}
        0x000032bc:    4770        pG      BX       lr
        0x000032be:    2940        @)      CMP      r1,#0x40
        0x000032c0:    d018        ..      BEQ      0x32f4 ; TIMR_Start + 100
        0x000032c2:    2980        .)      CMP      r1,#0x80
        0x000032c4:    d01b        ..      BEQ      0x32fe ; TIMR_Start + 110
        0x000032c6:    29c0        .)      CMP      r1,#0xc0
        0x000032c8:    d1f7        ..      BNE      0x32ba ; TIMR_Start + 42
        0x000032ca:    6818        .h      LDR      r0,[r3,#0]
        0x000032cc:    2108        .!      MOVS     r1,#8
        0x000032ce:    4308        .C      ORRS     r0,r0,r1
        0x000032d0:    6018        .`      STR      r0,[r3,#0]
        0x000032d2:    bc70        p.      POP      {r4-r6}
        0x000032d4:    4770        pG      BX       lr
        0x000032d6:    6808        .h      LDR      r0,[r1,#0]
        0x000032d8:    4320         C      ORRS     r0,r0,r4
        0x000032da:    6008        .`      STR      r0,[r1,#0]
        0x000032dc:    bc70        p.      POP      {r4-r6}
        0x000032de:    4770        pG      BX       lr
        0x000032e0:    6808        .h      LDR      r0,[r1,#0]
        0x000032e2:    4328        (C      ORRS     r0,r0,r5
        0x000032e4:    6008        .`      STR      r0,[r1,#0]
        0x000032e6:    bc70        p.      POP      {r4-r6}
        0x000032e8:    4770        pG      BX       lr
        0x000032ea:    6818        .h      LDR      r0,[r3,#0]
        0x000032ec:    4320         C      ORRS     r0,r0,r4
        0x000032ee:    6018        .`      STR      r0,[r3,#0]
        0x000032f0:    bc70        p.      POP      {r4-r6}
        0x000032f2:    4770        pG      BX       lr
        0x000032f4:    6818        .h      LDR      r0,[r3,#0]
        0x000032f6:    4328        (C      ORRS     r0,r0,r5
        0x000032f8:    6018        .`      STR      r0,[r3,#0]
        0x000032fa:    bc70        p.      POP      {r4-r6}
        0x000032fc:    4770        pG      BX       lr
        0x000032fe:    6818        .h      LDR      r0,[r3,#0]
        0x00003300:    4330        0C      ORRS     r0,r0,r6
        0x00003302:    6018        .`      STR      r0,[r3,#0]
        0x00003304:    bc70        p.      POP      {r4-r6}
        0x00003306:    4770        pG      BX       lr
    $d
        0x00003308:    40048800    ...@    DCD    1074038784
        0x0000330c:    40048c40    @..@    DCD    1074039872
        0x00003310:    bffb9800    ....    DCD    3220936704
        0x00003314:    40046c40    @l.@    DCD    1074031680
    $t
    i.TIMR_Stop
    TIMR_Stop
        0x00003318:    b430        0.      PUSH     {r4,r5}
        0x0000331a:    4a1e        .J      LDR      r2,[pc,#120] ; [0x3394] = 0x40048800
        0x0000331c:    2402        .$      MOVS     r4,#2
        0x0000331e:    1a81        ..      SUBS     r1,r0,r2
        0x00003320:    2504        .%      MOVS     r5,#4
        0x00003322:    4b1d        .K      LDR      r3,[pc,#116] ; [0x3398] = 0x40048c40
        0x00003324:    4290        .B      CMP      r0,r2
        0x00003326:    d024        $.      BEQ      0x3372 ; TIMR_Stop + 90
        0x00003328:    dc0c        ..      BGT      0x3344 ; TIMR_Stop + 44
        0x0000332a:    491c        .I      LDR      r1,[pc,#112] ; [0x339c] = 0xbffb9800
        0x0000332c:    1840        @.      ADDS     r0,r0,r1
        0x0000332e:    491c        .I      LDR      r1,[pc,#112] ; [0x33a0] = 0x40046c40
        0x00003330:    d014        ..      BEQ      0x335c ; TIMR_Stop + 68
        0x00003332:    2840        @(      CMP      r0,#0x40
        0x00003334:    d018        ..      BEQ      0x3368 ; TIMR_Stop + 80
        0x00003336:    2880        .(      CMP      r0,#0x80
        0x00003338:    d102        ..      BNE      0x3340 ; TIMR_Stop + 40
        0x0000333a:    6808        .h      LDR      r0,[r1,#0]
        0x0000333c:    43a8        .C      BICS     r0,r0,r5
        0x0000333e:    6008        .`      STR      r0,[r1,#0]
        0x00003340:    bc30        0.      POP      {r4,r5}
        0x00003342:    4770        pG      BX       lr
        0x00003344:    2940        @)      CMP      r1,#0x40
        0x00003346:    d01a        ..      BEQ      0x337e ; TIMR_Stop + 102
        0x00003348:    2980        .)      CMP      r1,#0x80
        0x0000334a:    d01d        ..      BEQ      0x3388 ; TIMR_Stop + 112
        0x0000334c:    29c0        .)      CMP      r1,#0xc0
        0x0000334e:    d1f7        ..      BNE      0x3340 ; TIMR_Stop + 40
        0x00003350:    6818        .h      LDR      r0,[r3,#0]
        0x00003352:    2108        .!      MOVS     r1,#8
        0x00003354:    4388        .C      BICS     r0,r0,r1
        0x00003356:    6018        .`      STR      r0,[r3,#0]
        0x00003358:    bc30        0.      POP      {r4,r5}
        0x0000335a:    4770        pG      BX       lr
        0x0000335c:    6808        .h      LDR      r0,[r1,#0]
        0x0000335e:    0840        @.      LSRS     r0,r0,#1
        0x00003360:    0040        @.      LSLS     r0,r0,#1
        0x00003362:    6008        .`      STR      r0,[r1,#0]
        0x00003364:    bc30        0.      POP      {r4,r5}
        0x00003366:    4770        pG      BX       lr
        0x00003368:    6808        .h      LDR      r0,[r1,#0]
        0x0000336a:    43a0        .C      BICS     r0,r0,r4
        0x0000336c:    6008        .`      STR      r0,[r1,#0]
        0x0000336e:    bc30        0.      POP      {r4,r5}
        0x00003370:    4770        pG      BX       lr
        0x00003372:    6818        .h      LDR      r0,[r3,#0]
        0x00003374:    0840        @.      LSRS     r0,r0,#1
        0x00003376:    0040        @.      LSLS     r0,r0,#1
        0x00003378:    6018        .`      STR      r0,[r3,#0]
        0x0000337a:    bc30        0.      POP      {r4,r5}
        0x0000337c:    4770        pG      BX       lr
        0x0000337e:    6818        .h      LDR      r0,[r3,#0]
        0x00003380:    43a0        .C      BICS     r0,r0,r4
        0x00003382:    6018        .`      STR      r0,[r3,#0]
        0x00003384:    bc30        0.      POP      {r4,r5}
        0x00003386:    4770        pG      BX       lr
        0x00003388:    6818        .h      LDR      r0,[r3,#0]
        0x0000338a:    43a8        .C      BICS     r0,r0,r5
        0x0000338c:    6018        .`      STR      r0,[r3,#0]
        0x0000338e:    bc30        0.      POP      {r4,r5}
        0x00003390:    4770        pG      BX       lr
    $d
        0x00003392:    0000        ..      DCW    0
        0x00003394:    40048800    ...@    DCD    1074038784
        0x00003398:    40048c40    @..@    DCD    1074039872
        0x0000339c:    bffb9800    ....    DCD    3220936704
        0x000033a0:    40046c40    @l.@    DCD    1074031680
    $t
    i.TailWindDetectInit
    TailWindDetectInit
        0x000033a4:    b510        ..      PUSH     {r4,lr}
        0x000033a6:    4814        .H      LDR      r0,[pc,#80] ; [0x33f8] = 0x200001e4
        0x000033a8:    2400        .$      MOVS     r4,#0
        0x000033aa:    6004        .`      STR      r4,[r0,#0]
        0x000033ac:    6044        D`      STR      r4,[r0,#4]
        0x000033ae:    6084        .`      STR      r4,[r0,#8]
        0x000033b0:    6104        .a      STR      r4,[r0,#0x10]
        0x000033b2:    6144        Da      STR      r4,[r0,#0x14]
        0x000033b4:    6184        .a      STR      r4,[r0,#0x18]
        0x000033b6:    61c4        .a      STR      r4,[r0,#0x1c]
        0x000033b8:    7184        .q      STRB     r4,[r0,#6]
        0x000033ba:    4910        .I      LDR      r1,[pc,#64] ; [0x33fc] = 0x17700
        0x000033bc:    60c1        .`      STR      r1,[r0,#0xc]
        0x000033be:    210f        .!      MOVS     r1,#0xf
        0x000033c0:    480f        .H      LDR      r0,[pc,#60] ; [0x3400] = 0x200000a4
        0x000033c2:    0209        ..      LSLS     r1,r1,#8
        0x000033c4:    8381        ..      STRH     r1,[r0,#0x1c]
        0x000033c6:    f7fdfefb    ....    BL       FOC_Init ; 0x11c0
        0x000033ca:    480f        .H      LDR      r0,[pc,#60] ; [0x3408] = 0x20000304
        0x000033cc:    490d        .I      LDR      r1,[pc,#52] ; [0x3404] = 0x27fd
        0x000033ce:    6101        .a      STR      r1,[r0,#0x10]
        0x000033d0:    4a0e        .J      LDR      r2,[pc,#56] ; [0x340c] = 0x1fff
        0x000033d2:    6142        Ba      STR      r2,[r0,#0x14]
        0x000033d4:    4b0e        .K      LDR      r3,[pc,#56] ; [0x3410] = 0x7332
        0x000033d6:    6183        .a      STR      r3,[r0,#0x18]
        0x000033d8:    425b        [B      RSBS     r3,r3,#0
        0x000033da:    61c3        .a      STR      r3,[r0,#0x1c]
        0x000033dc:    480d        .H      LDR      r0,[pc,#52] ; [0x3414] = 0x200002dc
        0x000033de:    6101        .a      STR      r1,[r0,#0x10]
        0x000033e0:    6142        Ba      STR      r2,[r0,#0x14]
        0x000033e2:    490d        .I      LDR      r1,[pc,#52] ; [0x3418] = 0x3332
        0x000033e4:    6181        .a      STR      r1,[r0,#0x18]
        0x000033e6:    4249        IB      RSBS     r1,r1,#0
        0x000033e8:    61c1        .a      STR      r1,[r0,#0x1c]
        0x000033ea:    480c        .H      LDR      r0,[pc,#48] ; [0x341c] = 0x40046400
        0x000033ec:    6044        D`      STR      r4,[r0,#4]
        0x000033ee:    480c        .H      LDR      r0,[pc,#48] ; [0x3420] = 0x2000023a
        0x000033f0:    8304        ..      STRH     r4,[r0,#0x18]
        0x000033f2:    8344        D.      STRH     r4,[r0,#0x1a]
        0x000033f4:    bd10        ..      POP      {r4,pc}
    $d
        0x000033f6:    0000        ..      DCW    0
        0x000033f8:    200001e4    ...     DCD    536871396
        0x000033fc:    00017700    .w..    DCD    96000
        0x00003400:    200000a4    ...     DCD    536871076
        0x00003404:    000027fd    .'..    DCD    10237
        0x00003408:    20000304    ...     DCD    536871684
        0x0000340c:    00001fff    ....    DCD    8191
        0x00003410:    00007332    2s..    DCD    29490
        0x00003414:    200002dc    ...     DCD    536871644
        0x00003418:    00003332    23..    DCD    13106
        0x0000341c:    40046400    .d.@    DCD    1074029568
        0x00003420:    2000023a    :..     DCD    536871482
    $t
    i.TailWindSpeedDetect
    TailWindSpeedDetect
        0x00003424:    b5f8        ..      PUSH     {r3-r7,lr}
        0x00003426:    484a        JH      LDR      r0,[pc,#296] ; [0x3550] = 0x20000010
        0x00003428:    7800        .x      LDRB     r0,[r0,#0]
        0x0000342a:    2803        .(      CMP      r0,#3
        0x0000342c:    d12b        +.      BNE      0x3486 ; TailWindSpeedDetect + 98
        0x0000342e:    4849        IH      LDR      r0,[pc,#292] ; [0x3554] = 0x200001e4
        0x00003430:    7980        .y      LDRB     r0,[r0,#6]
        0x00003432:    2800        .(      CMP      r0,#0
        0x00003434:    d127        '.      BNE      0x3486 ; TailWindSpeedDetect + 98
        0x00003436:    4848        HH      LDR      r0,[pc,#288] ; [0x3558] = 0x200002a8
        0x00003438:    4948        HI      LDR      r1,[pc,#288] ; [0x355c] = 0x2000001e
        0x0000343a:    8980        ..      LDRH     r0,[r0,#0xc]
        0x0000343c:    8008        ..      STRH     r0,[r1,#0]
        0x0000343e:    4b45        EK      LDR      r3,[pc,#276] ; [0x3554] = 0x200001e4
        0x00003440:    4a47        GJ      LDR      r2,[pc,#284] ; [0x3560] = 0x71c
        0x00003442:    79dc        .y      LDRB     r4,[r3,#7]
        0x00003444:    7c59        Y|      LDRB     r1,[r3,#0x11]
        0x00003446:    1c64        d.      ADDS     r4,r4,#1
        0x00003448:    1c49        I.      ADDS     r1,r1,#1
        0x0000344a:    b2e6        ..      UXTB     r6,r4
        0x0000344c:    7a9f        .z      LDRB     r7,[r3,#0xa]
        0x0000344e:    795c        \y      LDRB     r4,[r3,#5]
        0x00003450:    7edd        .~      LDRB     r5,[r3,#0x1b]
        0x00003452:    b2c9        ..      UXTB     r1,r1
        0x00003454:    4290        .B      CMP      r0,r2
        0x00003456:    d21f        ..      BCS      0x3498 ; TailWindSpeedDetect + 116
        0x00003458:    461a        .F      MOV      r2,r3
        0x0000345a:    2f00        ./      CMP      r7,#0
        0x0000345c:    d001        ..      BEQ      0x3462 ; TailWindSpeedDetect + 62
        0x0000345e:    2c03        .,      CMP      r4,#3
        0x00003460:    d10f        ..      BNE      0x3482 ; TailWindSpeedDetect + 94
        0x00003462:    2000        .       MOVS     r0,#0
        0x00003464:    8110        ..      STRH     r0,[r2,#8]
        0x00003466:    2301        .#      MOVS     r3,#1
        0x00003468:    7293        .r      STRB     r3,[r2,#0xa]
        0x0000346a:    2c03        .,      CMP      r4,#3
        0x0000346c:    d100        ..      BNE      0x3470 ; TailWindSpeedDetect + 76
        0x0000346e:    7451        Qt      STRB     r1,[r2,#0x11]
        0x00003470:    2d00        .-      CMP      r5,#0
        0x00003472:    d009        ..      BEQ      0x3488 ; TailWindSpeedDetect + 100
        0x00003474:    2d01        .-      CMP      r5,#1
        0x00003476:    d009        ..      BEQ      0x348c ; TailWindSpeedDetect + 104
        0x00003478:    2d04        .-      CMP      r5,#4
        0x0000347a:    d00a        ..      BEQ      0x3492 ; TailWindSpeedDetect + 110
        0x0000347c:    2d05        .-      CMP      r5,#5
        0x0000347e:    d008        ..      BEQ      0x3492 ; TailWindSpeedDetect + 110
        0x00003480:    76d0        .v      STRB     r0,[r2,#0x1b]
        0x00003482:    2001        .       MOVS     r0,#1
        0x00003484:    7150        Pq      STRB     r0,[r2,#5]
        0x00003486:    bdf8        ..      POP      {r3-r7,pc}
        0x00003488:    76d3        .v      STRB     r3,[r2,#0x1b]
        0x0000348a:    e7fa        ..      B        0x3482 ; TailWindSpeedDetect + 94
        0x0000348c:    2002        .       MOVS     r0,#2
        0x0000348e:    76d0        .v      STRB     r0,[r2,#0x1b]
        0x00003490:    e7f7        ..      B        0x3482 ; TailWindSpeedDetect + 94
        0x00003492:    71d6        .q      STRB     r6,[r2,#7]
        0x00003494:    76d0        .v      STRB     r0,[r2,#0x1b]
        0x00003496:    e7f4        ..      B        0x3482 ; TailWindSpeedDetect + 94
        0x00003498:    4a32        2J      LDR      r2,[pc,#200] ; [0x3564] = 0xffff871c
        0x0000349a:    4b33        3K      LDR      r3,[pc,#204] ; [0x3568] = 0xe38
        0x0000349c:    1882        ..      ADDS     r2,r0,r2
        0x0000349e:    429a        .B      CMP      r2,r3
        0x000034a0:    d232        2.      BCS      0x3508 ; TailWindSpeedDetect + 228
        0x000034a2:    2c01        .,      CMP      r4,#1
        0x000034a4:    d001        ..      BEQ      0x34aa ; TailWindSpeedDetect + 134
        0x000034a6:    2c03        .,      CMP      r4,#3
        0x000034a8:    d12a        *.      BNE      0x3500 ; TailWindSpeedDetect + 220
        0x000034aa:    482a        *H      LDR      r0,[pc,#168] ; [0x3554] = 0x200001e4
        0x000034ac:    8900        ..      LDRH     r0,[r0,#8]
        0x000034ae:    1c40        @.      ADDS     r0,r0,#1
        0x000034b0:    b281        ..      UXTH     r1,r0
        0x000034b2:    4828        (H      LDR      r0,[pc,#160] ; [0x3554] = 0x200001e4
        0x000034b4:    8101        ..      STRH     r1,[r0,#8]
        0x000034b6:    68c0        .h      LDR      r0,[r0,#0xc]
        0x000034b8:    f7fcfe3c    ..<.    BL       __aeabi_uidiv ; 0x134
        0x000034bc:    4925        %I      LDR      r1,[pc,#148] ; [0x3554] = 0x200001e4
        0x000034be:    8048        H.      STRH     r0,[r1,#2]
        0x000034c0:    2d00        .-      CMP      r5,#0
        0x000034c2:    d006        ..      BEQ      0x34d2 ; TailWindSpeedDetect + 174
        0x000034c4:    2d01        .-      CMP      r5,#1
        0x000034c6:    d009        ..      BEQ      0x34dc ; TailWindSpeedDetect + 184
        0x000034c8:    2d02        .-      CMP      r5,#2
        0x000034ca:    d007        ..      BEQ      0x34dc ; TailWindSpeedDetect + 184
        0x000034cc:    4821        !H      LDR      r0,[pc,#132] ; [0x3554] = 0x200001e4
