747lulu747/SAOZHAN_BRUASH/src/SDK-LIB/华芯第一版本硬件-非FPC/ROMAN-21DD - SDK - V0.1/out/SWM211.asm
        0x000034ce:    2100        .!      MOVS     r1,#0
        0x000034d0:    76c1        .v      STRB     r1,[r0,#0x1b]
        0x000034d2:    4820         H      LDR      r0,[pc,#128] ; [0x3554] = 0x200001e4
        0x000034d4:    71c6        .q      STRB     r6,[r0,#7]
        0x000034d6:    2f01        ./      CMP      r7,#1
        0x000034d8:    d004        ..      BEQ      0x34e4 ; TailWindSpeedDetect + 192
        0x000034da:    e005        ..      B        0x34e8 ; TailWindSpeedDetect + 196
        0x000034dc:    481d        .H      LDR      r0,[pc,#116] ; [0x3554] = 0x200001e4
        0x000034de:    1ced        ..      ADDS     r5,r5,#3
        0x000034e0:    76c5        .v      STRB     r5,[r0,#0x1b]
        0x000034e2:    e7f6        ..      B        0x34d2 ; TailWindSpeedDetect + 174
        0x000034e4:    2100        .!      MOVS     r1,#0
        0x000034e6:    7281        .r      STRB     r1,[r0,#0xa]
        0x000034e8:    2c01        .,      CMP      r4,#1
        0x000034ea:    d002        ..      BEQ      0x34f2 ; TailWindSpeedDetect + 206
        0x000034ec:    2c03        .,      CMP      r4,#3
        0x000034ee:    d003        ..      BEQ      0x34f8 ; TailWindSpeedDetect + 212
        0x000034f0:    e004        ..      B        0x34fc ; TailWindSpeedDetect + 216
        0x000034f2:    2100        .!      MOVS     r1,#0
        0x000034f4:    7101        .q      STRB     r1,[r0,#4]
        0x000034f6:    e001        ..      B        0x34fc ; TailWindSpeedDetect + 216
        0x000034f8:    2101        .!      MOVS     r1,#1
        0x000034fa:    7101        .q      STRB     r1,[r0,#4]
        0x000034fc:    2100        .!      MOVS     r1,#0
        0x000034fe:    7441        At      STRB     r1,[r0,#0x11]
        0x00003500:    4814        .H      LDR      r0,[pc,#80] ; [0x3554] = 0x200001e4
        0x00003502:    2102        .!      MOVS     r1,#2
        0x00003504:    7141        Aq      STRB     r1,[r0,#5]
        0x00003506:    bdf8        ..      POP      {r3-r7,pc}
        0x00003508:    4a18        .J      LDR      r2,[pc,#96] ; [0x356c] = 0xf8e2
        0x0000350a:    4290        .B      CMP      r0,r2
        0x0000350c:    d9fb        ..      BLS      0x3506 ; TailWindSpeedDetect + 226
        0x0000350e:    4a11        .J      LDR      r2,[pc,#68] ; [0x3554] = 0x200001e4
        0x00003510:    2f00        ./      CMP      r7,#0
        0x00003512:    d001        ..      BEQ      0x3518 ; TailWindSpeedDetect + 244
        0x00003514:    2c01        .,      CMP      r4,#1
        0x00003516:    d10f        ..      BNE      0x3538 ; TailWindSpeedDetect + 276
        0x00003518:    2000        .       MOVS     r0,#0
        0x0000351a:    8110        ..      STRH     r0,[r2,#8]
        0x0000351c:    2301        .#      MOVS     r3,#1
        0x0000351e:    7293        .r      STRB     r3,[r2,#0xa]
        0x00003520:    2c01        .,      CMP      r4,#1
        0x00003522:    d100        ..      BNE      0x3526 ; TailWindSpeedDetect + 258
        0x00003524:    7451        Qt      STRB     r1,[r2,#0x11]
        0x00003526:    2d00        .-      CMP      r5,#0
        0x00003528:    d009        ..      BEQ      0x353e ; TailWindSpeedDetect + 282
        0x0000352a:    2d01        .-      CMP      r5,#1
        0x0000352c:    d009        ..      BEQ      0x3542 ; TailWindSpeedDetect + 286
        0x0000352e:    2d04        .-      CMP      r5,#4
        0x00003530:    d00a        ..      BEQ      0x3548 ; TailWindSpeedDetect + 292
        0x00003532:    2d05        .-      CMP      r5,#5
        0x00003534:    d008        ..      BEQ      0x3548 ; TailWindSpeedDetect + 292
        0x00003536:    76d0        .v      STRB     r0,[r2,#0x1b]
        0x00003538:    2003        .       MOVS     r0,#3
        0x0000353a:    7150        Pq      STRB     r0,[r2,#5]
        0x0000353c:    bdf8        ..      POP      {r3-r7,pc}
        0x0000353e:    76d3        .v      STRB     r3,[r2,#0x1b]
        0x00003540:    e7fa        ..      B        0x3538 ; TailWindSpeedDetect + 276
        0x00003542:    2002        .       MOVS     r0,#2
        0x00003544:    76d0        .v      STRB     r0,[r2,#0x1b]
        0x00003546:    e7f7        ..      B        0x3538 ; TailWindSpeedDetect + 276
        0x00003548:    71d6        .q      STRB     r6,[r2,#7]
        0x0000354a:    76d0        .v      STRB     r0,[r2,#0x1b]
        0x0000354c:    e7f4        ..      B        0x3538 ; TailWindSpeedDetect + 276
    $d
        0x0000354e:    0000        ..      DCW    0
        0x00003550:    20000010    ...     DCD    536870928
        0x00003554:    200001e4    ...     DCD    536871396
        0x00003558:    200002a8    ...     DCD    536871592
        0x0000355c:    2000001e    ...     DCD    536870942
        0x00003560:    0000071c    ....    DCD    1820
        0x00003564:    ffff871c    ....    DCD    4294936348
        0x00003568:    00000e38    8...    DCD    3640
        0x0000356c:    0000f8e2    ....    DCD    63714
    $t
    i.Timer_FGOutput
    Timer_FGOutput
        0x00003570:    b510        ..      PUSH     {r4,lr}
        0x00003572:    4813        .H      LDR      r0,[pc,#76] ; [0x35c0] = 0x20000010
        0x00003574:    7800        .x      LDRB     r0,[r0,#0]
        0x00003576:    2807        .(      CMP      r0,#7
        0x00003578:    d121        !.      BNE      0x35be ; Timer_FGOutput + 78
        0x0000357a:    4c12        .L      LDR      r4,[pc,#72] ; [0x35c4] = 0x20000064
        0x0000357c:    2012        .       MOVS     r0,#0x12
        0x0000357e:    5e20         ^      LDRSH    r0,[r4,r0]
        0x00003580:    21ff        .!      MOVS     r1,#0xff
        0x00003582:    3191        .1      ADDS     r1,r1,#0x91
        0x00003584:    4288        .B      CMP      r0,r1
        0x00003586:    dd1a        ..      BLE      0x35be ; Timer_FGOutput + 78
        0x00003588:    f7fcffb8    ....    BL       __aeabi_i2d ; 0x4fc
        0x0000358c:    2200        ."      MOVS     r2,#0
        0x0000358e:    4b0e        .K      LDR      r3,[pc,#56] ; [0x35c8] = 0x40140000
        0x00003590:    f7fcfebe    ....    BL       __aeabi_dmul ; 0x310
        0x00003594:    4602        .F      MOV      r2,r0
        0x00003596:    460b        .F      MOV      r3,r1
        0x00003598:    2000        .       MOVS     r0,#0
        0x0000359a:    490c        .I      LDR      r1,[pc,#48] ; [0x35cc] = 0x418c9c38
        0x0000359c:    f7fcff20    .. .    BL       __aeabi_ddiv ; 0x3e0
        0x000035a0:    2200        ."      MOVS     r2,#0
        0x000035a2:    4b0b        .K      LDR      r3,[pc,#44] ; [0x35d0] = 0x3ff00000
        0x000035a4:    f7fcfea6    ....    BL       __aeabi_dsub ; 0x2f4
        0x000035a8:    f7fcffee    ....    BL       __aeabi_d2uiz ; 0x588
        0x000035ac:    6620         f      STR      r0,[r4,#0x60]
        0x000035ae:    4909        .I      LDR      r1,[pc,#36] ; [0x35d4] = 0x200000a4
        0x000035b0:    b280        ..      UXTH     r0,r0
        0x000035b2:    8488        ..      STRH     r0,[r1,#0x24]
        0x000035b4:    0842        B.      LSRS     r2,r0,#1
        0x000035b6:    84ca        ..      STRH     r2,[r1,#0x26]
        0x000035b8:    4907        .I      LDR      r1,[pc,#28] ; [0x35d8] = 0x40046800
        0x000035ba:    620a        .b      STR      r2,[r1,#0x20]
        0x000035bc:    6008        .`      STR      r0,[r1,#0]
        0x000035be:    bd10        ..      POP      {r4,pc}
    $d
        0x000035c0:    20000010    ...     DCD    536870928
        0x000035c4:    20000064    d..     DCD    536871012
        0x000035c8:    40140000    ...@    DCD    1075052544
        0x000035cc:    418c9c38    8..A    DCD    1099734072
        0x000035d0:    3ff00000    ...?    DCD    1072693248
        0x000035d4:    200000a4    ...     DCD    536871076
        0x000035d8:    40046800    .h.@    DCD    1074030592
    $t
    i.VariablesPreInit
    VariablesPreInit
        0x000035dc:    b510        ..      PUSH     {r4,lr}
        0x000035de:    4811        .H      LDR      r0,[pc,#68] ; [0x3624] = 0x20000018
        0x000035e0:    2400        .$      MOVS     r4,#0
        0x000035e2:    7004        .p      STRB     r4,[r0,#0]
        0x000035e4:    212e        .!      MOVS     r1,#0x2e
        0x000035e6:    4810        .H      LDR      r0,[pc,#64] ; [0x3628] = 0x2000019c
        0x000035e8:    f7fcfdd5    ....    BL       __aeabi_memclr ; 0x196
        0x000035ec:    216c        l!      MOVS     r1,#0x6c
        0x000035ee:    480f        .H      LDR      r0,[pc,#60] ; [0x362c] = 0x20000064
        0x000035f0:    f7fcfdd1    ....    BL       __aeabi_memclr ; 0x196
        0x000035f4:    2107        .!      MOVS     r1,#7
        0x000035f6:    480e        .H      LDR      r0,[pc,#56] ; [0x3630] = 0x20000011
        0x000035f8:    f7fcfdcd    ....    BL       __aeabi_memclr ; 0x196
        0x000035fc:    480b        .H      LDR      r0,[pc,#44] ; [0x362c] = 0x20000064
        0x000035fe:    64c4        .d      STR      r4,[r0,#0x4c]
        0x00003600:    480c        .H      LDR      r0,[pc,#48] ; [0x3634] = 0x20000184
        0x00003602:    6004        .`      STR      r4,[r0,#0]
        0x00003604:    217d        }!      MOVS     r1,#0x7d
        0x00003606:    01c9        ..      LSLS     r1,r1,#7
        0x00003608:    6041        A`      STR      r1,[r0,#4]
        0x0000360a:    2136        6!      MOVS     r1,#0x36
        0x0000360c:    8101        ..      STRH     r1,[r0,#8]
        0x0000360e:    8144        D.      STRH     r4,[r0,#0xa]
        0x00003610:    211b        .!      MOVS     r1,#0x1b
        0x00003612:    8181        ..      STRH     r1,[r0,#0xc]
        0x00003614:    21ff        .!      MOVS     r1,#0xff
        0x00003616:    31ec        .1      ADDS     r1,r1,#0xec
        0x00003618:    81c1        ..      STRH     r1,[r0,#0xe]
        0x0000361a:    2105        .!      MOVS     r1,#5
        0x0000361c:    6101        .a      STR      r1,[r0,#0x10]
        0x0000361e:    4906        .I      LDR      r1,[pc,#24] ; [0x3638] = 0x6d3a0
        0x00003620:    6141        Aa      STR      r1,[r0,#0x14]
        0x00003622:    bd10        ..      POP      {r4,pc}
    $d
        0x00003624:    20000018    ...     DCD    536870936
        0x00003628:    2000019c    ...     DCD    536871324
        0x0000362c:    20000064    d..     DCD    536871012
        0x00003630:    20000011    ...     DCD    536870929
        0x00003634:    20000184    ...     DCD    536871300
        0x00003638:    0006d3a0    ....    DCD    447392
    $t
    i.__ARM_clz
    __ARM_clz
        0x0000363c:    2120         !      MOVS     r1,#0x20
        0x0000363e:    0c02        ..      LSRS     r2,r0,#16
        0x00003640:    d001        ..      BEQ      0x3646 ; __ARM_clz + 10
        0x00003642:    2110        .!      MOVS     r1,#0x10
        0x00003644:    4610        .F      MOV      r0,r2
        0x00003646:    0a02        ..      LSRS     r2,r0,#8
        0x00003648:    d001        ..      BEQ      0x364e ; __ARM_clz + 18
        0x0000364a:    4610        .F      MOV      r0,r2
        0x0000364c:    3908        .9      SUBS     r1,r1,#8
        0x0000364e:    0902        ..      LSRS     r2,r0,#4
        0x00003650:    d001        ..      BEQ      0x3656 ; __ARM_clz + 26
        0x00003652:    4610        .F      MOV      r0,r2
        0x00003654:    1f09        ..      SUBS     r1,r1,#4
        0x00003656:    0882        ..      LSRS     r2,r0,#2
        0x00003658:    d001        ..      BEQ      0x365e ; __ARM_clz + 34
        0x0000365a:    4610        .F      MOV      r0,r2
        0x0000365c:    1e89        ..      SUBS     r1,r1,#2
        0x0000365e:    0842        B.      LSRS     r2,r0,#1
        0x00003660:    d001        ..      BEQ      0x3666 ; __ARM_clz + 42
        0x00003662:    1e88        ..      SUBS     r0,r1,#2
        0x00003664:    4770        pG      BX       lr
        0x00003666:    1a08        ..      SUBS     r0,r1,r0
        0x00003668:    4770        pG      BX       lr
    i.__ARM_common_ll_mulss
    __ARM_common_ll_mulss
        0x0000366a:    b4f0        ..      PUSH     {r4-r7}
        0x0000366c:    1404        ..      ASRS     r4,r0,#16
        0x0000366e:    b28b        ..      UXTH     r3,r1
        0x00003670:    4626        &F      MOV      r6,r4
        0x00003672:    b282        ..      UXTH     r2,r0
        0x00003674:    435e        ^C      MULS     r6,r3,r6
        0x00003676:    140d        ..      ASRS     r5,r1,#16
        0x00003678:    4610        .F      MOV      r0,r2
        0x0000367a:    1437        7.      ASRS     r7,r6,#16
        0x0000367c:    4358        XC      MULS     r0,r3,r0
        0x0000367e:    0436        6.      LSLS     r6,r6,#16
        0x00003680:    1980        ..      ADDS     r0,r0,r6
        0x00003682:    2100        .!      MOVS     r1,#0
        0x00003684:    4179        yA      ADCS     r1,r1,r7
        0x00003686:    4616        .F      MOV      r6,r2
        0x00003688:    436e        nC      MULS     r6,r5,r6
        0x0000368a:    1437        7.      ASRS     r7,r6,#16
        0x0000368c:    0436        6.      LSLS     r6,r6,#16
        0x0000368e:    1980        ..      ADDS     r0,r0,r6
        0x00003690:    4179        yA      ADCS     r1,r1,r7
        0x00003692:    4626        &F      MOV      r6,r4
        0x00003694:    436e        nC      MULS     r6,r5,r6
        0x00003696:    1989        ..      ADDS     r1,r1,r6
        0x00003698:    bcf0        ..      POP      {r4-r7}
        0x0000369a:    4770        pG      BX       lr
    i.__scatterload_copy
    __scatterload_copy
        0x0000369c:    e002        ..      B        0x36a4 ; __scatterload_copy + 8
        0x0000369e:    c808        ..      LDM      r0!,{r3}
        0x000036a0:    1f12        ..      SUBS     r2,r2,#4
        0x000036a2:    c108        ..      STM      r1!,{r3}
        0x000036a4:    2a00        .*      CMP      r2,#0
        0x000036a6:    d1fa        ..      BNE      0x369e ; __scatterload_copy + 2
        0x000036a8:    4770        pG      BX       lr
    i.__scatterload_null
    __scatterload_null
        0x000036aa:    4770        pG      BX       lr
    i.__scatterload_zeroinit
    __scatterload_zeroinit
        0x000036ac:    2000        .       MOVS     r0,#0
        0x000036ae:    e001        ..      B        0x36b4 ; __scatterload_zeroinit + 8
        0x000036b0:    c101        ..      STM      r1!,{r0}
        0x000036b2:    1f12        ..      SUBS     r2,r2,#4
        0x000036b4:    2a00        .*      CMP      r2,#0
        0x000036b6:    d1fb        ..      BNE      0x36b0 ; __scatterload_zeroinit + 4
        0x000036b8:    4770        pG      BX       lr
        0x000036ba:    0000        ..      MOVS     r0,r0
    i.main
    main
        0x000036bc:    2400        .$      MOVS     r4,#0
        0x000036be:    b672        r.      CPSID    i
        0x000036c0:    f7fffc40    ..@.    BL       SystemInit ; 0x2f44
        0x000036c4:    490a        .I      LDR      r1,[pc,#40] ; [0x36f0] = 0x186a0
        0x000036c6:    bf00        ..      NOP      
        0x000036c8:    bf00        ..      NOP      
        0x000036ca:    bf00        ..      NOP      
        0x000036cc:    1c64        d.      ADDS     r4,r4,#1
        0x000036ce:    428c        .B      CMP      r4,r1
        0x000036d0:    d3f9        ..      BCC      0x36c6 ; main + 10
        0x000036d2:    2000        .       MOVS     r0,#0
        0x000036d4:    bf00        ..      NOP      
        0x000036d6:    bf00        ..      NOP      
        0x000036d8:    bf00        ..      NOP      
        0x000036da:    1c40        @.      ADDS     r0,r0,#1
        0x000036dc:    4288        .B      CMP      r0,r1
        0x000036de:    d3f9        ..      BCC      0x36d4 ; main + 24
        0x000036e0:    f7fef8c4    ....    BL       HardwareInit ; 0x186c
        0x000036e4:    f7fffb3e    ..>.    BL       SoftwareInit ; 0x2d64
        0x000036e8:    b662        b.      CPSIE    i
        0x000036ea:    f7ffff41    ..A.    BL       Timer_FGOutput ; 0x3570
        0x000036ee:    e7fc        ..      B        0x36ea ; main + 46
    $d
        0x000036f0:    000186a0    ....    DCD    100000
    $t
    i.mcPI_CurrentLoop
    mcPI_CurrentLoop
        0x000036f4:    b470        p.      PUSH     {r4-r6}
        0x000036f6:    8108        ..      STRH     r0,[r1,#8]
        0x000036f8:    260a        .&      MOVS     r6,#0xa
        0x000036fa:    690a        .i      LDR      r2,[r1,#0x10]
        0x000036fc:    5f8e        ._      LDRSH    r6,[r1,r6]
        0x000036fe:    4613        .F      MOV      r3,r2
        0x00003700:    4373        sC      MULS     r3,r6,r3
        0x00003702:    131c        ..      ASRS     r4,r3,#12
        0x00003704:    60cc        .`      STR      r4,[r1,#0xc]
        0x00003706:    698b        .i      LDR      r3,[r1,#0x18]
        0x00003708:    429c        .B      CMP      r4,r3
        0x0000370a:    db04        ..      BLT      0x3716 ; mcPI_CurrentLoop + 34
        0x0000370c:    4342        BC      MULS     r2,r0,r2
        0x0000370e:    1312        ..      ASRS     r2,r2,#12
        0x00003710:    1ad2        ..      SUBS     r2,r2,r3
        0x00003712:    600a        .`      STR      r2,[r1,#0]
        0x00003714:    e00b        ..      B        0x372e ; mcPI_CurrentLoop + 58
        0x00003716:    69cd        .i      LDR      r5,[r1,#0x1c]
        0x00003718:    42ac        .B      CMP      r4,r5
        0x0000371a:    dc04        ..      BGT      0x3726 ; mcPI_CurrentLoop + 50
        0x0000371c:    4342        BC      MULS     r2,r0,r2
        0x0000371e:    1312        ..      ASRS     r2,r2,#12
        0x00003720:    1b52        R.      SUBS     r2,r2,r5
        0x00003722:    600a        .`      STR      r2,[r1,#0]
        0x00003724:    e003        ..      B        0x372e ; mcPI_CurrentLoop + 58
        0x00003726:    1b84        ..      SUBS     r4,r0,r6
        0x00003728:    4362        bC      MULS     r2,r4,r2
        0x0000372a:    1312        ..      ASRS     r2,r2,#12
        0x0000372c:    600a        .`      STR      r2,[r1,#0]
        0x0000372e:    694a        Ji      LDR      r2,[r1,#0x14]
        0x00003730:    4342        BC      MULS     r2,r0,r2
        0x00003732:    13d2        ..      ASRS     r2,r2,#15
        0x00003734:    604a        J`      STR      r2,[r1,#4]
        0x00003736:    680d        .h      LDR      r5,[r1,#0]
        0x00003738:    6a0c        .j      LDR      r4,[r1,#0x20]
        0x0000373a:    1964        d.      ADDS     r4,r4,r5
        0x0000373c:    18a2        ..      ADDS     r2,r4,r2
        0x0000373e:    8148        H.      STRH     r0,[r1,#0xa]
        0x00003740:    4293        .B      CMP      r3,r2
        0x00003742:    da01        ..      BGE      0x3748 ; mcPI_CurrentLoop + 84
        0x00003744:    620b        .b      STR      r3,[r1,#0x20]
        0x00003746:    e005        ..      B        0x3754 ; mcPI_CurrentLoop + 96
        0x00003748:    69c8        .i      LDR      r0,[r1,#0x1c]
        0x0000374a:    4290        .B      CMP      r0,r2
        0x0000374c:    dd01        ..      BLE      0x3752 ; mcPI_CurrentLoop + 94
        0x0000374e:    6208        .b      STR      r0,[r1,#0x20]
        0x00003750:    e000        ..      B        0x3754 ; mcPI_CurrentLoop + 96
        0x00003752:    620a        .b      STR      r2,[r1,#0x20]
        0x00003754:    8c08        ..      LDRH     r0,[r1,#0x20]
        0x00003756:    8488        ..      STRH     r0,[r1,#0x24]
        0x00003758:    bc70        p.      POP      {r4-r6}
        0x0000375a:    4770        pG      BX       lr
    i.mc_ControllerPI
    mc_ControllerPI
        0x0000375c:    b410        ..      PUSH     {r4}
        0x0000375e:    8108        ..      STRH     r0,[r1,#8]
        0x00003760:    894a        J.      LDRH     r2,[r1,#0xa]
        0x00003762:    1a82        ..      SUBS     r2,r0,r2
        0x00003764:    b212        ..      SXTH     r2,r2
        0x00003766:    230c        .#      MOVS     r3,#0xc
        0x00003768:    5ecb        .^      LDRSH    r3,[r1,r3]
        0x0000376a:    4353        SC      MULS     r3,r2,r3
        0x0000376c:    131a        ..      ASRS     r2,r3,#12
        0x0000376e:    600a        .`      STR      r2,[r1,#0]
        0x00003770:    230e        .#      MOVS     r3,#0xe
        0x00003772:    5ecb        .^      LDRSH    r3,[r1,r3]
        0x00003774:    4343        CC      MULS     r3,r0,r3
        0x00003776:    13db        ..      ASRS     r3,r3,#15
        0x00003778:    604b        K`      STR      r3,[r1,#4]
        0x0000377a:    2416        .$      MOVS     r4,#0x16
        0x0000377c:    5f0c        ._      LDRSH    r4,[r1,r4]
        0x0000377e:    18a2        ..      ADDS     r2,r4,r2
        0x00003780:    18d2        ..      ADDS     r2,r2,r3
        0x00003782:    8148        H.      STRH     r0,[r1,#0xa]
        0x00003784:    2012        .       MOVS     r0,#0x12
        0x00003786:    5e08        .^      LDRSH    r0,[r1,r0]
        0x00003788:    4290        .B      CMP      r0,r2
        0x0000378a:    da02        ..      BGE      0x3792 ; mc_ControllerPI + 54
        0x0000378c:    82c8        ..      STRH     r0,[r1,#0x16]
        0x0000378e:    bc10        ..      POP      {r4}
        0x00003790:    4770        pG      BX       lr
        0x00003792:    2014        .       MOVS     r0,#0x14
        0x00003794:    5e08        .^      LDRSH    r0,[r1,r0]
        0x00003796:    4290        .B      CMP      r0,r2
        0x00003798:    dd02        ..      BLE      0x37a0 ; mc_ControllerPI + 68
        0x0000379a:    82c8        ..      STRH     r0,[r1,#0x16]
        0x0000379c:    bc10        ..      POP      {r4}
        0x0000379e:    4770        pG      BX       lr
        0x000037a0:    82ca        ..      STRH     r2,[r1,#0x16]
        0x000037a2:    bc10        ..      POP      {r4}
        0x000037a4:    4770        pG      BX       lr
        0x000037a6:    0000        ..      MOVS     r0,r0
    i.mc_bemfobserv_PLL
    mc_bemfobserv_PLL
        0x000037a8:    b5f8        ..      PUSH     {r3-r7,lr}
        0x000037aa:    4614        .F      MOV      r4,r2
        0x000037ac:    220c        ."      MOVS     r2,#0xc
        0x000037ae:    2500        .%      MOVS     r5,#0
        0x000037b0:    5ea2        .^      LDRSH    r2,[r4,r2]
        0x000037b2:    5f65        e_      LDRSH    r5,[r4,r5]
        0x000037b4:    2300        .#      MOVS     r3,#0
        0x000037b6:    436a        jC      MULS     r2,r5,r2
        0x000037b8:    13d6        ..      ASRS     r6,r2,#15
        0x000037ba:    2202        ."      MOVS     r2,#2
        0x000037bc:    5ea2        .^      LDRSH    r2,[r4,r2]
        0x000037be:    5ecb        .^      LDRSH    r3,[r1,r3]
        0x000037c0:    4694        .F      MOV      r12,r2
        0x000037c2:    4353        SC      MULS     r3,r2,r3
        0x000037c4:    13da        ..      ASRS     r2,r3,#15
        0x000037c6:    18b3        ..      ADDS     r3,r6,r2
        0x000037c8:    220a        ."      MOVS     r2,#0xa
        0x000037ca:    2704        .'      MOVS     r7,#4
        0x000037cc:    5ea2        .^      LDRSH    r2,[r4,r2]
        0x000037ce:    5fe7        ._      LDRSH    r7,[r4,r7]
        0x000037d0:    2606        .&      MOVS     r6,#6
        0x000037d2:    437a        zC      MULS     r2,r7,r2
        0x000037d4:    13d2        ..      ASRS     r2,r2,#15
        0x000037d6:    1a9a        ..      SUBS     r2,r3,r2
        0x000037d8:    2318        .#      MOVS     r3,#0x18
        0x000037da:    5ee3        .^      LDRSH    r3,[r4,r3]
        0x000037dc:    5fa6        ._      LDRSH    r6,[r4,r6]
        0x000037de:    46be        .F      MOV      lr,r7
        0x000037e0:    435e        ^C      MULS     r6,r3,r6
