747lulu747/SAOZHAN_BRUASH/src/SDK-LIB/华芯第一版本硬件-非FPC/ROMAN-21DD - SDK - V0.1/out/SWM211.asm
        0x000037e2:    13f6        ..      ASRS     r6,r6,#15
        0x000037e4:    1b92        ..      SUBS     r2,r2,r6
        0x000037e6:    271a        .'      MOVS     r7,#0x1a
        0x000037e8:    5fe7        ._      LDRSH    r7,[r4,r7]
        0x000037ea:    436f        oC      MULS     r7,r5,r7
        0x000037ec:    13fd        ..      ASRS     r5,r7,#15
        0x000037ee:    2702        .'      MOVS     r7,#2
        0x000037f0:    5fcf        ._      LDRSH    r7,[r1,r7]
        0x000037f2:    4661        aF      MOV      r1,r12
        0x000037f4:    434f        OC      MULS     r7,r1,r7
        0x000037f6:    13f9        ..      ASRS     r1,r7,#15
        0x000037f8:    4677        wF      MOV      r7,lr
        0x000037fa:    437b        {C      MULS     r3,r7,r3
        0x000037fc:    1869        i.      ADDS     r1,r5,r1
        0x000037fe:    13db        ..      ASRS     r3,r3,#15
        0x00003800:    1ac9        ..      SUBS     r1,r1,r3
        0x00003802:    1989        ..      ADDS     r1,r1,r6
        0x00003804:    4f9b        .O      LDR      r7,[pc,#620] ; [0x3a74] = 0x7fff
        0x00003806:    42ba        .B      CMP      r2,r7
        0x00003808:    dd01        ..      BLE      0x380e ; mc_bemfobserv_PLL + 102
        0x0000380a:    81a7        ..      STRH     r7,[r4,#0xc]
        0x0000380c:    e005        ..      B        0x381a ; mc_bemfobserv_PLL + 114
        0x0000380e:    4b9a        .K      LDR      r3,[pc,#616] ; [0x3a78] = 0xffff8001
        0x00003810:    429a        .B      CMP      r2,r3
        0x00003812:    da01        ..      BGE      0x3818 ; mc_bemfobserv_PLL + 112
        0x00003814:    81a3        ..      STRH     r3,[r4,#0xc]
        0x00003816:    e000        ..      B        0x381a ; mc_bemfobserv_PLL + 114
        0x00003818:    81a2        ..      STRH     r2,[r4,#0xc]
        0x0000381a:    42b9        .B      CMP      r1,r7
        0x0000381c:    dd01        ..      BLE      0x3822 ; mc_bemfobserv_PLL + 122
        0x0000381e:    8367        g.      STRH     r7,[r4,#0x1a]
        0x00003820:    e005        ..      B        0x382e ; mc_bemfobserv_PLL + 134
        0x00003822:    4a95        .J      LDR      r2,[pc,#596] ; [0x3a78] = 0xffff8001
        0x00003824:    4291        .B      CMP      r1,r2
        0x00003826:    da01        ..      BGE      0x382c ; mc_bemfobserv_PLL + 132
        0x00003828:    8362        b.      STRH     r2,[r4,#0x1a]
        0x0000382a:    e000        ..      B        0x382e ; mc_bemfobserv_PLL + 134
        0x0000382c:    8361        a.      STRH     r1,[r4,#0x1a]
        0x0000382e:    210c        .!      MOVS     r1,#0xc
        0x00003830:    2200        ."      MOVS     r2,#0
        0x00003832:    5e61        a^      LDRSH    r1,[r4,r1]
        0x00003834:    5e82        .^      LDRSH    r2,[r0,r2]
        0x00003836:    1a89        ..      SUBS     r1,r1,r2
        0x00003838:    6121        !a      STR      r1,[r4,#0x10]
        0x0000383a:    221a        ."      MOVS     r2,#0x1a
        0x0000383c:    2302        .#      MOVS     r3,#2
        0x0000383e:    5ea2        .^      LDRSH    r2,[r4,r2]
        0x00003840:    5ec3        .^      LDRSH    r3,[r0,r3]
        0x00003842:    1ad0        ..      SUBS     r0,r2,r3
        0x00003844:    61e0        .a      STR      r0,[r4,#0x1c]
        0x00003846:    42b9        .B      CMP      r1,r7
        0x00003848:    dd01        ..      BLE      0x384e ; mc_bemfobserv_PLL + 166
        0x0000384a:    6127        'a      STR      r7,[r4,#0x10]
        0x0000384c:    e003        ..      B        0x3856 ; mc_bemfobserv_PLL + 174
        0x0000384e:    4a8a        .J      LDR      r2,[pc,#552] ; [0x3a78] = 0xffff8001
        0x00003850:    4291        .B      CMP      r1,r2
        0x00003852:    da00        ..      BGE      0x3856 ; mc_bemfobserv_PLL + 174
        0x00003854:    6122        "a      STR      r2,[r4,#0x10]
        0x00003856:    42b8        .B      CMP      r0,r7
        0x00003858:    dd01        ..      BLE      0x385e ; mc_bemfobserv_PLL + 182
        0x0000385a:    61e7        .a      STR      r7,[r4,#0x1c]
        0x0000385c:    e003        ..      B        0x3866 ; mc_bemfobserv_PLL + 190
        0x0000385e:    4986        .I      LDR      r1,[pc,#536] ; [0x3a78] = 0xffff8001
        0x00003860:    4288        .B      CMP      r0,r1
        0x00003862:    da00        ..      BGE      0x3866 ; mc_bemfobserv_PLL + 190
        0x00003864:    61e1        .a      STR      r1,[r4,#0x1c]
        0x00003866:    6921        !i      LDR      r1,[r4,#0x10]
        0x00003868:    6b20         k      LDR      r0,[r4,#0x30]
        0x0000386a:    f7fffefe    ....    BL       __ARM_common_ll_mulss ; 0x366a
        0x0000386e:    4605        .F      MOV      r5,r0
        0x00003870:    460e        .F      MOV      r6,r1
        0x00003872:    6921        !i      LDR      r1,[r4,#0x10]
        0x00003874:    6b60        `k      LDR      r0,[r4,#0x34]
        0x00003876:    f7fffef8    ....    BL       __ARM_common_ll_mulss ; 0x366a
        0x0000387a:    2238        8"      MOVS     r2,#0x38
        0x0000387c:    5ea2        .^      LDRSH    r2,[r4,r2]
        0x0000387e:    0233        3.      LSLS     r3,r6,#8
        0x00003880:    0e2d        -.      LSRS     r5,r5,#24
        0x00003882:    431d        .C      ORRS     r5,r5,r3
        0x00003884:    1953        S.      ADDS     r3,r2,r5
        0x00003886:    42bb        .B      CMP      r3,r7
        0x00003888:    dd01        ..      BLE      0x388e ; mc_bemfobserv_PLL + 230
        0x0000388a:    8167        g.      STRH     r7,[r4,#0xa]
        0x0000388c:    e005        ..      B        0x389a ; mc_bemfobserv_PLL + 242
        0x0000388e:    4d7a        zM      LDR      r5,[pc,#488] ; [0x3a78] = 0xffff8001
        0x00003890:    42ab        .B      CMP      r3,r5
        0x00003892:    da01        ..      BGE      0x3898 ; mc_bemfobserv_PLL + 240
        0x00003894:    8165        e.      STRH     r5,[r4,#0xa]
        0x00003896:    e000        ..      B        0x389a ; mc_bemfobserv_PLL + 242
        0x00003898:    8163        c.      STRH     r3,[r4,#0xa]
        0x0000389a:    0209        ..      LSLS     r1,r1,#8
        0x0000389c:    0e00        ..      LSRS     r0,r0,#24
        0x0000389e:    4308        .C      ORRS     r0,r0,r1
        0x000038a0:    1810        ..      ADDS     r0,r2,r0
        0x000038a2:    42b8        .B      CMP      r0,r7
        0x000038a4:    dd01        ..      BLE      0x38aa ; mc_bemfobserv_PLL + 258
        0x000038a6:    8727        '.      STRH     r7,[r4,#0x38]
        0x000038a8:    e005        ..      B        0x38b6 ; mc_bemfobserv_PLL + 270
        0x000038aa:    4973        sI      LDR      r1,[pc,#460] ; [0x3a78] = 0xffff8001
        0x000038ac:    4288        .B      CMP      r0,r1
        0x000038ae:    da01        ..      BGE      0x38b4 ; mc_bemfobserv_PLL + 268
        0x000038b0:    8721        !.      STRH     r1,[r4,#0x38]
        0x000038b2:    e000        ..      B        0x38b6 ; mc_bemfobserv_PLL + 270
        0x000038b4:    8720         .      STRH     r0,[r4,#0x38]
        0x000038b6:    69e1        .i      LDR      r1,[r4,#0x1c]
        0x000038b8:    6b20         k      LDR      r0,[r4,#0x30]
        0x000038ba:    f7fffed6    ....    BL       __ARM_common_ll_mulss ; 0x366a
        0x000038be:    4605        .F      MOV      r5,r0
        0x000038c0:    460e        .F      MOV      r6,r1
        0x000038c2:    223a        :"      MOVS     r2,#0x3a
        0x000038c4:    5ea2        .^      LDRSH    r2,[r4,r2]
        0x000038c6:    0231        1.      LSLS     r1,r6,#8
        0x000038c8:    0e28        (.      LSRS     r0,r5,#24
        0x000038ca:    4308        .C      ORRS     r0,r0,r1
        0x000038cc:    1810        ..      ADDS     r0,r2,r0
        0x000038ce:    42b8        .B      CMP      r0,r7
        0x000038d0:    dd01        ..      BLE      0x38d6 ; mc_bemfobserv_PLL + 302
        0x000038d2:    8327        '.      STRH     r7,[r4,#0x18]
        0x000038d4:    e005        ..      B        0x38e2 ; mc_bemfobserv_PLL + 314
        0x000038d6:    4968        hI      LDR      r1,[pc,#416] ; [0x3a78] = 0xffff8001
        0x000038d8:    4288        .B      CMP      r0,r1
        0x000038da:    da01        ..      BGE      0x38e0 ; mc_bemfobserv_PLL + 312
        0x000038dc:    8321        !.      STRH     r1,[r4,#0x18]
        0x000038de:    e000        ..      B        0x38e2 ; mc_bemfobserv_PLL + 314
        0x000038e0:    8320         .      STRH     r0,[r4,#0x18]
        0x000038e2:    69e1        .i      LDR      r1,[r4,#0x1c]
        0x000038e4:    6b60        `k      LDR      r0,[r4,#0x34]
        0x000038e6:    f7fffec0    ....    BL       __ARM_common_ll_mulss ; 0x366a
        0x000038ea:    223a        :"      MOVS     r2,#0x3a
        0x000038ec:    5ea2        .^      LDRSH    r2,[r4,r2]
        0x000038ee:    0209        ..      LSLS     r1,r1,#8
        0x000038f0:    0e00        ..      LSRS     r0,r0,#24
        0x000038f2:    4308        .C      ORRS     r0,r0,r1
        0x000038f4:    1810        ..      ADDS     r0,r2,r0
        0x000038f6:    42b8        .B      CMP      r0,r7
        0x000038f8:    dd01        ..      BLE      0x38fe ; mc_bemfobserv_PLL + 342
        0x000038fa:    8767        g.      STRH     r7,[r4,#0x3a]
        0x000038fc:    e005        ..      B        0x390a ; mc_bemfobserv_PLL + 354
        0x000038fe:    495e        ^I      LDR      r1,[pc,#376] ; [0x3a78] = 0xffff8001
        0x00003900:    4288        .B      CMP      r0,r1
        0x00003902:    da01        ..      BGE      0x3908 ; mc_bemfobserv_PLL + 352
        0x00003904:    8761        a.      STRH     r1,[r4,#0x3a]
        0x00003906:    e000        ..      B        0x390a ; mc_bemfobserv_PLL + 354
        0x00003908:    8760        `.      STRH     r0,[r4,#0x3a]
        0x0000390a:    495c        \I      LDR      r1,[pc,#368] ; [0x3a7c] = 0x20000038
        0x0000390c:    6808        .h      LDR      r0,[r1,#0]
        0x0000390e:    2801        .(      CMP      r0,#1
        0x00003910:    da05        ..      BGE      0x391e ; mc_bemfobserv_PLL + 374
        0x00003912:    4a5b        [J      LDR      r2,[pc,#364] ; [0x3a80] = 0x20000f4c
        0x00003914:    6812        .h      LDR      r2,[r2,#0]
        0x00003916:    4b5b        [K      LDR      r3,[pc,#364] ; [0x3a84] = 0x200002a8
        0x00003918:    81da        ..      STRH     r2,[r3,#0xe]
        0x0000391a:    1c40        @.      ADDS     r0,r0,#1
        0x0000391c:    6008        .`      STR      r0,[r1,#0]
        0x0000391e:    4625        %F      MOV      r5,r4
        0x00003920:    3540        @5      ADDS     r5,r5,#0x40
        0x00003922:    89e8        ..      LDRH     r0,[r5,#0xe]
        0x00003924:    0980        ..      LSRS     r0,r0,#6
        0x00003926:    2103        .!      MOVS     r1,#3
        0x00003928:    0209        ..      LSLS     r1,r1,#8
        0x0000392a:    4001        .@      ANDS     r1,r1,r0
        0x0000392c:    4a56        VJ      LDR      r2,[pc,#344] ; [0x3a88] = 0x3bd0
        0x0000392e:    23ff        .#      MOVS     r3,#0xff
        0x00003930:    2900        .)      CMP      r1,#0
        0x00003932:    d009        ..      BEQ      0x3948 ; mc_bemfobserv_PLL + 416
        0x00003934:    39ff        .9      SUBS     r1,r1,#0xff
        0x00003936:    3901        .9      SUBS     r1,#1
        0x00003938:    d00f        ..      BEQ      0x395a ; mc_bemfobserv_PLL + 434
        0x0000393a:    39ff        .9      SUBS     r1,r1,#0xff
        0x0000393c:    3901        .9      SUBS     r1,#1
        0x0000393e:    d016        ..      BEQ      0x396e ; mc_bemfobserv_PLL + 454
        0x00003940:    39ff        .9      SUBS     r1,r1,#0xff
        0x00003942:    3901        .9      SUBS     r1,#1
        0x00003944:    d127        '.      BNE      0x3996 ; mc_bemfobserv_PLL + 494
        0x00003946:    e01d        ..      B        0x3984 ; mc_bemfobserv_PLL + 476
        0x00003948:    b2c0        ..      UXTB     r0,r0
        0x0000394a:    0041        A.      LSLS     r1,r0,#1
        0x0000394c:    5a51        QZ      LDRH     r1,[r2,r1]
        0x0000394e:    82a1        ..      STRH     r1,[r4,#0x14]
        0x00003950:    1a18        ..      SUBS     r0,r3,r0
        0x00003952:    0040        @.      LSLS     r0,r0,#1
        0x00003954:    5a10        .Z      LDRH     r0,[r2,r0]
        0x00003956:    82e0        ..      STRH     r0,[r4,#0x16]
        0x00003958:    e01d        ..      B        0x3996 ; mc_bemfobserv_PLL + 494
        0x0000395a:    b2c0        ..      UXTB     r0,r0
        0x0000395c:    1a19        ..      SUBS     r1,r3,r0
        0x0000395e:    0049        I.      LSLS     r1,r1,#1
        0x00003960:    5a51        QZ      LDRH     r1,[r2,r1]
        0x00003962:    82a1        ..      STRH     r1,[r4,#0x14]
        0x00003964:    0040        @.      LSLS     r0,r0,#1
        0x00003966:    5a10        .Z      LDRH     r0,[r2,r0]
        0x00003968:    4240        @B      RSBS     r0,r0,#0
        0x0000396a:    82e0        ..      STRH     r0,[r4,#0x16]
        0x0000396c:    e013        ..      B        0x3996 ; mc_bemfobserv_PLL + 494
        0x0000396e:    b2c0        ..      UXTB     r0,r0
        0x00003970:    0041        A.      LSLS     r1,r0,#1
        0x00003972:    5a51        QZ      LDRH     r1,[r2,r1]
        0x00003974:    4249        IB      RSBS     r1,r1,#0
        0x00003976:    82a1        ..      STRH     r1,[r4,#0x14]
        0x00003978:    1a18        ..      SUBS     r0,r3,r0
        0x0000397a:    0040        @.      LSLS     r0,r0,#1
        0x0000397c:    5a10        .Z      LDRH     r0,[r2,r0]
        0x0000397e:    4240        @B      RSBS     r0,r0,#0
        0x00003980:    82e0        ..      STRH     r0,[r4,#0x16]
        0x00003982:    e008        ..      B        0x3996 ; mc_bemfobserv_PLL + 494
        0x00003984:    b2c0        ..      UXTB     r0,r0
        0x00003986:    1a19        ..      SUBS     r1,r3,r0
        0x00003988:    0049        I.      LSLS     r1,r1,#1
        0x0000398a:    5a51        QZ      LDRH     r1,[r2,r1]
        0x0000398c:    4249        IB      RSBS     r1,r1,#0
        0x0000398e:    82a1        ..      STRH     r1,[r4,#0x14]
        0x00003990:    0040        @.      LSLS     r0,r0,#1
        0x00003992:    5a10        .Z      LDRH     r0,[r2,r0]
        0x00003994:    82e0        ..      STRH     r0,[r4,#0x16]
        0x00003996:    200a        .       MOVS     r0,#0xa
        0x00003998:    2116        .!      MOVS     r1,#0x16
        0x0000399a:    5e20         ^      LDRSH    r0,[r4,r0]
        0x0000399c:    5e61        a^      LDRSH    r1,[r4,r1]
        0x0000399e:    2214        ."      MOVS     r2,#0x14
        0x000039a0:    4348        HC      MULS     r0,r1,r0
        0x000039a2:    2118        .!      MOVS     r1,#0x18
        0x000039a4:    5e61        a^      LDRSH    r1,[r4,r1]
        0x000039a6:    5ea2        .^      LDRSH    r2,[r4,r2]
        0x000039a8:    4351        QC      MULS     r1,r2,r1
        0x000039aa:    1840        @.      ADDS     r0,r0,r1
        0x000039ac:    4240        @B      RSBS     r0,r0,#0
        0x000039ae:    11c1        ..      ASRS     r1,r0,#7
        0x000039b0:    9100        ..      STR      r1,[sp,#0]
        0x000039b2:    2608        .&      MOVS     r6,#8
        0x000039b4:    5fae        ._      LDRSH    r6,[r5,r6]
        0x000039b6:    6be0        .k      LDR      r0,[r4,#0x3c]
        0x000039b8:    9900        ..      LDR      r1,[sp,#0]
        0x000039ba:    f7fffe56    ..V.    BL       __ARM_common_ll_mulss ; 0x366a
        0x000039be:    1876        v.      ADDS     r6,r6,r1
        0x000039c0:    482c        ,H      LDR      r0,[pc,#176] ; [0x3a74] = 0x7fff
        0x000039c2:    4286        .B      CMP      r6,r0
        0x000039c4:    dd01        ..      BLE      0x39ca ; mc_bemfobserv_PLL + 546
        0x000039c6:    4606        .F      MOV      r6,r0
        0x000039c8:    e003        ..      B        0x39d2 ; mc_bemfobserv_PLL + 554
        0x000039ca:    482b        +H      LDR      r0,[pc,#172] ; [0x3a78] = 0xffff8001
        0x000039cc:    4286        .B      CMP      r6,r0
        0x000039ce:    da00        ..      BGE      0x39d2 ; mc_bemfobserv_PLL + 554
        0x000039d0:    4606        .F      MOV      r6,r0
        0x000039d2:    2708        .'      MOVS     r7,#8
        0x000039d4:    5fef        ._      LDRSH    r7,[r5,r7]
        0x000039d6:    6c60        `l      LDR      r0,[r4,#0x44]
        0x000039d8:    9900        ..      LDR      r1,[sp,#0]
        0x000039da:    f7fffe46    ..F.    BL       __ARM_common_ll_mulss ; 0x366a
        0x000039de:    1878        x.      ADDS     r0,r7,r1
        0x000039e0:    4924        $I      LDR      r1,[pc,#144] ; [0x3a74] = 0x7fff
        0x000039e2:    4288        .B      CMP      r0,r1
        0x000039e4:    dd01        ..      BLE      0x39ea ; mc_bemfobserv_PLL + 578
        0x000039e6:    8129        ).      STRH     r1,[r5,#8]
        0x000039e8:    e005        ..      B        0x39f6 ; mc_bemfobserv_PLL + 590
        0x000039ea:    4923        #I      LDR      r1,[pc,#140] ; [0x3a78] = 0xffff8001
        0x000039ec:    4288        .B      CMP      r0,r1
        0x000039ee:    da01        ..      BGE      0x39f4 ; mc_bemfobserv_PLL + 588
        0x000039f0:    8129        ).      STRH     r1,[r5,#8]
        0x000039f2:    e000        ..      B        0x39f6 ; mc_bemfobserv_PLL + 590
        0x000039f4:    8128        (.      STRH     r0,[r5,#8]
        0x000039f6:    2030        0       MOVS     r0,#0x30
        0x000039f8:    5e28        (^      LDRSH    r0,[r5,r0]
        0x000039fa:    2100        .!      MOVS     r1,#0
        0x000039fc:    42b0        .B      CMP      r0,r6
        0x000039fe:    dd01        ..      BLE      0x3a04 ; mc_bemfobserv_PLL + 604
        0x00003a00:    6461        ad      STR      r1,[r4,#0x44]
        0x00003a02:    e001        ..      B        0x3a08 ; mc_bemfobserv_PLL + 608
        0x00003a04:    6c20         l      LDR      r0,[r4,#0x40]
        0x00003a06:    6460        `d      STR      r0,[r4,#0x44]
        0x00003a08:    4620         F      MOV      r0,r4
        0x00003a0a:    3060        `0      ADDS     r0,r0,#0x60
        0x00003a0c:    7c82        .|      LDRB     r2,[r0,#0x12]
        0x00003a0e:    2a01        .*      CMP      r2,#1
        0x00003a10:    d100        ..      BNE      0x3a14 ; mc_bemfobserv_PLL + 620
        0x00003a12:    8129        ).      STRH     r1,[r5,#8]
        0x00003a14:    7a80        .z      LDRB     r0,[r0,#0xa]
        0x00003a16:    2801        .(      CMP      r0,#1
        0x00003a18:    d10e        ..      BNE      0x3a38 ; mc_bemfobserv_PLL + 656
        0x00003a1a:    2028        (       MOVS     r0,#0x28
        0x00003a1c:    5e28        (^      LDRSH    r0,[r5,r0]
        0x00003a1e:    42b0        .B      CMP      r0,r6
        0x00003a20:    db0a        ..      BLT      0x3a38 ; mc_bemfobserv_PLL + 656
        0x00003a22:    211c        .!      MOVS     r1,#0x1c
        0x00003a24:    5e69        i^      LDRSH    r1,[r5,r1]
        0x00003a26:    6da0        .m      LDR      r0,[r4,#0x58]
        0x00003a28:    1840        @.      ADDS     r0,r0,r1
        0x00003a2a:    65a0        .e      STR      r0,[r4,#0x58]
        0x00003a2c:    6e61        an      LDR      r1,[r4,#0x64]
        0x00003a2e:    4281        .B      CMP      r1,r0
        0x00003a30:    da00        ..      BGE      0x3a34 ; mc_bemfobserv_PLL + 652
        0x00003a32:    65a1        .e      STR      r1,[r4,#0x58]
        0x00003a34:    6da0        .m      LDR      r0,[r4,#0x58]
        0x00003a36:    1246        F.      ASRS     r6,r0,#9
        0x00003a38:    200a        .       MOVS     r0,#0xa
        0x00003a3a:    5e28        (^      LDRSH    r0,[r5,r0]
        0x00003a3c:    2214        ."      MOVS     r2,#0x14
        0x00003a3e:    5eaa        .^      LDRSH    r2,[r5,r2]
        0x00003a40:    1a31        1.      SUBS     r1,r6,r0
        0x00003a42:    4351        QC      MULS     r1,r2,r1
        0x00003a44:    13c9        ..      ASRS     r1,r1,#15
        0x00003a46:    1808        ..      ADDS     r0,r1,r0
        0x00003a48:    8168        h.      STRH     r0,[r5,#0xa]
        0x00003a4a:    2016        .       MOVS     r0,#0x16
        0x00003a4c:    5e28        (^      LDRSH    r0,[r5,r0]
        0x00003a4e:    89e9        ..      LDRH     r1,[r5,#0xe]
        0x00003a50:    4370        pC      MULS     r0,r6,r0
        0x00003a52:    1380        ..      ASRS     r0,r0,#14
        0x00003a54:    1808        ..      ADDS     r0,r1,r0
        0x00003a56:    81e8        ..      STRH     r0,[r5,#0xe]
        0x00003a58:    8a29        ).      LDRH     r1,[r5,#0x10]
        0x00003a5a:    1840        @.      ADDS     r0,r0,r1
        0x00003a5c:    81a8        ..      STRH     r0,[r5,#0xc]
        0x00003a5e:    2018        .       MOVS     r0,#0x18
        0x00003a60:    5e20         ^      LDRSH    r0,[r4,r0]
        0x00003a62:    4340        @C      MULS     r0,r0,r0
        0x00003a64:    13c1        ..      ASRS     r1,r0,#15
        0x00003a66:    200a        .       MOVS     r0,#0xa
        0x00003a68:    5e20         ^      LDRSH    r0,[r4,r0]
        0x00003a6a:    4340        @C      MULS     r0,r0,r0
        0x00003a6c:    13c0        ..      ASRS     r0,r0,#15
        0x00003a6e:    1808        ..      ADDS     r0,r1,r0
        0x00003a70:    66e0        .f      STR      r0,[r4,#0x6c]
        0x00003a72:    bdf8        ..      POP      {r3-r7,pc}
    $d
        0x00003a74:    00007fff    ....    DCD    32767
        0x00003a78:    ffff8001    ....    DCD    4294934529
        0x00003a7c:    20000038    8..     DCD    536870968
        0x00003a80:    20000f4c    L..     DCD    536874828
        0x00003a84:    200002a8    ...     DCD    536871592
        0x00003a88:    00003bd0    .;..    DCD    15312
    $t
    i.mc_bemfobservinit_PLL
    mc_bemfobservinit_PLL
        0x00003a8c:    4919        .I      LDR      r1,[pc,#100] ; [0x3af4] = 0x20000268
        0x00003a8e:    4818        .H      LDR      r0,[pc,#96] ; [0x3af0] = 0x762b
        0x00003a90:    8008        ..      STRH     r0,[r1,#0]
        0x00003a92:    4819        .H      LDR      r0,[pc,#100] ; [0x3af8] = 0x13bc
        0x00003a94:    8048        H.      STRH     r0,[r1,#2]
        0x00003a96:    4819        .H      LDR      r0,[pc,#100] ; [0x3afc] = 0x102c
        0x00003a98:    8088        ..      STRH     r0,[r1,#4]
        0x00003a9a:    2200        ."      MOVS     r2,#0
        0x00003a9c:    80ca        ..      STRH     r2,[r1,#6]
        0x00003a9e:    23c1        .#      MOVS     r3,#0xc1
        0x00003aa0:    810b        ..      STRH     r3,[r1,#8]
        0x00003aa2:    4817        .H      LDR      r0,[pc,#92] ; [0x3b00] = 0x1803010
        0x00003aa4:    6308        .c      STR      r0,[r1,#0x30]
        0x00003aa6:    4817        .H      LDR      r0,[pc,#92] ; [0x3b04] = 0x3b18d0
        0x00003aa8:    6348        Hc      STR      r0,[r1,#0x34]
        0x00003aaa:    814a        J.      STRH     r2,[r1,#0xa]
        0x00003aac:    818a        ..      STRH     r2,[r1,#0xc]
        0x00003aae:    81ca        ..      STRH     r2,[r1,#0xe]
        0x00003ab0:    610a        .a      STR      r2,[r1,#0x10]
        0x00003ab2:    830a        ..      STRH     r2,[r1,#0x18]
        0x00003ab4:    834a        J.      STRH     r2,[r1,#0x1a]
        0x00003ab6:    840a        ..      STRH     r2,[r1,#0x20]
        0x00003ab8:    61ca        .a      STR      r2,[r1,#0x1c]
        0x00003aba:    4813        .H      LDR      r0,[pc,#76] ; [0x3b08] = 0x19a2a92
        0x00003abc:    63c8        .c      STR      r0,[r1,#0x3c]
