747lulu747/SAOZHAN_BRUASH/src/SDK-LIB/华芯第一版本硬件-非FPC/ROMAN-21DD - SDK - V0.1/out/SWM211.asm
        0x00003abe:    4813        .H      LDR      r0,[pc,#76] ; [0x3b0c] = 0x12187
        0x00003ac0:    6408        .d      STR      r0,[r1,#0x40]
        0x00003ac2:    870a        ..      STRH     r2,[r1,#0x38]
        0x00003ac4:    874a        J.      STRH     r2,[r1,#0x3a]
        0x00003ac6:    4812        .H      LDR      r0,[pc,#72] ; [0x3b10] = 0x200002a8
        0x00003ac8:    8102        ..      STRH     r2,[r0,#8]
        0x00003aca:    8142        B.      STRH     r2,[r0,#0xa]
        0x00003acc:    8182        ..      STRH     r2,[r0,#0xc]
        0x00003ace:    81c2        ..      STRH     r2,[r0,#0xe]
        0x00003ad0:    8202        ..      STRH     r2,[r0,#0x10]
        0x00003ad2:    8283        ..      STRH     r3,[r0,#0x14]
        0x00003ad4:    4b0f        .K      LDR      r3,[pc,#60] ; [0x3b14] = 0x3ff
        0x00003ad6:    82c3        ..      STRH     r3,[r0,#0x16]
        0x00003ad8:    658a        .e      STR      r2,[r1,#0x58]
        0x00003ada:    2323        ##      MOVS     r3,#0x23
        0x00003adc:    8383        ..      STRH     r3,[r0,#0x1c]
        0x00003ade:    236d        m#      MOVS     r3,#0x6d
        0x00003ae0:    8503        ..      STRH     r3,[r0,#0x28]
        0x00003ae2:    4b0d        .K      LDR      r3,[pc,#52] ; [0x3b18] = 0xda74
        0x00003ae4:    664b        Kf      STR      r3,[r1,#0x64]
        0x00003ae6:    2188        .!      MOVS     r1,#0x88
        0x00003ae8:    8601        ..      STRH     r1,[r0,#0x30]
        0x00003aea:    480c        .H      LDR      r0,[pc,#48] ; [0x3b1c] = 0x200002c8
        0x00003aec:    7282        .r      STRB     r2,[r0,#0xa]
        0x00003aee:    4770        pG      BX       lr
    $d
        0x00003af0:    0000762b    +v..    DCD    30251
        0x00003af4:    20000268    h..     DCD    536871528
        0x00003af8:    000013bc    ....    DCD    5052
        0x00003afc:    0000102c    ,...    DCD    4140
        0x00003b00:    01803010    .0..    DCD    25178128
        0x00003b04:    003b18d0    ..;.    DCD    3872976
        0x00003b08:    019a2a92    .*..    DCD    26880658
        0x00003b0c:    00012187    .!..    DCD    74119
        0x00003b10:    200002a8    ...     DCD    536871592
        0x00003b14:    000003ff    ....    DCD    1023
        0x00003b18:    0000da74    t...    DCD    55924
        0x00003b1c:    200002c8    ...     DCD    536871624
    $t
    i.mc_ramp
    mc_ramp
        0x00003b20:    8941        A.      LDRH     r1,[r0,#0xa]
        0x00003b22:    1e49        I.      SUBS     r1,r1,#1
        0x00003b24:    b209        ..      SXTH     r1,r1
        0x00003b26:    8141        A.      STRH     r1,[r0,#0xa]
        0x00003b28:    2900        .)      CMP      r1,#0
        0x00003b2a:    da0b        ..      BGE      0x3b44 ; mc_ramp + 36
        0x00003b2c:    8981        ..      LDRH     r1,[r0,#0xc]
        0x00003b2e:    8141        A.      STRH     r1,[r0,#0xa]
        0x00003b30:    4911        .I      LDR      r1,[pc,#68] ; [0x3b78] = 0x200000a4
        0x00003b32:    7e09        .~      LDRB     r1,[r1,#0x18]
        0x00003b34:    2900        .)      CMP      r1,#0
        0x00003b36:    d006        ..      BEQ      0x3b46 ; mc_ramp + 38
        0x00003b38:    2104        .!      MOVS     r1,#4
        0x00003b3a:    5e41        A^      LDRSH    r1,[r0,r1]
        0x00003b3c:    291e        .)      CMP      r1,#0x1e
        0x00003b3e:    dd02        ..      BLE      0x3b46 ; mc_ramp + 38
        0x00003b40:    391e        .9      SUBS     r1,r1,#0x1e
        0x00003b42:    8081        ..      STRH     r1,[r0,#4]
        0x00003b44:    4770        pG      BX       lr
        0x00003b46:    2204        ."      MOVS     r2,#4
        0x00003b48:    2100        .!      MOVS     r1,#0
        0x00003b4a:    5e82        .^      LDRSH    r2,[r0,r2]
        0x00003b4c:    5e41        A^      LDRSH    r1,[r0,r1]
        0x00003b4e:    428a        .B      CMP      r2,r1
        0x00003b50:    da08        ..      BGE      0x3b64 ; mc_ramp + 68
        0x00003b52:    2306        .#      MOVS     r3,#6
        0x00003b54:    5ec3        .^      LDRSH    r3,[r0,r3]
        0x00003b56:    18d2        ..      ADDS     r2,r2,r3
        0x00003b58:    428a        .B      CMP      r2,r1
        0x00003b5a:    da01        ..      BGE      0x3b60 ; mc_ramp + 64
        0x00003b5c:    8082        ..      STRH     r2,[r0,#4]
        0x00003b5e:    4770        pG      BX       lr
        0x00003b60:    8081        ..      STRH     r1,[r0,#4]
        0x00003b62:    4770        pG      BX       lr
        0x00003b64:    2308        .#      MOVS     r3,#8
        0x00003b66:    5ec3        .^      LDRSH    r3,[r0,r3]
        0x00003b68:    1ad2        ..      SUBS     r2,r2,r3
        0x00003b6a:    428a        .B      CMP      r2,r1
        0x00003b6c:    dd01        ..      BLE      0x3b72 ; mc_ramp + 82
        0x00003b6e:    8082        ..      STRH     r2,[r0,#4]
        0x00003b70:    4770        pG      BX       lr
        0x00003b72:    8081        ..      STRH     r1,[r0,#4]
        0x00003b74:    4770        pG      BX       lr
    $d
        0x00003b76:    0000        ..      DCW    0
        0x00003b78:    200000a4    ...     DCD    536871076
    $t
    i.switchTo12MHz
    switchTo12MHz
        0x00003b7c:    4903        .I      LDR      r1,[pc,#12] ; [0x3b8c] = 0x400aa000
        0x00003b7e:    2001        .       MOVS     r0,#1
        0x00003b80:    6008        .`      STR      r0,[r1,#0]
        0x00003b82:    0781        ..      LSLS     r1,r0,#30
        0x00003b84:    680a        .h      LDR      r2,[r1,#0]
        0x00003b86:    4302        .C      ORRS     r2,r2,r0
        0x00003b88:    600a        .`      STR      r2,[r1,#0]
        0x00003b8a:    4770        pG      BX       lr
    $d
        0x00003b8c:    400aa000    ...@    DCD    1074438144
    $t
    i.switchToPLL
    switchToPLL
        0x00003b90:    b510        ..      PUSH     {r4,lr}
        0x00003b92:    4604        .F      MOV      r4,r0
        0x00003b94:    f7fffff2    ....    BL       switchTo12MHz ; 0x3b7c
        0x00003b98:    f7fefcf4    ....    BL       PLLInit ; 0x2584
        0x00003b9c:    2001        .       MOVS     r0,#1
        0x00003b9e:    0781        ..      LSLS     r1,r0,#30
        0x00003ba0:    6048        H`      STR      r0,[r1,#4]
        0x00003ba2:    6808        .h      LDR      r0,[r1,#0]
        0x00003ba4:    221c        ."      MOVS     r2,#0x1c
        0x00003ba6:    4390        .C      BICS     r0,r0,r2
        0x00003ba8:    6008        .`      STR      r0,[r1,#0]
        0x00003baa:    6808        .h      LDR      r0,[r1,#0]
        0x00003bac:    2204        ."      MOVS     r2,#4
        0x00003bae:    4310        .C      ORRS     r0,r0,r2
        0x00003bb0:    6008        .`      STR      r0,[r1,#0]
        0x00003bb2:    2202        ."      MOVS     r2,#2
        0x00003bb4:    2c00        .,      CMP      r4,#0
        0x00003bb6:    d003        ..      BEQ      0x3bc0 ; switchToPLL + 48
        0x00003bb8:    6808        .h      LDR      r0,[r1,#0]
        0x00003bba:    4310        .C      ORRS     r0,r0,r2
        0x00003bbc:    6008        .`      STR      r0,[r1,#0]
        0x00003bbe:    e002        ..      B        0x3bc6 ; switchToPLL + 54
        0x00003bc0:    6808        .h      LDR      r0,[r1,#0]
        0x00003bc2:    4390        .C      BICS     r0,r0,r2
        0x00003bc4:    6008        .`      STR      r0,[r1,#0]
        0x00003bc6:    6808        .h      LDR      r0,[r1,#0]
        0x00003bc8:    0840        @.      LSRS     r0,r0,#1
        0x00003bca:    0040        @.      LSLS     r0,r0,#1
        0x00003bcc:    6008        .`      STR      r0,[r1,#0]
        0x00003bce:    bd10        ..      POP      {r4,pc}
    $d.realdata
    .constdata
    SinCos_Table
        0x00003bd0:    00c90000    ....    DCD    13172736
        0x00003bd4:    025b0192    ..[.    DCD    39518610
        0x00003bd8:    03ed0324    $...    DCD    65864484
        0x00003bdc:    057f04b6    ....    DCD    92210358
        0x00003be0:    07110648    H...    DCD    118556232
        0x00003be4:    08a207d9    ....    DCD    144836569
        0x00003be8:    0a33096a    j.3.    DCD    171116906
        0x00003bec:    0bc40afb    ....    DCD    197397243
        0x00003bf0:    0d540c8c    ..T.    DCD    223612044
        0x00003bf4:    0ee30e1c    ....    DCD    249761308
        0x00003bf8:    10720fab    ..r.    DCD    275910571
        0x00003bfc:    1201113a    :...    DCD    302059834
        0x00003c00:    138f12c8    ....    DCD    328143560
        0x00003c04:    151c1455    U...    DCD    354161749
        0x00003c08:    16a815e2    ....    DCD    380114402
        0x00003c0c:    1833176e    n.3.    DCD    406001518
        0x00003c10:    19be18f9    ....    DCD    431888633
        0x00003c14:    1b471a82    ..G.    DCD    457644674
        0x00003c18:    1ccf1c0b    ....    DCD    483335179
        0x00003c1c:    1e571d93    ..W.    DCD    509025683
        0x00003c20:    1fdd1f1a    ....    DCD    534585114
        0x00003c24:    2161209f    . a!    DCD    560013471
        0x00003c28:    22e52223    #"."    DCD    585441827
        0x00003c2c:    246723a6    .#g$    DCD    610739110
        0x00003c30:    25e82528    (%.%    DCD    635970856
        0x00003c34:    276726a8    .&g'    DCD    661071528
        0x00003c38:    28e52826    &(.(    DCD    686106662
        0x00003c3c:    2a6129a3    .)a*    DCD    711010723
        0x00003c40:    2bdc2b1f    .+.+    DCD    735849247
        0x00003c44:    2d552c99    .,U-    DCD    760556697
        0x00003c48:    2ecc2e11    ....    DCD    785133073
        0x00003c4c:    30412f87    ./A0    DCD    809578375
        0x00003c50:    31b530fb    .0.1    DCD    833958139
        0x00003c54:    3326326e    n2&3    DCD    858141294
        0x00003c58:    349633df    .3.4    DCD    882258911
        0x00003c5c:    3604354d    M5.6    DCD    906245453
        0x00003c60:    376f36ba    .6o7    DCD    930035386
        0x00003c64:    38d93824    $8.8    DCD    953759780
        0x00003c68:    3a40398c    .9@:    DCD    977287564
        0x00003c6c:    3ba53af2    .:.;    DCD    1000684274
        0x00003c70:    3d073c56    V<.=    DCD    1023884374
        0x00003c74:    3e683db8    .=h>    DCD    1047018936
        0x00003c78:    3fc53f17    .?.?    DCD    1069891351
        0x00003c7c:    41214073    s@!A    DCD    1092698227
        0x00003c80:    427a41ce    .AzB    DCD    1115308494
        0x00003c84:    43d04325    %C.C    DCD    1137722149
        0x00003c88:    4524447a    zD$E    DCD    1160004730
        0x00003c8c:    467545cd    .EuF    DCD    1182090701
        0x00003c90:    47c3471c    .G.G    DCD    1203980060
        0x00003c94:    490f4869    iH.I    DCD    1225738345
        0x00003c98:    4a5849b4    .IXJ    DCD    1247300020
        0x00003c9c:    4b9d4afb    .J.K    DCD    1268599547
        0x00003ca0:    4ce04c3f    ?L.L    DCD    1289767999
        0x00003ca4:    4e204d81    .M N    DCD    1310739841
        0x00003ca8:    4f5d4ebf    .N]O    DCD    1331515071
        0x00003cac:    50974ffb    .O.P    DCD    1352093691
        0x00003cb0:    51ce5133    3Q.Q    DCD    1372475699
        0x00003cb4:    53025268    hR.S    DCD    1392661096
        0x00003cb8:    5432539b    .S2T    DCD    1412584347
        0x00003cbc:    556054c9    .T`U    DCD    1432376521
        0x00003cc0:    568a55f5    .U.V    DCD    1451906549
        0x00003cc4:    57b0571d    .W.W    DCD    1471174429
        0x00003cc8:    58d35842    BX.X    DCD    1490245698
        0x00003ccc:    59f35964    dY.Y    DCD    1509120356
        0x00003cd0:    5b0f5a82    .Z.[    DCD    1527732866
        0x00003cd4:    5c285b9c    .[(\    DCD    1546148764
        0x00003cd8:    5d3e5cb3    .\>]    DCD    1564368051
        0x00003cdc:    5e4f5dc7    .]O^    DCD    1582259655
        0x00003ce0:    5f5d5ed7    .^]_    DCD    1599954647
        0x00003ce4:    60685fe3    ._h`    DCD    1617453027
        0x00003ce8:    616e60eb    .`na    DCD    1634623723
        0x00003cec:    627161f0    .aqb    DCD    1651597808
        0x00003cf0:    637062f1    .bpc    DCD    1668309745
        0x00003cf4:    646c63ee    .cld    DCD    1684825070
        0x00003cf8:    656364e8    .dce    DCD    1701012712
        0x00003cfc:    665665dd    .eVf    DCD    1716938205
        0x00003d00:    674666cf    .fFg    DCD    1732667087
        0x00003d04:    683267bc    .g2h    DCD    1748133820
        0x00003d08:    691968a6    .h.i    DCD    1763272870
        0x00003d0c:    69fd698b    .i.i    DCD    1778215307
        0x00003d10:    6adc6a6d    mj.j    DCD    1792830061
        0x00003d14:    6bb76b4a    Jk.k    DCD    1807182666
        0x00003d18:    6c8e6c23    #l.l    DCD    1821273123
        0x00003d1c:    6d616cf8    .lam    DCD    1835101432
        0x00003d20:    6e306dc9    .m0n    DCD    1848667593
        0x00003d24:    6efb6e96    .n.n    DCD    1861971606
        0x00003d28:    6fc16f5e    ^o.o    DCD    1874947934
        0x00003d2c:    70837022    "p.p    DCD    1887662114
        0x00003d30:    714070e2    .p@q    DCD    1900048610
        0x00003d34:    71f9719d    .q.q    DCD    1912172957
        0x00003d38:    72ae7254    Tr.r    DCD    1924035156
        0x00003d3c:    735e7307    .s^s    DCD    1935569671
        0x00003d40:    740a73b5    .s.t    DCD    1946842037
        0x00003d44:    74b2745f    _t.t    DCD    1957852255
        0x00003d48:    75557504    .uUu    DCD    1968534788
        0x00003d4c:    75f375a5    .u.u    DCD    1978889637
        0x00003d50:    768d7641    Av.v    DCD    1988982337
        0x00003d54:    772276d8    .v"w    DCD    1998747352
        0x00003d58:    77b3776b    kw.w    DCD    2008250219
        0x00003d5c:    783f77fa    .w?x    DCD    2017425402
        0x00003d60:    78c77884    .x.x    DCD    2026338436
        0x00003d64:    794a7909    .yJy    DCD    2034923785
        0x00003d68:    79c87989    .y.y    DCD    2043181449
        0x00003d6c:    7a417a05    .zAz    DCD    2051111429
        0x00003d70:    7ab67a7c    |z.z    DCD    2058779260
        0x00003d74:    7b267aee    .z&{    DCD    2066119406
        0x00003d78:    7b917b5c    \{.{    DCD    2073131868
        0x00003d7c:    7bf87bc5    .{.{    DCD    2079882181
        0x00003d80:    7c597c29    )|Y|    DCD    2086239273
        0x00003d84:    7cb67c88    .|.|    DCD    2092334216
        0x00003d88:    7d0e7ce3    .|.}    DCD    2098101475
        0x00003d8c:    7d627d39    9}b}    DCD    2103606585
        0x00003d90:    7db07d89    .}.}    DCD    2108718473
        0x00003d94:    7dfa7dd5    .}.}    DCD    2113568213
        0x00003d98:    7e3e7e1d    .~>~    DCD    2118024733
        0x00003d9c:    7e7e7e5f    _~~~    DCD    2122219103
        0x00003da0:    7eb97e9c    .~.~    DCD    2126085788
        0x00003da4:    7eef7ed5    .~.~    DCD    2129624789
        0x00003da8:    7f217f09    ..!.    DCD    2132901641
        0x00003dac:    7f4d7f37    7.M.    DCD    2135785271
        0x00003db0:    7f747f61    a.t.    DCD    2138341217
        0x00003db4:    7f977f86    ....    DCD    2140635014
        0x00003db8:    7fb47fa6    ....    DCD    2142535590
        0x00003dbc:    7fcd7fc1    ....    DCD    2144174017
        0x00003dc0:    7fe17fd8    ....    DCD    2145484760
        0x00003dc4:    7ff07fe9    ....    DCD    2146467817
        0x00003dc8:    7ff97ff5    ....    DCD    2147057653
        0x00003dcc:    7ffe7ffd    ....    DCD    2147385341
    Region$$Table$$Base
        0x00003dd0:    00003df0    .=..    DCD    15856
        0x00003dd4:    20000000    ...     DCD    536870912
        0x00003dd8:    00000064    d...    DCD    100
        0x00003ddc:    0000369c    .6..    DCD    13980
        0x00003de0:    00003e54    T>..    DCD    15956
        0x00003de4:    20000064    d..     DCD    536871012
        0x00003de8:    00001364    d...    DCD    4964
        0x00003dec:    000036ac    .6..    DCD    13996
    Region$$Table$$Limit

** Section #2 'RW_IRAM1' (SHT_PROGBITS) [SHF_ALLOC + SHF_WRITE]
    Size   : 100 bytes (alignment 4)
    Address: 0x20000000


** Section #3 'RW_IRAM1' (SHT_NOBITS) [SHF_ALLOC + SHF_WRITE]
    Size   : 4964 bytes (alignment 8)
    Address: 0x20000064


** Section #4 '.debug_abbrev' (SHT_PROGBITS)
    Size   : 1476 bytes


