747lulu747/SAOZHAN_BRUASH/src/SDK-LIB/华芯第一版本硬件-非FPC/ROMAN-21DD - SDK - V0.1/out/SWM211.asm
** Section #5 '.debug_frame' (SHT_PROGBITS)
    Size   : 4536 bytes


** Section #6 '.debug_info' (SHT_PROGBITS)
    Size   : 65048 bytes


** Section #7 '.debug_line' (SHT_PROGBITS)
    Size   : 24300 bytes


** Section #8 '.debug_loc' (SHT_PROGBITS)
    Size   : 7592 bytes


** Section #9 '.debug_macinfo' (SHT_PROGBITS)
    Size   : 74584 bytes


** Section #10 '.debug_pubnames' (SHT_PROGBITS)
    Size   : 6073 bytes


** Section #11 '.symtab' (SHT_SYMTAB)
    Size   : 11456 bytes (alignment 4)
    String table #12 '.strtab'
    Last local symbol no. 474


** Section #12 '.strtab' (SHT_STRTAB)
    Size   : 9316 bytes


** Section #13 '.note' (SHT_NOTE)
    Size   : 28 bytes (alignment 4)


** Section #14 '.comment' (SHT_PROGBITS)
    Size   : 53356 bytes


** Section #15 '.shstrtab' (SHT_STRTAB)
    Size   : 156 bytes


address     size       variable name                            type
0x20000060  0x4        CyclesPerUs                              uint32_t

address     size       variable name                            type
0x2000005c  0x4        SystemCoreClock                          uint32_t

address     size       variable name                            type
0x20000054  0x4        IAP_Flash_Erase                          IAP_Flash_Erase_t

address     size       variable name                            type
0x20000050  0x4        IAP_Flash_Param                          IAP_Flash_Param_t

address     size       variable name                            type
0x20000058  0x4        IAP_Flash_Write                          IAP_Flash_Write_t

address     size       variable name                            type
0x20000044  0x4        ADC3V6                                   uint32_t

address     size       variable name                            type
0x20000048  0x4        ADC3V6_K                                 uint32_t

address     size       variable name                            type
0x2000004c  0x4        ADC3V6_Offset                            uint32_t

address     size       variable name                            type
0x20000040  0x4        Debug_DAC2V                              uint32

address     size       variable name                            type
0x2000003c  0x2        Debug_DAC_Offset                         int16

address     size       variable name                            type
0x00000000  0x4        Angle_Num                                int

address     size       variable name                            type
0x00000000  0x4        Angle_Num1                               int

address     size       variable name                            type
0x00000000  0x4        Angle_Num2                               int

address     size       variable name                            type
0x00000000  0x4        Angle_Num3                               int

address     size       variable name                            type
0x00000000  0x4        Asunm1                                   int

address     size       variable name                            type
0x00000000  0x4        Asunm2                                   int

address     size       variable name                            type
0x00000000  0x4        Asunm3                                   int

address     size       variable name                            type
0x00000000  0x4        Asunm4                                   int

address     size       variable name                            type
0x00000000  0x4        Asunm5                                   int

address     size       variable name                            type
0x00000000  0x4        Asunm6                                   int

address     size       variable name                            type
0x20000f4c  0x78       RIPDParam                                RIPD_SystParam
0x20000f4c  0x4        RIPDParam.Angle_Dete                     volatile int32_t
0x20000f50  0x2      * RIPDParam.Sector                         volatile int16_t
0x20000f54  0x4        RIPDParam.Angle_num                      volatile int
0x20000f58  0x4        RIPDParam.Dete_Do_Fg                     volatile int
0x20000f5c  0x4        RIPDParam.DeteFailFg                     volatile int
0x20000f60  0x4        RIPDParam.Out_Sector_num                 volatile int
0x20000f64  0x4        RIPDParam.IN_Puls_Num                    volatile uint32_t
0x20000f68  0x4        RIPDParam.IN_Puls_Num1                   volatile uint32_t
0x20000f6c  0x4        RIPDParam.IN_Puls_Num2                   volatile uint32_t
0x20000f70  0x4        RIPDParam.IN_Puls_Num3                   volatile uint32_t
0x20000f74  0x4        RIPDParam.IN_Puls_Num4                   volatile uint32_t
0x20000f78  0x4        RIPDParam.Puls_Width1R                   volatile uint32_t
0x20000f7c  0x4        RIPDParam.Puls_Width1                    volatile uint32_t
0x20000f80  0x4        RIPDParam.Puls_Width2                    volatile uint32_t
0x20000f84  0x4        RIPDParam.RIPD_StartFg                   volatile uint32_t
0x20000f88  0x4        RIPDParam.RIPD_EndFg                     volatile uint32_t
0x20000f8c  0x4        RIPDParam.RIPD_Anglepos                  volatile uint32_t
0x20000f90  0x2        RIPDParam.Puls_Seccnt                    volatile int16_t
0x20000f92  0x2        RIPDParam.Puls_Risingst_Fg               volatile int16_t
0x20000f94  0x2        RIPDParam.Puls_Rising_Fg                 volatile int16_t
0x20000f96  0x2        RIPDParam.Puls_Buffer_Fg                 volatile int16_t
0x20000f98  0x2        RIPDParam.Puls_Falling_Fg                volatile int16_t
0x20000f9a  0x2        RIPDParam.Puls_Discharg_Fg               volatile int16_t
0x20000f9c  0x2        RIPDParam.Puls_RisingCurrent             volatile int16_t
0x20000f9e  0x2        RIPDParam.Pulscnt                        volatile int16_t
0x20000fa0  0x4        RIPDParam.Puls_RisingTime                volatile uint32_t
0x20000fa4  0x4        RIPDParam.Puls_BufferTime                volatile uint32_t
0x20000fa8  0x4        RIPDParam.Puls_FallingTime               volatile uint32_t
0x20000fac  0x4        RIPDParam.Puls_DischargTime              volatile uint32_t
0x20000fb0  0x4        RIPDParam.Start_DeteAnglAdj              volatile uint32_t
0x20000fb4  0x2        RIPDParam.Hduty_U                        volatile uint16_t
0x20000fb6  0x2        RIPDParam.Hduty_U2                       volatile uint16_t
0x20000fb8  0x2        RIPDParam.Hduty_V                        volatile uint16_t
0x20000fba  0x2        RIPDParam.Hduty_V2                       volatile uint16_t
0x20000fbc  0x2        RIPDParam.Hduty_W                        volatile uint16_t
0x20000fbe  0x2        RIPDParam.Hduty_W2                       volatile uint16_t
0x20000fc0  0x2        RIPDParam.I_bus                          volatile int16_t

address     size       variable name                            type
0x20000f2c  0x1e       Rising_Compar_num                        array[15] of int16_t

address     size       variable name                            type
0x20000374  0x1f4      Rising_Current_num1                      array[250] of int16_t

address     size       variable name                            type
0x00000000  0x2        Rising_Current_num11                     int16_t

address     size       variable name                            type
0x20000568  0x1f4      Rising_Current_num2                      array[250] of int16_t

address     size       variable name                            type
0x00000000  0x2        Rising_Current_num21                     int16_t

address     size       variable name                            type
0x2000075c  0x1f4      Rising_Current_num3                      array[250] of int16_t

address     size       variable name                            type
0x00000000  0x2        Rising_Current_num31                     int16_t

address     size       variable name                            type
0x20000950  0x1f4      Rising_Current_num4                      array[250] of int16_t

address     size       variable name                            type
0x00000000  0x2        Rising_Current_num41                     int16_t

address     size       variable name                            type
0x20000b44  0x1f4      Rising_Current_num5                      array[250] of int16_t

address     size       variable name                            type
0x00000000  0x2        Rising_Current_num51                     int16_t

address     size       variable name                            type
0x20000d38  0x1f4      Rising_Current_num6                      array[250] of int16_t

address     size       variable name                            type
0x00000000  0x2        Rising_Current_num61                     int16_t

address     size       variable name                            type
0x00000000  0x2        iii                                      int16_t

address     size       variable name                            type
0x00000000  0x2        uuui                                     int16_t

address     size       variable name                            type
0x00000000  0x2        uuui1                                    int16_t

address     size       variable name                            type
0x00000000  0x2        yyyuu                                    int16_t

address     size       variable name                            type
0x00000000  0x2        yyyuu1                                   int16_t

address     size       variable name                            type
0x00003bd0  0x200      SinCos_Table                             array[256] of const int16

address     size       variable name                            type
0x20000344  0x18       Id_Controller                            MC_CONTROLLER_PI
0x20000344  0x4        Id_Controller.Up                         int32
0x20000348  0x4        Id_Controller.Ui                         int32
0x2000034c  0x2        Id_Controller.Err                        int16
0x2000034e  0x2        Id_Controller.LastErr                    int16
0x20000350  0x2        Id_Controller.Kp                         int16
0x20000352  0x2        Id_Controller.Ki                         int16
0x20000354  0x2        Id_Controller.Kc                         int16
0x20000356  0x2        Id_Controller.OutMax                     int16
0x20000358  0x2        Id_Controller.OutMin                     int16
0x2000035a  0x2        Id_Controller.Out                        int16

address     size       variable name                            type
0x200002dc  0x28       Id_Q15Control                            MC_CONTRO_PI
0x200002dc  0x4        Id_Q15Control.Up                         int32
0x200002e0  0x4        Id_Q15Control.Ui                         int32
0x200002e4  0x2        Id_Q15Control.Err                        int16
0x200002e6  0x2        Id_Q15Control.LastErr                    int16
0x200002e8  0x4        Id_Q15Control.Uc                         int32
0x200002ec  0x4        Id_Q15Control.Kp                         int32
0x200002f0  0x4        Id_Q15Control.Ki                         int32
0x200002f4  0x4        Id_Q15Control.OutMax                     int32
0x200002f8  0x4        Id_Q15Control.OutMin                     int32
0x200002fc  0x4        Id_Q15Control.Output                     int32
0x20000300  0x2        Id_Q15Control.Out                        int16

address     size       variable name                            type
0x2000035c  0x18       Iq_Controller                            MC_CONTROLLER_PI
0x2000035c  0x4        Iq_Controller.Up                         int32
0x20000360  0x4        Iq_Controller.Ui                         int32
0x20000364  0x2        Iq_Controller.Err                        int16
0x20000366  0x2        Iq_Controller.LastErr                    int16
0x20000368  0x2        Iq_Controller.Kp                         int16
0x2000036a  0x2        Iq_Controller.Ki                         int16
0x2000036c  0x2        Iq_Controller.Kc                         int16
0x2000036e  0x2        Iq_Controller.OutMax                     int16
0x20000370  0x2        Iq_Controller.OutMin                     int16
0x20000372  0x2        Iq_Controller.Out                        int16

address     size       variable name                            type
0x20000304  0x28       Iq_Q15Control                            MC_CONTRO_PI
0x20000304  0x4        Iq_Q15Control.Up                         int32
0x20000308  0x4        Iq_Q15Control.Ui                         int32
0x2000030c  0x2        Iq_Q15Control.Err                        int16
0x2000030e  0x2        Iq_Q15Control.LastErr                    int16
0x20000310  0x4        Iq_Q15Control.Uc                         int32
0x20000314  0x4        Iq_Q15Control.Kp                         int32
0x20000318  0x4        Iq_Q15Control.Ki                         int32
0x2000031c  0x4        Iq_Q15Control.OutMax                     int32
0x20000320  0x4        Iq_Q15Control.OutMin                     int32
0x20000324  0x4        Iq_Q15Control.Output                     int32
0x20000328  0x2        Iq_Q15Control.Out                        int16

address     size       variable name                            type
0x2000032c  0x18       Spd_Controller                           MC_CONTROLLER_PI
0x2000032c  0x4        Spd_Controller.Up                        int32
0x20000330  0x4        Spd_Controller.Ui                        int32
0x20000334  0x2        Spd_Controller.Err                       int16
0x20000336  0x2        Spd_Controller.LastErr                   int16
0x20000338  0x2        Spd_Controller.Kp                        int16
0x2000033a  0x2        Spd_Controller.Ki                        int16
0x2000033c  0x2        Spd_Controller.Kc                        int16
0x2000033e  0x2        Spd_Controller.OutMax                    int16
0x20000340  0x2        Spd_Controller.OutMin                    int16
0x20000342  0x2        Spd_Controller.Out                       int16

address     size       variable name                            type
0x00000000  0x28       Spd_Q15Control                           MC_CONTRO_PI
0x00000000  0x4        Spd_Q15Control.Up                        int32
0x00000004  0x4        Spd_Q15Control.Ui                        int32
0x00000008  0x2        Spd_Q15Control.Err                       int16
0x0000000a  0x2        Spd_Q15Control.LastErr                   int16
0x0000000c  0x4        Spd_Q15Control.Uc                        int32
0x00000010  0x4        Spd_Q15Control.Kp                        int32
0x00000014  0x4        Spd_Q15Control.Ki                        int32
0x00000018  0x4        Spd_Q15Control.OutMax                    int32
0x0000001c  0x4        Spd_Q15Control.OutMin                    int32
0x00000020  0x4        Spd_Q15Control.Output                    int32
0x00000024  0x2        Spd_Q15Control.Out                       int16

address     size       variable name                            type
0x00000000  0x2        ab_Flag                                  uint16_t

address     size       variable name                            type
0x20000268  0x74       myObserverVar                            MC_BEMFOBSERV
0x20000268  0x2        myObserverVar.hC1T                       int16
0x2000026a  0x2        myObserverVar.hC2T                       int16
0x2000026c  0x2        myObserverVar.hC3T                       int16
0x2000026e  0x2        myObserverVar.hC4T                       int16
0x20000270  0x2        myObserverVar.Speed_KLPF                 int16
0x20000272  0x2        myObserverVar.Ealpha                     int16
0x20000274  0x2        myObserverVar.EstIalpha                  int16
0x20000276  0x2        myObserverVar.Ialpha                     int16
0x20000278  0x4        myObserverVar.IalphaError                int32
0x2000027c  0x2        myObserverVar.Tsin                       int16
0x2000027e  0x2        myObserverVar.Tcos                       int16
0x20000280  0x2        myObserverVar.Ebeta                      int16
0x20000282  0x2        myObserverVar.EstIbeta                   int16
0x20000284  0x4        myObserverVar.IbetaError                 int32
0x20000288  0x2        myObserverVar.Ibeta                      int16
0x2000028a  0x2        myObserverVar.Zalpha                     int16
0x2000028c  0x2        myObserverVar.Zbeta                      int16
0x2000028e  0x2        myObserverVar.Kslide                     int16
0x20000290  0x2        myObserverVar.Kslf                       int16
0x20000292  0x2        myObserverVar.Kslf0                      int16
0x20000294  0x2        myObserverVar.KslfCoeff                  int16
0x20000296  0x2        myObserverVar.ThetaErr                   int16
0x20000298  0x4        myObserverVar.Kp_obs1                    int32
0x2000029c  0x4        myObserverVar.Ki_obs1                    int32
0x200002a0  0x2        myObserverVar.Alphaf32_1                 int16
0x200002a2  0x2        myObserverVar.Betaf32_1                  int16
0x200002a4  0x4        myObserverVar.Kp_obs2                    int32
0x200002a8  0x4        myObserverVar.Ki_obs2                    int32
0x200002ac  0x4        myObserverVar.Ki_obsm                    int32
0x200002b0  0x2        myObserverVar.Thetaf32_1                 int16
0x200002b2  0x2        myObserverVar.OmegaFltred                int16
0x200002b4  0x2        myObserverVar.Theta                      uint16
0x200002b6  0x2        myObserverVar.Thetafltr                  uint16
0x200002b8  0x2        myObserverVar.ThetaComp                  int16
0x200002ba  0x2        myObserverVar.SpdTemp                    int16
0x200002bc  0x2        myObserverVar.OmegaFltrCoeff             int16
0x200002be  0x2        myObserverVar.IntegralCoeff              int16
0x200002c0  0x4        myObserverVar.OpenFreq                   int32
0x200002c4  0x2      * myObserverVar.OpenFreqInc                int16
0x200002c8  0x4        myObserverVar.OpenInitFreq               int32
0x200002cc  0x4        myObserverVar.OpenEndFreq                int32
0x200002d0  0x2        myObserverVar.Omegamin                   int16
0x200002d2  0x1      * myObserverVar.OpenEnbl                   int8
0x200002d4  0x4        myObserverVar.EsValue                    int32
0x200002d8  0x2        myObserverVar.ObsSpeedRamp               int16
0x200002da  0x1        myObserverVar.ThetEbl                    int8

address     size       variable name                            type
0x20000038  0x4        uuuii                                    int

address     size       variable name                            type
0x20000024  0x4        Debug_ACC                                int

address     size       variable name                            type
0x20000028  0x4        Debug_Angle_Flag                         int

address     size       variable name                            type
0x00000000  0x4        Debug_IqRef                              int

address     size       variable name                            type
0x00000000  0x4        Debug_SpeedLoop_Flag                     int

address     size       variable name                            type
0x00000000  0x4        Debug_Vq                                 int

address     size       variable name                            type
0x2000023a  0x2c       FocVar                                   FocVarType
0x2000023a  0x1        FocVar.Sector                            volatile uint8
0x2000023b  0x1        FocVar.Svm_Section                       volatile uint8
0x2000023c  0x2        FocVar.Ia                                volatile int16
0x2000023e  0x2        FocVar.Ib                                volatile int16
0x20000240  0x2        FocVar.Ic                                volatile int16
0x20000242  0x2        FocVar.Ialpha                            volatile int16
0x20000244  0x2        FocVar.Ibeta                             volatile int16
0x20000246  0x2        FocVar.Ualpha                            volatile int16
0x20000248  0x2        FocVar.Ubeta                             volatile int16
0x2000024a  0x2        FocVar.Valpha                            volatile int16
0x2000024c  0x2        FocVar.Vbeta                             volatile int16
0x2000024e  0x2        FocVar.Id                                volatile int16
0x20000250  0x2        FocVar.Iq                                volatile int16
0x20000252  0x2        FocVar.IdRef                             volatile int16
0x20000254  0x2        FocVar.IqRef                             volatile int16
0x20000256  0x2        FocVar.Vd                                volatile int16
0x20000258  0x2        FocVar.Vq                                volatile int16
0x2000025a  0x2        FocVar.Sin                               volatile int16
0x2000025c  0x2        FocVar.Cos                               volatile int16
0x2000025e  0x2        FocVar.Angle                             volatile uint16
0x20000260  0x2        FocVar.IaAbs                             volatile int16
0x20000262  0x2        FocVar.IbAbs                             volatile int16
0x20000264  0x2        FocVar.IcAbs                             volatile int16

address     size       variable name                            type
0x20000020  0x2        VF_Angle                                 uint16_t

address     size       variable name                            type
0x00000000  0xae       circle_limit_table                       array[87] of const uint16

address     size       variable name                            type
0x20000030  0x4        mcAlpha_Belta_fbck                       MC_2PhSyst
0x20000030  0x2        mcAlpha_Belta_fbck.Alpha                 int16
0x20000032  0x2        mcAlpha_Belta_fbck.Beta                  int16

address     size       variable name                            type
0x20000204  0x36       mcDuty                                   MC_Tsvpwm
0x20000204  0x2        mcDuty.Ts1                               int16
0x20000206  0x2        mcDuty.Ts2                               int16
0x20000208  0x2        mcDuty.Au                                int16
0x2000020a  0x2        mcDuty.Ad                                int16
0x2000020c  0x2        mcDuty.Bu                                int16
0x2000020e  0x2        mcDuty.Bd                                int16
0x20000210  0x2        mcDuty.Cu                                int16
0x20000212  0x2        mcDuty.Cd                                int16
0x20000214  0x2        mcDuty.A                                 int16
0x20000216  0x2        mcDuty.B                                 int16
0x20000218  0x2        mcDuty.C                                 int16
0x2000021a  0x2        mcDuty.DutyA                             int16
0x2000021c  0x2        mcDuty.DutyAN                            int16
0x2000021e  0x2        mcDuty.DutyB                             int16
0x20000220  0x2        mcDuty.DutyBN                            int16
0x20000222  0x2        mcDuty.DutyC                             int16
0x20000224  0x2        mcDuty.DutyCN                            int16
0x20000226  0x1      * mcDuty.SVPWM5                            int8
0x20000228  0x2        mcDuty.Psector                           int16
0x2000022a  0x2        mcDuty.SamplePoint1                      int16
0x2000022c  0x2        mcDuty.SamplePoint2                      int16
0x2000022e  0x2        mcDuty.singleMethod                      int16
0x20000230  0x2        mcDuty.PwmPeriod                         int16
0x20000232  0x2        mcDuty.DeadTime                          int16
0x20000234  0x2        mcDuty.Min_window                        int16
0x20000236  0x2        mcDuty.Sample_Dalay1                     int16
0x20000238  0x2        mcDuty.Sample_Dalay2                     int16

