747lulu747/SAOZHAN_BRUASH/src/SDK-LIB/华芯第一版本硬件-非FPC/ROMAN-21DD - SDK - V0.1/out/SWM211.asm
address     size       variable name                            type
0x2000002c  0x4        mcUAlBereq                               MC_2PhSyst
0x2000002c  0x2        mcUAlBereq.Alpha                         int16
0x2000002e  0x2        mcUAlBereq.Beta                          int16

address     size       variable name                            type
0x20000034  0x4        mcV_AlphaBelta_req                       MC_2PhSyst
0x20000034  0x2        mcV_AlphaBelta_req.Alpha                 int16
0x20000036  0x2        mcV_AlphaBelta_req.Beta                  int16

address     size       variable name                            type
0x200001e4  0x20       TailWindDetect                           MotorTailWindTypeDef
0x200001e4  0x1      * TailWindDetect.TailWindFlag              uint8
0x200001e6  0x2        TailWindDetect.TailWindSpeed             uint16
0x200001e8  0x1        TailWindDetect.MotorDir                  uint8
0x200001e9  0x1        TailWindDetect.AngleState                uint8
0x200001ea  0x1        TailWindDetect.MotorTailWindState        uint8
0x200001eb  0x1        TailWindDetect.SpeedStoreNum             uint8
0x200001ec  0x2        TailWindDetect.SpeedCountTimer           uint16
0x200001ee  0x1      * TailWindDetect.SpeedTimerClearStatus     uint8
0x200001f0  0x4        TailWindDetect.TempThailWindSpeedBase    uint32
0x200001f4  0x1        TailWindDetect.SpeedOverFlowStatus       uint8
0x200001f5  0x1        TailWindDetect.ShakeTimes                uint8
0x200001f6  0x1      * TailWindDetect.PLLFlag                   uint8
0x200001f8  0x2        TailWindDetect.PLLDetectCnt              int16
0x200001fa  0x2        TailWindDetect.PLLTheta                  int16
0x200001fc  0x2        TailWindDetect.PLLSpeed                  int16
0x200001fe  0x1        TailWindDetect.AntiFlag                  uint8
0x200001ff  0x1        TailWindDetect.ThetaStep                 uint8
0x20000200  0x2        TailWindDetect.CCWtoCWWaitTime           uint16
0x20000202  0x2        TailWindDetect.TailWindOverTime          uint16

address     size       variable name                            type
0x2000001c  0x2        OverVolt                                 uint16

address     size       variable name                            type
0x2000001a  0x2        UnderVolt                                uint16

address     size       variable name                            type
0x200001ca  0xe        mcCurVarible                             CurrentVarible
0x200001ca  0x1      * mcCurVarible.OverCurCnt                  uint8
0x200001cc  0x2        mcCurVarible.Abs_ia                      uint16
0x200001ce  0x2        mcCurVarible.Abs_ib                      uint16
0x200001d0  0x2        mcCurVarible.Abs_ic                      uint16
0x200001d2  0x2        mcCurVarible.Max_ia                      uint16
0x200001d4  0x2        mcCurVarible.Max_ib                      uint16
0x200001d6  0x2        mcCurVarible.Max_ic                      uint16

address     size       variable name                            type
0x2000019c  0x2e       mcFaultDect                              FaultVarible
0x2000019c  0x2        mcFaultDect.segment                      uint16
0x2000019e  0x2        mcFaultDect.OverVoltDetecCnt             uint16
0x200001a0  0x2        mcFaultDect.UnderVoltDetecCnt            uint16
0x200001a2  0x2        mcFaultDect.VoltRecoverCnt               uint16
0x200001a4  0x2        mcFaultDect.CurrentRecoverCnt            uint16
0x200001a6  0x2        mcFaultDect.StallDelayCnt                uint16
0x200001a8  0x2        mcFaultDect.StallDectEs                  uint16
0x200001aa  0x2        mcFaultDect.StallDectSpeed               uint16
0x200001ac  0x2        mcFaultDect.StallDectESSpeed             uint16
0x200001ae  0x2        mcFaultDect.StallReCount                 uint16
0x200001b0  0x2        mcFaultDect.StallSpeedAndEsCnt           uint16
0x200001b2  0x2        mcFaultDect.Lphasecnt                    uint16
0x200001b4  0x2        mcFaultDect.AOpencnt                     uint16
0x200001b6  0x2        mcFaultDect.BOpencnt                     uint16
0x200001b8  0x2        mcFaultDect.COpencnt                     uint16
0x200001ba  0x2        mcFaultDect.Lpha3secnt                   uint16
0x200001bc  0x2        mcFaultDect.mcLossPHRecCount             uint16
0x200001be  0x2        mcFaultDect.StartESCount                 uint16
0x200001c0  0x2        mcFaultDect.StartEsCnt                   uint16
0x200001c2  0x2        mcFaultDect.StartDelay                   uint16
0x200001c4  0x2        mcFaultDect.StartFocmode                 uint16
0x200001c6  0x2        mcFaultDect.StartSpeedCnt                uint16
0x200001c8  0x2        mcFaultDect.StartSpeedAndEsCnt           uint16

address     size       variable name                            type
0x20000018  0x1        mcFaultSource                            FaultStateType

address     size       variable name                            type
0x200001d8  0xc        mcProtectTime                            ProtectVarible
0x200001d8  0x2        mcProtectTime.SecondStartTimes           uint16
0x200001da  0x2        mcProtectTime.StallTimes                 uint16
0x200001dc  0x2        mcProtectTime.LossPHTimes                uint16
0x200001de  0x2        mcProtectTime.CurrentPretectTimes        uint16
0x200001e0  0x1        mcProtectTime.StartFlag                  uint8
0x200001e1  0x1        mcProtectTime.StallFlag                  uint8
0x200001e2  0x1        mcProtectTime.over_VoltageTimes          uint8
0x200001e3  0x1        mcProtectTime.under_VoltageTimes         uint8

address     size       variable name                            type
0x20000011  0x7        McStaSet                                 MotStaM
0x20000011  0x1        McStaSet.CalibFlag                       uint8
0x20000012  0x1        McStaSet.ChargeFlag                      uint8
0x20000013  0x1        McStaSet.PosiCheckFlag                   uint8
0x20000014  0x1        McStaSet.AlignFlag                       uint8
0x20000015  0x1        McStaSet.TailWindFlag                    uint8
0x20000016  0x1        McStaSet.StartFlag                       uint8
0x20000017  0x1        McStaSet.RunFlag                         uint8

address     size       variable name                            type
0x20000160  0x24       mcCurOffset                              CurrentOffset
0x20000160  0x2      * mcCurOffset.IuOffset                     int16
0x20000164  0x4        mcCurOffset.IuOffsetSum                  int32
0x20000168  0x2      * mcCurOffset.IvOffset                     int16
0x2000016c  0x4        mcCurOffset.IvOffsetSum                  int32
0x20000170  0x2      * mcCurOffset.IwOffset                     int16
0x20000174  0x4        mcCurOffset.IwOffsetSum                  int32
0x20000178  0x2      * mcCurOffset.IbusOffset                   int16
0x2000017c  0x4        mcCurOffset.IbusOffsetSum                int32
0x20000180  0x2        mcCurOffset.OffsetCount                  int16
0x20000182  0x1        mcCurOffset.OffsetFlag                   int8

address     size       variable name                            type
0x20000184  0x18       mcStartRamp                              StartRamp_t
0x20000184  0x4        mcStartRamp.RampStepCount                int32
0x20000188  0x4        mcStartRamp.AlignTimeStep                uint32
0x2000018c  0x2        mcStartRamp.AlignCurrMax                 int16
0x2000018e  0x2        mcStartRamp.StartCurrInit                int16
0x20000190  0x2        mcStartRamp.StartCurrInc                 int16
0x20000192  0x2        mcStartRamp.StartCurrMax                 int16
0x20000194  0x4        mcStartRamp.StartRampInc                 int32
0x20000198  0x4        mcStartRamp.StartRampEnd                 int32

address     size       variable name                            type
0x00000000  0x2        VF_ACC                                   uint16

address     size       variable name                            type
0x00000000  0x2        VF_Vq                                    uint16

address     size       variable name                            type
0x20000010  0x1        mcState                                  MotStaType

address     size       variable name                            type
0x200000f4  0x14       AdcVarible                               ADCSample
0x200000f4  0x2        AdcVarible.ADCDcbus                      uint16
0x200000f6  0x2        AdcVarible.ADCIbus                       uint16
0x200000f8  0x2        AdcVarible.ADCSpeed                      uint16
0x200000fa  0x2        AdcVarible.ADCVref                       uint16
0x200000fc  0x4        AdcVarible.ADCPower                      uint32
0x20000100  0x2        AdcVarible.ADCInjectFlag                 uint16
0x20000102  0x2        AdcVarible.ADCInject1                    uint16
0x20000104  0x2        AdcVarible.ADCInject2                    uint16

address     size       variable name                            type
0x20000006  0x2        DebugSpeed                               uint16

address     size       variable name                            type
0x20000108  0x58       mcPwmInput                               PWMINPUTCAL
0x20000108  0x4        mcPwmInput.PWMHigh                       uint32
0x2000010c  0x4        mcPwmInput.PWMLow                        uint32
0x20000110  0x4        mcPwmInput.PWMARR                        uint32
0x20000114  0x4        mcPwmInput.PWMARROld                     uint32
0x20000118  0x4        mcPwmInput.ARRValue                      uint32
0x2000011c  0x4        mcPwmInput.DutyTemp                      float
0x20000120  0x2        mcPwmInput.PWMDuty                       uint16
0x20000122  0x2        mcPwmInput.PWMCompare                    uint16
0x20000124  0x2        mcPwmInput.PWMCompareOld                 uint16
0x20000126  0x2        mcPwmInput.PWMFlag                       uint16
0x20000128  0x2        mcPwmInput.PWMARRUpdate                  uint16
0x2000012a  0x2        mcPwmInput.PWMUpdateFlag                 int16
0x2000012c  0x4        mcPwmInput.PWMVSum                       uint32
0x20000130  0x2        mcPwmInput.PWMcnt                        uint16
0x20000132  0x1        mcPwmInput.PWMDivFlag                    uint8
0x20000133  0x1        mcPwmInput.PWMFlowCount                  uint8
0x20000134  0x2        mcPwmInput.PwmCompare                    uint16
0x20000136  0x2        mcPwmInput.PwmCompareUpdate              uint16
0x20000138  0x4        mcPwmInput.PwmArr                        uint32
0x2000013c  0x2      * mcPwmInput.PwmCompareOld                 uint16
0x20000140  0x4        mcPwmInput.PwmArrOld                     uint32
0x20000144  0x1      * mcPwmInput.PwmFlag                       uint8
0x20000148  0x4        mcPwmInput.PwmArrUpdate                  uint32
0x2000014c  0x2        mcPwmInput.PwmDuty                       uint16
0x2000014e  0x2        mcPwmInput.PwmSclk                       uint16
0x20000150  0x2      * mcPwmInput.PwmUpdateFlag                 int16
0x20000154  0x4        mcPwmInput.PwmVSum                       uint32
0x20000158  0x2        mcPwmInput.PwmCnt                        uint16
0x2000015a  0x1        mcPwmInput.PwmDivFlag                    uint8
0x2000015b  0x1        mcPwmInput.PwmDealFlag                   uint8
0x2000015c  0x2        mcPwmInput.FlowCount                     uint16
0x2000015e  0x2        mcPwmInput.ReInitCount                   uint16

address     size       variable name                            type
0x200000e8  0xc        ONOFFTest                                ONVarible
0x200000e8  0x4        ONOFFTest.ONOFF_Times                    uint32
0x200000ec  0x2        ONOFFTest.ON_Count                       uint16
0x200000ee  0x2        ONOFFTest.OFF_Count                      uint16
0x200000f0  0x1        ONOFFTest.ONOFF_Flag                     uint8

address     size       variable name                            type
0x00000000  0x2        QOUTMAXVALUE_set                         uint16

address     size       variable name                            type
0x20000004  0x2        mcFRState                                MotorFRTypeDef
0x20000004  0x1        mcFRState.FR                             uint8
0x20000005  0x1        mcFRState.TargetFR                       uint8

address     size       variable name                            type
0x20000064  0x6c       mcFocCtrl                                FOCCTRL
0x20000064  0x2        mcFocCtrl.CtrlMode                       uint16
0x20000066  0x2        mcFocCtrl.mcDcbusActual                  uint16
0x20000068  0x2        mcFocCtrl.mcDcbusFlt                     uint16
0x2000006a  0x2        mcFocCtrl.mcDcbusFlt_LSB                 int16
0x2000006c  0x2        mcFocCtrl.mcIbusFlt                      uint16
0x2000006e  0x2        mcFocCtrl.mcIbusFlt_LSB                  int16
0x20000070  0x2        mcFocCtrl.SpeedFlt                       int16
0x20000072  0x2        mcFocCtrl.SpeedFlt_LSB                   int16
0x20000074  0x2        mcFocCtrl.SpeedLimtFlag                  int16
0x20000076  0x2        mcFocCtrl.SpeedReal                      int16
0x20000078  0x2        mcFocCtrl.EsValue_LSB                    uint16
0x2000007a  0x2        mcFocCtrl.EsValue                        uint16
0x2000007c  0x2        mcFocCtrl.CurrentPower                   uint16
0x2000007e  0x2        mcFocCtrl.Powerlpf                       int16
0x20000080  0x2        mcFocCtrl.Powerlpf_LSB                   int16
0x20000082  0x2        mcFocCtrl.PowerLimtFlag                  int16
0x20000084  0x2        mcFocCtrl.mcIqref                        int16
0x20000086  0x2        mcFocCtrl.mcIqref_LSB                    int16
0x20000088  0x2        mcFocCtrl.QoutValue                      int16
0x2000008a  0x2        mcFocCtrl.DoutValue                      int16
0x2000008c  0x2        mcFocCtrl.UqFlt                          int16
0x2000008e  0x2        mcFocCtrl.UqFlt_LSB                      int16
0x20000090  0x2        mcFocCtrl.UdFlt                          int16
0x20000092  0x2        mcFocCtrl.UdFlt_LSB                      int16
0x20000094  0x2        mcFocCtrl.AlignCurrMax                   int16
0x20000096  0x2        mcFocCtrl.AntiAlignFlag                  int16
0x20000098  0x4        mcFocCtrl.TailwindSpeed                  int32
0x2000009c  0x4        mcFocCtrl.AntiAlignCount                 int32
0x200000a0  0x4        mcFocCtrl.Align_Run_Cnt                  int32
0x200000a4  0x2        mcFocCtrl.SpeedLoopTime                  uint16
0x200000a6  0x2        mcFocCtrl.RunStateCnt                    uint16
0x200000a8  0x2        mcFocCtrl.PowerLoopTime                  uint16
0x200000aa  0x2        mcFocCtrl.TorqueLoopTime                 uint16
0x200000ac  0x2        mcFocCtrl.RunCurrent                     uint16
0x200000ae  0x2        mcFocCtrl.ChargeStep                     uint16
0x200000b0  0x4        mcFocCtrl.State_Count                    int32
0x200000b4  0x2      * mcFocCtrl.MotorTime                      uint16
0x200000b8  0x4        mcFocCtrl.Delay_MsCount                  uint32
0x200000bc  0x1        mcFocCtrl.LimitCurrentFlag               uint8
0x200000bd  0x1        mcFocCtrl.LimitFlag_Current              uint8
0x200000be  0x1      * mcFocCtrl.LimitFlag_Speed                uint8
0x200000c0  0x2      * mcFocCtrl.OverTimeWindCount              uint16
0x200000c4  0x4        mcFocCtrl.FG_HzCount                     uint32
0x200000c8  0x2        mcFocCtrl.FG_Load                        uint16
0x200000ca  0x2        mcFocCtrl.FG_Duty                        uint16
0x200000cc  0x4        mcFocCtrl.mcActualDcbus                  float

address     size       variable name                            type
0x200000d0  0x16       mcSpeedRamp                              MCRAMP
0x200000d0  0x2        mcSpeedRamp.TargetValue                  int16
0x200000d2  0x2        mcSpeedRamp.TargetValue_Temp             int16
0x200000d4  0x2        mcSpeedRamp.ActualValue                  int16
0x200000d6  0x2        mcSpeedRamp.IncValue                     int16
0x200000d8  0x2        mcSpeedRamp.DecValue                     int16
0x200000da  0x2        mcSpeedRamp.DelayCount                   int16
0x200000dc  0x2        mcSpeedRamp.DelayPeriod                  int16
0x200000de  0x1        mcSpeedRamp.FlagONOFF                    int8
0x200000df  0x1        mcSpeedRamp.DelayFlagOFF                 uint8
0x200000e0  0x1      * mcSpeedRamp.DelayFlagON                  uint8
0x200000e2  0x2        mcSpeedRamp.DelayOffCount                uint16
0x200000e4  0x2        mcSpeedRamp.DelayOnCount                 uint16

address     size       variable name                            type
0x20000000  0x4        mcSysState                               SysState
0x20000000  0x2        mcSysState.DACSetValue                   int16
0x20000002  0x1        mcSysState.VoltageNormal_Flag            uint8
0x20000003  0x1        mcSysState.PowerOnNormalWork_Flag        uint8

address     size       variable name                            type
0x00000000  0x2        set_speed                                uint16

